<template>
  <div style="padding: 8px">
    <h5>调香师</h5>
    <Character :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      deductionCN: [
        {
          role: '调香师',
          id: '1',
          title: '心有灵犀',
          content: '我们有别人不懂的默契。',
          conclusion: '一张老照片：两个长得一模一样的小女孩手牵手站在花田里，一个开朗，一个怯懦，却十分亲密。照片的右下角有两个名字：薇拉·奈尔、克洛伊·奈尔。'
        },
        {
          role: '调香师',
          id: '2',
          title: '疏离',
          content: '大人们向来如此，喜欢自以为是地批判，无休止地比较。',
          conclusion: '“克洛伊？谁有功夫理会那个只知道调香的怪人？不过她的姐姐薇拉实在是位优雅又讨人喜欢的美人。”一位格拉斯的住民如是说道。'
        },
        {
          role: '调香师',
          id: '3',
          title: '恩赐',
          content: '气味讲述着大自然的故事，但并不是每个人都有幸与之产生共鸣。',
          conclusion: '薇拉的日记：克洛伊有着所有调香师都梦寐以求的天赋，她应该再自信一点的。'
        },
        {
          role: '调香师',
          id: '4',
          title: '尝试',
          content: '创新，在被证明可以成功之前，总是为人不喜的。',
          conclusion: '一封信：如果想让你的作品有机会出现在人前，就立刻停下你怪异又滑稽的尝试。落款：克雷格·奈尔，家族店铺管理人。'
        },
        {
          role: '调香师',
          id: '5',
          title: '温暖',
          content: '玫瑰两份，檀香五份，天竺葵、花梨木各一份，加在一起是姐姐的味道！',
          conclusion: '薇拉对她的好是她回忆里为数不多的温暖。只有姐姐愿意认真听她说话，支持她做那些在别人眼里看来稀奇古怪的实验。'
        },
        {
          role: '调香师',
          id: '6',
          title: '这些本该都是属于我的！',
          content: '整场游戏不触发校准失败/不触发校准失败/不触发校准失败',
          conclusion: '一张剪报：调香师薇拉·奈尔初露锋芒，其作品被业内人士大加赞赏，新开张的香水铺日进斗金。本应该是传达喜讯的剪报，却有着被撕碎后重新粘贴的痕迹。'
        },
        {
          role: '调香师',
          id: '7',
          title: '复仇',
          content: '不甘与仇恨的种子，终于迎来了能帮助他们破土而出的雨露。',
          conclusion: '带上迷香和锋利的匕首，从此以后她就是薇拉·奈尔了。至于莫名失踪了的克洛伊呢？她想不会有人在意的。'
        },
        {
          role: '调香师',
          id: '8',
          title: '正轨',
          content: '原来成为人群的焦点是这样的感受。',
          conclusion: '一张照片：香水铺前被众人簇拥着的“薇拉”神态高傲，举止优雅。眼神里似乎有嘲讽，似有享受。'
        },
        {
          role: '调香师',
          id: '9',
          title: '后悔药',
          content: '并不是所有的错误都有机会被弥补。',
          conclusion: '薇拉的日记：克洛伊的天赋不该这样被淹没，那些带着有色眼镜的家伙，我会向他们证明的。但以克洛伊的骄傲一定不想我这样帮她，我该怎么做呢？'
        },
        {
          role: '调香师',
          id: '10',
          title: '抉择',
          content: '杀了这个世界上唯一一个真正爱她的人，她很难过。',
          conclusion: '可更令她难过的是，她已经习惯了本属于那个人的生活。'
        }
      ],
      letterCN: [
        {
          role: '调香师',
          id: 'I',
          year: '2020',
          title: '给“薇拉·奈尔”的信',
          letter:
            '亲爱的姐姐：\n我过得很好，最近发生的每一件事，最近遇见的每一个人都很好。\n好得让我胆战心惊。\n因为从心底，我非常清楚，这些东西源自什么。\n是你。\n是“薇拉·奈尔”。\n作为这世上唯一知晓其中奥秘的人，我觉得好累。\n如果有什么办法能让我忘记就好了。\n\n爱你的\n妹妹'
        },
        {
          role: '调香师',
          id: 'II',
          year: '2021',
          title: '薇拉的庄园日记',
          letter:
            '第一夜\n\n那幅画如同恶魔的请帖，散发出诡异又熟悉的味道。\n是过往的诅咒。\n我看到自己又回到了那个绝望之所，那处人与人相互奉承又相互蔑视的“垃圾堆”，那个不断灌入评判与挑剔扼人鼻息的“烂泥潭”，还有那朵倒在我面前被血泊步步浸蚀的唯一的“百合花”…… 腥臭与花香糅杂的诡异气味，继那天之后，竟是在一幅画上再现——也许这才是“幻觉”的诱因。\n最可笑的是，我一直以为他只是个离家寻找刺激不谙世事的少爷，真是天真，也许，来到这里的就没几个正常人。\n我不知道他究竟是怎么做到的，但无论如何，他和那个“异类”同样危险。\n我必须保持警觉，绝不能让意识再次被诱导。\n遗忘之物不需要再被想起，我不需要回忆。\n对，该尽快找到那种草药。'
        },
        {
          role: '调香师',
          id: 'III',
          year: '2022',
          title: '薇拉·奈尔的一页实验档案',
          letter:
            '编号：5-0-2\n姓名：薇拉·奈尔\n\n【测试标记】\n1、机敏多疑\n2、内心脆弱\n3、良知尚存\n\n【测试倾向】\n如履薄冰的自我麻痹者\n【测试结果】\n1、整体评价：5-0-2号实验对象，人性恶的测试属性值远低于预期。\n2、流程说明：\n5-0-2号擅长制香，对气味的物质成分极其敏感，实验药剂未必能成功对其造成影响，因此需投入其他可激化5-0-2号情绪的实验因子，本组实验尝试加入自称可通灵见到亡者的信仰者。\n至于是否向5-0-2提供调香器材，根据过程推演的模型而论，提供器材利大于弊——存在实验药剂被分析解读的风险，但情绪不稳的状态下，5-0-2号理性情绪占主导分析药剂的可能性较低；5-0-2号调配具有特殊效用的香水影响其他实验对象的可能性较高。\n3、分析总结：\n器材的准备是必要且正确的。不仅仅是其他实验对象，5-0-2号对自己也使用了特制香氛，该行为在一定程度上推动了实验的进程，使第四日与第五日的实验得到了某种戏剧性的结果。过程中的意外收获是，5-0-2号对自己使用特制香氛的防卫行为，从另一侧面论证了5-0-3催眠作用的影响范围。\n然而该实验对象的最终表现仍不满足预期。\n实验期望记录5-0-2号的行为动力是“恐惧”与“偏激化夺取”，出于对环境记忆与亡者记忆再被提起的恐惧，以及为远离过往遭遇而逐渐偏激的夺取尊重、夺取名誉、夺取爱慕的反向型逃避行为。\n但显然，5-0-2号只在实验中论证了前者，并未如同推演模型一般为了后者不择手段，虽与5-0-3号实验者达成短期协议，共同使5-0-5号处于不利境地，但5-0-2号此后并未表现出更多偏激行为，并未向其他实验对象夺取更多以保证自身的绝对安全，甚至于其恢复记忆后还出现类似理智崩溃这种尚存良知的反应。\n最终结论：5-0-2号实验结果未达到预期，推演模型急需修正。'
        },
        {
          role: '调香师',
          id: 'IV',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '调香师',
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

<style>
.demo-table-expand {
  font-size: 0;
}

.demo-table-expand .el-form-item {
  margin-right: 0;
  margin-bottom: 0;
  width: 100%;
  white-space: pre-wrap;
}
</style>
