<template>
  <div style="padding: 8px">
    <h5>调香师</h5>
    <Letter :letter="letterCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      letterCN: [
        {
          id: 'I',
          year: '2020',
          title: '给“薇拉·奈尔”的信',
          letter:
            '亲爱的姐姐：\n我过得很好，最近发生的每一件事，最近遇见的每一个人都很好。\n好得让我胆战心惊。\n因为从心底，我非常清楚，这些东西源自什么。\n是你。\n是“薇拉·奈尔”。\n作为这世上唯一知晓其中奥秘的人，我觉得好累。\n如果有什么办法能让我忘记就好了。\n\n爱你的\n妹妹'
        },
        {
          id: 'II',
          year: '2021',
          title: '薇拉的庄园日记',
          letter:
            '第一夜\n\n那幅画如同恶魔的请帖，散发出诡异又熟悉的味道。\n是过往的诅咒。\n我看到自己又回到了那个绝望之所，那处人与人相互奉承又相互蔑视的“垃圾堆”，那个不断灌入评判与挑剔扼人鼻息的“烂泥潭”，还有那朵倒在我面前被血泊步步浸蚀的唯一的“百合花”…… 腥臭与花香糅杂的诡异气味，继那天之后，竟是在一幅画上再现——也许这才是“幻觉”的诱因。\n最可笑的是，我一直以为他只是个离家寻找刺激不谙世事的少爷，真是天真，也许，来到这里的就没几个正常人。\n我不知道他究竟是怎么做到的，但无论如何，他和那个“异类”同样危险。\n我必须保持警觉，绝不能让意识再次被诱导。\n遗忘之物不需要再被想起，我不需要回忆。\n对，该尽快找到那种草药。'
        },
        {
          id: 'III',
          year: '2022',
          title: '薇拉·奈尔的一页实验档案',
          letter:
            '编号：5-0-2\n姓名：薇拉·奈尔\n\n【测试标记】\n1、机敏多疑\n2、内心脆弱\n3、良知尚存\n\n【测试倾向】\n如履薄冰的自我麻痹者\n【测试结果】\n1、整体评价：5-0-2号实验对象，人性恶的测试属性值远低于预期。\n2、流程说明：\n5-0-2号擅长制香，对气味的物质成分极其敏感，实验药剂未必能成功对其造成影响，因此需投入其他可激化5-0-2号情绪的实验因子，本组实验尝试加入自称可通灵见到亡者的信仰者。\n至于是否向5-0-2提供调香器材，根据过程推演的模型而论，提供器材利大于弊——存在实验药剂被分析解读的风险，但情绪不稳的状态下，5-0-2号理性情绪占主导分析药剂的可能性较低；5-0-2号调配具有特殊效用的香水影响其他实验对象的可能性较高。\n3、分析总结：\n器材的准备是必要且正确的。不仅仅是其他实验对象，5-0-2号对自己也使用了特制香氛，该行为在一定程度上推动了实验的进程，使第四日与第五日的实验得到了某种戏剧性的结果。过程中的意外收获是，5-0-2号对自己使用特制香氛的防卫行为，从另一侧面论证了5-0-3催眠作用的影响范围。\n然而该实验对象的最终表现仍不满足预期。\n实验期望记录5-0-2号的行为动力是“恐惧”与“偏激化夺取”，出于对环境记忆与亡者记忆再被提起的恐惧，以及为远离过往遭遇而逐渐偏激的夺取尊重、夺取名誉、夺取爱慕的反向型逃避行为。\n但显然，5-0-2号只在实验中论证了前者，并未如同推演模型一般为了后者不择手段，虽与5-0-3号实验者达成短期协议，共同使5-0-5号处于不利境地，但5-0-2号此后并未表现出更多偏激行为，并未向其他实验对象夺取更多以保证自身的绝对安全，甚至于其恢复记忆后还出现类似理智崩溃这种尚存良知的反应。\n最终结论：5-0-2号实验结果未达到预期，推演模型急需修正。'
        },
        {
          id: 'IV',
          year: '2023',
          title: 'Coming Soon',
          letter: 'Coming Soon'
        },
        {
          id: 'V',
          year: '2024',
          title: 'Coming Soon',
          letter: 'Coming Soon'
        }
      ]
    }
  }
}
</script>

<style>
.demo-table-expand {
  font-size: 0;
}

.demo-table-expand .el-form-item {
  margin-right: 0;
  margin-bottom: 0;
  width: 100%;
  white-space: pre-wrap;
}
</style>
