<template>
  <div>
    <h5>小丑</h5>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '小丑',
          type: '传闻',
          text: '马戏团有两种小丑，带来欢乐的微笑小丑和引人嘲弄的哭泣小丑。裘克厌倦了自己的角色，他给自己戴上了一张永恒的笑面。'
        },
        {
          role: '小丑',
          type: '故事背景',
          text: '裘克曾经是马戏团中的当家，天生的哭丧脸使他成为最棒的哭泣小丑。而这种优势在英俊的微笑小丑瑟吉和美艳的杂技女明星娜塔莉加入马戏团后，发生了变化。他意识到自己应当转换一下“职业跑道”。显然，在获得一张永恒的笑脸后，裘克能在新的喜剧表演中尽情发挥了。'
        }
      ],
      deductionCN: [
        {
          role: '小丑',
          id: '1',
          title: '心之乐章',
          content: '仔细倾听，你会发现他们的。',
          conclusion: '小丑波尔卡是我的最爱，让我想起在马戏团的美好时光。'
        },
        {
          role: '小丑',
          id: '2',
          title: '她的“宠物”',
          content: '真可爱，不管是它还是她。',
          conclusion: '一张照片：拿着皮鞭的女驯兽师站在一头狮子面前。'
        },
        {
          role: '小丑',
          id: '3',
          title: '她的“情人”',
          content: '他们看起来……很相配。',
          conclusion: '一张照片：女驯兽师和微笑的小丑在马戏团的亲密合影。远处角落站着一个哭丧脸的男人。'
        },
        {
          role: '小丑',
          id: '4',
          title: '观众',
          content: '他们薄情又易变，永远追逐着更新更刺激的表演。',
          conclusion: '日记：哭泣的小丑永远不会成为滑稽戏的主角，再悲惨的遭遇只要演上十次就会显得愚蠢。'
        },
        {
          role: '小丑',
          id: '5',
          title: '谢幕',
          content: '优秀的表演者懂得如何恰当地结束表演。',
          conclusion: '小丑以自身或同伴的屈辱换取旁观者的愉悦感，这种表演激发的是更黑暗的灵魂内核。'
        },
        {
          role: '小丑',
          id: '6',
          title: '欢笑',
          content: '小丑费尽心思让观众大哭，却忘了让自己微笑。',
          conclusion: '笑吧，小丑，笑吧！即使你的心支离破碎，即使你之所爱不能回报于你。'
        },
        {
          role: '小丑',
          id: '7',
          title: '她的“狱卒”',
          content: '不经意间发现的真相才最让人战栗。',
          conclusion: '日记：可怜的娜塔莉，她的背上全是伤痕……我必须跟那个混蛋谈谈！他得停止这种行为。'
        },
        {
          role: '小丑',
          id: '8',
          title: '爱的代价',
          content: '每件事都需要我们付出代价。',
          conclusion: '剪报：马戏团的神秘火灾！知名滑稽戏演员在休息室遭遇意外，面部严重烧伤，已无法继续出演悲伤小丑一角。'
        },
        {
          role: '小丑',
          id: '9',
          title: '笑话',
          content: '不是所有笑话都好笑。',
          conclusion: '日记：她走了，连那些“宠物”都没带走。我早该知道的。你真是蠢得像个笑话！'
        },
        {
          role: '小丑',
          id: '10',
          title: '新面貌',
          content: '人们常说，旧的不去，新的不来。',
          conclusion: '谢谢你，这是一张合适的脸。'
        }
      ],
      letterCN: [
        {
          role: '小丑',
          id: 'I',
          year: '2020',
          title: '调查报告',
          letter: '尊敬的麦克·莫顿先生:\n警局内部消息称，月亮河惨案中的“无面人”四肢健全，与此前报道中遭镪水毁容的受害者裘克身体状况不符。\n我们仍在调查瑟吉的下落，但以目前掌握的证据来看，我们认为他可能并没有活着离开月亮河公园。\n\n祝安\n您忠诚的\n亚瑟·罗素'
        },
        {
          role: '小丑',
          id: 'II',
          year: '2021',
          title: '被撕掉的一页',
          letter: '晚餐前不知道谁从一堆旧物里找到了一个留声机，他们几个犹豫着将唱针放到唱片上，那“吱吱”的吵声令人烦躁。仅几秒后，身后传来的曲音让我停下了离开的脚步，曲声那么熟悉，但名字到了嘴边就是叫不出来。\n众人陷入了沉默,我想大家和我一样都在思索着，只有瑟吉显得格外雀跃。“天真”与“他”，多么格格不入。只见他双手叉腰，开心地跳了起来。我知道瑟吉绝对不会这样跳舞的，他不明白简单的快乐，他从未真的喜欢过这首曲子，他不会在跳起来的时候让左脚先落地！我想起来了，这是《小丑》波尔卡，是右腿不灵活的裘克最爱的曲子，他喜欢它诙谐的音乐，他喜欢别人为他的笨拙发出愉悦的笑声。\n“哦，瑟吉，你还是那么棒。”角落的女人嗫嗫嚅嚅。她的声音轻柔到失真，却划破了这美好的一切。\n这张我曾经深爱过的面庞，逐渐与马戏团后独自锯木头时那张落寂的脸重叠，然后我看到了从未见过的扭曲与狰狞。\n简单的快乐从来都是如此短暂。'
        },
        {
          role: '小丑',
          id: 'III',
          year: '2022',
          title: '裘克的一页实验档案',
          letter: '编号：8-0-3\n姓名：裘克\n\n【测试标记】\n1、悲观\n2、自卑\n3、脆弱\n\n【测试倾向】\n崩溃边缘的危险制造者\n\n【测试结果】\n1、整体评价:\n毁容事件之前的8-0-3，是用富有喜剧意味的愁苦面孔、为观众们带来欢笑的哭泣小丑，隐藏在哭泣面孔后的是8-0-3的脆弱与自卑。\n月亮河公园惨案碾碎了8-0-3的哭脸面具，戴上笑脸面具的8-0-3开始习惯用暴力去解决问题。\n\n2、流程说明：\n如实验计划所设计的，一张留在桌面上的剧目排演规则成为了“喧嚣”众人意见分歧的开始。\n不出所料，8-0-1对剧目排演兴奋不已，并迅速将规则告知众人。该组其他成员对于排演规则的反应均在预料之中，除了8-0-3。\n8-0-3认定所谓的剧目实际为一场现实中的厮杀，并即刻行动——以搜集“表演灵感” 为由，将该组被边缘化的8-0-1约出，在切断其机械腿后，将其丢出庄园，任由无法行动的8-0- 1在冰天雪地里自生自灭。\n8-0-3的悲观是本组实验的催化剂，加速本组成员间的阵营分化。\n8-0-3的偏激行为则是导致本组实验走向毁灭式结局的元凶。\n\n3、分析总结：\n在最初实验设计上，8-0-3本应是本组最后的幸存者。\n但即便没有施加药物影响，8-0-3的情绪依然不受控制地走向极端。\n究其原因是8-0-3内心深处根深蒂固的自卑。\n旧面具下的8-0-3,依靠的是卑微的讨好。而新面具于8-0-3，不过是一戳即破的谎言。\n实验中，当再次遇到“喧嚣”旧人的8-0-3，发现形势与预期不相符时，不再被动接受现实，而是试图通过暴力手段、成为主导者去获取他想要的结果。\n然而高压环境下，8-0-3脆弱的内心并无法支持他长时间保持足够的强势与警觉，随着马戏团惨案的“情境重现”他的“谎言铠甲”分崩离析。\n真相揭晓后，8-0-3无法面对摘下面具后“赤裸”的自己，情绪失控。最终与被使用药物的8- 1-4走向了相同的结局。\n这一实验结果证明，本质敏感且脆弱的人，无需药物影响，也会在崩溃的边缘跌落，作为药物实验的比照用例，并无法足够准确地提供比照结果，在将来的比照用例选择上，应该尽量避免。'
        },
        {
          role: '小丑',
          id: 'IV',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '小丑',
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

