<template>
  <div>
    <h5>园丁</h5>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
import Character from '@/components/element/Character.vue'
export default {
  components: { Character },
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '园丁',
          type: '传闻',
          text: '她完美的园艺技巧只为亲爱的稻草人先生服务。嘿，装饰你的梦中情人有什么问题？只要拥有足够的金钱就行。'
        },
        {
          role: '园丁',
          type: '故事背景',
          text: '已经找到了那个特别的“唯一”，现在艾玛终于能够安心地使用自己完美的园艺技巧和才艺了。也许亲爱的稻草人先生还需要一些修饰，换掉那些腐坏的深棕色茅草，再加上一顶新的帽子。当然，她从来不是只看外表的女孩。不过，嘿，装饰你的梦中情人有什么问题？只要拥有足够的金钱就行。'
        }
      ],
      deductionCN: [
        {
          role: '园丁',
          id: 1,
          title: '幸福生活',
          content: '因为有你的陪伴才让我充满希望。',
          conclusion: '照片：穿着黄色背带裤的短发中年男子站在中间。左下角写着“父亲”。'
        },
        {
          role: '园丁',
          id: 2,
          title: '新朋友',
          content: '我会在这里遇见谁呢？',
          conclusion: '小女孩的日记1：爸爸的新朋友是个穿着西装头发梳得发亮的年轻叔叔。他很热情，总是带着鲜花来。'
        },
        {
          role: '园丁',
          id: 3,
          title: '厄运来临',
          content: '别让那些家伙靠近我！',
          conclusion: '幸福是转瞬即逝的，即使竭力避开，也无法逃开下一次厄运的追逐。'
        },
        {
          role: '园丁',
          id: '4',
          title: '别离',
          content: '在对方察觉前离开，也许这样就不用面临分离的痛苦。',
          conclusion: '小女孩的日记3：妈妈走了。那天晚上我没有睡着，她留下的最后一句话是“对不起”。'
        },
        {
          role: '园丁',
          id: '5',
          title: '合作',
          content: '当我们与他人合作时，纷争也许是无法避免的。',
          conclusion: '当我们与他人合作时，纷争也许是无法避免的。'
        },
        {
          role: '园丁',
          id: '6',
          title: '好奇心',
          content: '我想知道里面是什么！',
          conclusion: '都是一些破烂，不过好歹还能用个几次。我是说，我们应该变废为宝。'
        },
        {
          role: '园丁',
          id: '7',
          title: '维修',
          content: '这些密码机看上去还能用，也许我该让它们重获新生。',
          conclusion: '我想，我知道该如何打开那扇门了。'
        },
        {
          role: '园丁',
          id: '8',
          title: '避难',
          content: '灾难来临前，他将我送走。而现在，只剩下我一个人。',
          conclusion: '照片：一个八九岁的女孩站在一间孤儿院的门口。右下角写着几个字：我心爱的丽莎'
        },
        {
          role: '园丁',
          id: '9',
          title: '破坏',
          content: '如果说我从过去学到了什么，那就是在事情变得更糟前趁早行动。',
          conclusion: '小女孩的日记4：爸爸喝了太多酒，他开始从家里拿东西出去卖。有时候会有陌生人闯进家里搬走东西。我不知道发生了什么，但这感觉很糟糕。'
        },
        {
          role: '园丁',
          id: '10',
          title: '救赎',
          content: '我常常想，如果那时候曾经有个人帮帮我就好了。现在，也许我能帮助别人？',
          conclusion: '照片：十四岁的少女被固定在椅子上接受电疗。一位女性医生正操作着仪器。'
        },
        {
          role: '园丁',
          id: '11',
          title: '残像',
          content: '我从未想过会以这样的方式与他相逢，不，这不可能是真的！',
          conclusion: '照片：一栋建筑物燃起了熊熊大火，隐约能见到建筑物的招牌，军工厂'
        },
        {
          role: '园丁',
          id: '12',
          title: '救赎',
          content: '我常常想，如果那时候曾经有个人帮帮我就好了。现在，也许我能帮助别人？',
          conclusion: '照片：十四岁的少女被固定在椅子上接受电疗。一位女性医生正操作着仪器。'
        }
      ],
      letterCN: [
        {
          role: '园丁',
          id: 1,
          year: '2019',
          title: '一封未收到的信',
          letter: '亲爱的里奥：\n当你看到这封信时，我知道你不会高兴，事实上，我相信你会非常生气。弗雷迪向我求婚了。\n我接受了。\n留下这封信并不是想寻求你的谅解，我知道自己将要做一件非常糟糕的事情。\n但看在丽莎的份上，请一定要谨慎考虑之前我们争论过的投资。\n纺织厂的竞争很激烈，我知道。\n可是，请相信我，人们总是要穿新衣服的，而来复枪可不是什么“日常用品”。\n更何况，人们为什么要购买你的来复枪呢？\n毕竟，贝克家向上数五代也没一个人擅长打猎！\n抱歉，我又开始了。\n我不应该对你的生意指手画脚。\n但亲爱的，这就像一种本能，我总是希望你能做出最明智的选择。\n照顾好丽莎，找一个更适合你的女人。\n再次，我真的很抱歉。\n玛莎·雷明顿'
        },
        {
          role: '园丁',
          id: 2,
          year: '2020',
          title: '军工厂失火案024号证物',
          letter: '（一叠纸张，最上面的看起来是一封没寄出的信，有反复涂改的痕迹）\n亲爱的丽莎：\n……你在孤儿院过得怎么样？我交代过神父每天给你加一瓶牛奶，你要记得喝。这天越来越冷了，你晩上睡觉总喜欢踢被子，虽然可能是随的我，但这毛病不好，一定要改掉。\n还有你母亲，她选择离开这件事和你一点关系都没有，你不是没人要的孩子，她（字迹被涂掉，看不清內容）。\n孩子，我要离开这了，想看看有没有新的赚钱的法子，不用找我。\n你要好好长大成人，好好活下去。\n以后你一定要记住，不要轻信任何人，要为自己活下去，太多的善意并不能绐你带来好运，爸爸花了太长时间来学会这些，但我知道，我的丽莎一向聪明，知道该怎么做。\n最后，还记得我们经常玩的烧草人游戏吗？不久，那被诅咒的工厂都会是你的玩具。\n这大概是你无能的父亲唯一能为你做的。\n……………………\n（后面的內容因为烟熏已经无法辨认，信纸下还有一堆单据，其中露出的一角写着\n赔偿金受益人：丽莎·贝克）'
        },
        {
          role: '园丁',
          id: 3,
          year: '2021',
          title: '艾玛·伍兹的一页实验档案',
          letter: '编号：4-1-1\n姓名：艾玛·伍兹\n\n【测试标记】\n1、表面无害\n2、神经质\n3、有仇必报\n\n【测试倾向】\n存疑的“幻想者”\n\n【测试结果】\n1、4-1-1号是一个缺乏安全感的人。在陌生的环境里，她会为了自我保护而对某些物品产生强烈的情感依赖，进而产生幻想。\n2、流程说明：\n   在庄园里，4-1-1号面对三个复仇目标（即4-0-2、4-0-3、4-0-4），可以伪装出一个“甜心小姐”的形象以便推行自己的计划。\n但在4-1-1号独处的时候，她会因不安的心情和复仇计划的压力，而将情感依赖倾注在“稻草人”这一物件上。\n\n3、实验总结：\n4-1-1号会以物品为载体产生幻想的行为模式，源于其童年和少年时期被反复遗弃和背叛的经历。这段经历根植于她的记忆，令其精神长期处于惶恐和紧张的状态中。而本次实验所使用的药剂放大了她的恐惧和不安，致使其幻想的目标成为了“会说话的稻草人”。\n推动情况发生改变的，是4-0-4号。\n   4-0-4号在发现了4-1-1号的幻想症状后，仍愿意倾听、接纳、信任她。4-1-1号在于与4-0-4号相处中获得了真正的安全感，而对“稻草人”的依赖逐渐减少。由此，4-0-4号在4-1-1心中从复仇目标，变为了依赖的对象。相对的，在此过程中，4-1-1号从未停止对4-0-2号的复仇计划。\n在游戏中，4-1-1号对“稻草人”作为复仇道具一并烧毁。这表明她的情感已经完全从这件物品中抽离，而全部寄托于4-0-4号。然而……\n（实验档案未完，后续另有涂改修正）'
        },
        {
          role: '园丁',
          id: 4,
          year: '2022',
          title: '贴着一枝干蓟花的未填写寄送信息的信',
          letter: '亲爱的妈妈：\n这一组里的新朋友偷偷提醒我要时刻记录点滴，提防记忆欺骗自己，他们觉得自己的记忆像顽童的拼图一样开始出现空缺与违和的拼凑。\n他们不知道我脑中的记忆拼图其实早已遗失得几乎只剩下艾玛·伍兹这个身份，就连写着爸爸妈妈的那部分拼图翻开来也尽是空白，甚至不用担心新拼凑的部分合不合适，不用害怕明天睁眼爸爸妈妈会不会消失……可是，即便是这样一无所知的我依旧很想你，妈妈。\n我不能描摹你的容貌，无法记录过往点滴，只有身体在一遍遍低语：给妈妈写信吧，像过去某段时间的每个夜晚一样，去相信夜风会将文字带回星星。\n偶尔也会奇怪，为什么提笔写信的对象不是父亲，爸爸这个词汇似乎更加陌生，但最近，这种情感出现了一些变化。还记得我前段时间与你说的游戏吗？是的，我暂时赢得了上一场游戏，但我却觉得难过。游戏中出现的那个怪人，相比恐惧，他带给我更多的是一种熟悉感以及现在想来依旧无法抹去的悲伤。\n在游戏的最后，我逃离那座被浓雾笼罩的工厂时，我似乎听到背后的怪人艰难地吐出一个陌生的名字，丽莎。\n丽莎，丽莎……不知道为什么，写下这个名字让我双目刺痛。\n也许怪人认识我，但我无法将他放入任何拼图块，甚至我的双手在事后一直对我说，那个怪人手上全是伤，感受不到花瓣的细腻，我的爸爸也是，他的手上全是茧。\n——这明明是边缘完全不契合的两块拼图。\n妈妈，我想你了，我想知道驱使情感涌动的一切过往，我想听听你的声音，想你摸着我的发顶告诉我关于爸爸、关于你、关于我们家。'
        },
        {
          role: '园丁',
          id: 5,
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

