<template>
  <div>
    <h3>梦之女巫</h3>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '梦之女巫',
          type: '传闻',
          text: '她给予信徒永恒的生命，可重获新生前没人知道这赏赐的代价是什么。'
        },
        {
          role: '梦之女巫',
          type: '故事背景',
          text: '据说从地球上出现第一个微生物前，伊德海拉就已经存在了。在这数十亿年间，随着时间流逝，伊德海拉从变化中获得了一种奇特的能力，吞噬周遭的生物以获取他们的特性。因此伊德海拉可分裂出不同的面貌的分身，而每一个分身都共享本体的意识。透过与伊德海拉相融合，信徒会获得永生。她通常将自己的本体隐藏在强力的幻影中，只有受召的信徒才有机会一窥她幻影下的真容。'
        }
      ],
      deductionCN: [
        {
          role: '梦之女巫',
          id: 1,
          title: '幻梦之地',
          content: '最深沉的睡眠中隐藏着不应被开启的禁区。',
          conclusion: '残破的信件1：…我看到了阶梯，一路向下，末端被红色的云雾笼罩。哪里就隐藏着父亲一直寻找的终极秘密…'
        },
        {
          role: '梦之女巫',
          id: 2,
          title: '疯狂',
          content: '就像第一块多米诺骨牌，那个人的出现开启了后面的故事。',
          conclusion: '残破的信件2：亲爱的达伦，昨晚是突破性的一夜！我走下了楼梯，虽然目前还无法进入焰穴，但我一定能找到办法。'
        },
        {
          role: '梦之女巫',
          id: 3,
          title: '家门不幸',
          content: '人们谈论这三个字时，常常忘记其中真正的含义。',
          conclusion: '日记1：我已经厌倦了回复沃尔克那些疯疯癫癫的信。他沉浸在父亲那些奇怪的睡眠研究里。什么时候他才能现实一些？让那些阶梯和洞穴都见鬼去吧！他应该专注于母亲的医药费！'
        },
        {
          role: '梦之女巫',
          id: '4',
          title: '新与旧',
          content: '没有什么是永恒的，尤其是知识。',
          conclusion: '日记2：新来的教授看起来很年轻，脾气不错。但打扫他的实验室绝对不是个好差事。天哪，那些长满鳞片的东西让我起鸡皮疙瘩！另，汤普森教授看起来很不高兴。我相信这与之前的实验室搬迁有关。'
        },
        {
          role: '梦之女巫',
          id: '5',
          title: '蛇患',
          content: '一颗沙子也会硌脚。',
          conclusion: '日记3：沃尔克已经很久没寄信来了，这让我有些不安。今天在家里出现了一条蛇，我用扫把赶走了它。真令人恶心。'
        },
        {
          role: '梦之女巫',
          id: '6',
          title: '蒙昧',
          content: '卢基诺教授相信人类是从猴子变来的，真可笑。',
          conclusion: '日记4：我又看到了那条蛇，它爬上了母亲房间里的窗台。它长出了四只脚！那一定是条被恶魔附身的蛇！'
        },
        {
          role: '梦之女巫',
          id: '7',
          title: '家人',
          content: '论他做了什么，达伦，你需要带他回来。',
          conclusion: '日记5：沃尔克仍然杳无音信，我寄出去的信，就像石头掉进了大海。母亲想要见他最后一面，可他离我们那么远……'
        },
        {
          role: '梦之女巫',
          id: '8',
          title: '收藏',
          content: '珍奇与美丽或昂贵无关，珍奇只是珍奇。',
          conclusion: '告示单：高价征集奇异罕见的有鳞动物，来自杜凯因·汤普森博士。'
        },
        {
          role: '梦之女巫',
          id: '9',
          title: '交易',
          content: '每个人都会付出代价，以不同的方式。',
          conclusion: '日记6：汤普森教授为那条邪恶的蛇而惊叹，我告诉了他一切，包括那只新长出来的脚。他的神情有些奇怪，但还是带走了那条蛇。另，中午睡觉的时候，我做了一个奇怪的梦，关于一段很长、很长的阶梯。'
        }
      ],
      letterCN: [
        {
          role: '梦之女巫',
          id: 1,
          year: '2020',
          title: '湖景村调查报告',
          letter: '尊敬的吉尔曼小姐:\n我们仍然无法与沃尔克取得联系，因此我们派遣了新的调查员——克里斯，由他进入湖景村继续调查。\n以下是克里斯发回的报告原件:\n12月3日，到达湖景村，未见到任何当地居民，在沃尔克寄宿的居民房屋中找到了他的行李和后续调查报告。通知当地警备人员后得知与湖景村相邻的林场在9月26日发生过火灾，湖景村当地居民在扑灭火灾中表现英勇，之后外界再未见到当地居民。\n12月4日，进入林场调查，发现一处疑似举行过祭祀活动的地点，我在篝火内找到了一些巨大的鳞片，很可能这里举行过活牲火祭。同时，林场内的河流存在异常，该区域的植物大量枯萎，污染源不明。\n12月5日，前往湖岸进行调查，尝试向湖中投入生肉与牲畜，未发现沃尔克报告中提到的巨大阴影。\n12月6日，前往沃尔克报告中提及的山洞，未见异常，只是一个荒废的矿洞。\n鉴于湖景村已没有任何居民活动，克里斯认为湖景村不再具有调查价值。\n\n祝安\n您忠诚的\n亚瑟·罗素'
        },
        {
          role: '梦之女巫',
          id: 2,
          year: '2021',
          title: '一页散发出潮湿恶臭的纸张',
          letter: '…………的圣徒非常生气，我告诉他，意外常有发生，不过好在并不难处理。\n我打算26号在湖边的林子里等老尤金，他会带来他家那个寄居客，他总是“乐于助人”。\n我们可以赶在圣所打开前，完成净化工作。\n\n……一切都很顺利，如果不是老尤金的老婆！那个该死的疯婆子！总说在火里看到了什么。\n不过，用不着计较太多，可怜的老家伙，总是一惊一乍，连树丛中小畜生发出的“沙沙”声都能吓着她。\n那不过是……\n（后面的字迹逐渐扭曲到无法辨认，纸张周围似乎被什么东西腐蚀了，并不完整）'
        },
        {
          role: '梦之女巫',
          id: 3,
          year: '2022',
          title: '一份缺页的环境调查记录',
          letter: '第一页\n事件发生后, 实验室受命前往湖景村进行环境调查, 初步观测中未发现明显异常。\n更详细报告需对环境样本进行化验后, 才可给出。\n\n第二页\n湖景村水质样本化验报告结论: 该湖区含量远高于同地区其他湖区, 有不明微生物沉积。\n\n第三页\n湖景村土壤样本化验报告结论: 该区域土壤湿度远高于周围区域, 土壤酸碱性异常, 部分土壤样本呈强酸性, 部分有大量不明微生物沉积。微生物类型与水质样本中的沉积微生物一致, 但浓度较低。\n\n第五页\n因调查员离职、调查记录缺失、初始调查环境在暴雨后已遭破坏等诸多原因, 实验室针对湖景村事件的环境调查到此为止。\n由于实验室条件所限, 目前仍无法通过留存样本判断湖景村环境调查中异常现象出现的原因及微生物种类, 故已将留存的土壤样本与水质样本一同呈送皇家学会。后续调查将由皇家学会委派调查员跟进。'
        },
        {
          role: '梦之女巫',
          id: 4,
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '梦之女巫',
          id: 5,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

