<template>
  <div>
    <h3>红蝶</h3>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '红蝶',
          type: '传闻',
          text: '美智子曾是一名出色的舞者，当她穿着红衣翩翩起舞时，看起来就像振动双翼的红色蝴蝶。而现在，没人有勇气直视她的表演。'
        },
        {
          role: '红蝶',
          type: '故事背景',
          text: '人称“红蝶”的艺伎－美智子在宴会上与异国军官迈尔斯相遇并相恋。他们在当地举行婚礼并一同回到迈尔斯的故乡。可这段婚姻遭到迈尔斯父亲的强烈反对，他整日对美智子冷嘲热讽，期望能将她赶出家门。不久，迈尔斯因公外出，美智子则从家中神秘消失，迈尔斯的父亲声称她与佣人私奔，并要求自己的儿子迎娶新的妻子。迈尔斯开始日复一日地出门寻找美智子，但没人知道她去了哪里。'
        }
      ],
      deductionCN: [
        {
          role: '红蝶',
          id: 1,
          title: '故乡',
          content: '这是祖先们漂泊的最后一站，亦是我们漂泊的起点。',
          conclusion: '一篇日记：在进入置屋前，我管它叫永眠镇，夜晚的街道沉眠着，让那些移动的东西特别引人注目。'
        },
        {
          role: '红蝶',
          id: 2,
          title: '置屋',
          content: '吾身似浮萍，何以惧尘风。',
          conclusion: '一张照片：年轻的女孩弹奏着三味线，为花魁伴奏。'
        },
        {
          role: '红蝶',
          id: 3,
          title: '萌芽',
          content: '有一天你会遇见的，那个带来欢笑和泪水的人。',
          conclusion: '一张照片：穿着红色和服的年轻艺伎在宴会上跳舞。一位高鼻深目的年轻人正端着酒杯欣赏舞蹈。'
        },
        {
          role: '红蝶',
          id: '4',
          title: '旦那',
          content: '人道夏虫痴，扑火不惜生。',
          conclusion: '两张船票：看得出有些年头了，但保存得很好。'
        },
        {
          role: '红蝶',
          id: '5',
          title: '情怯',
          content: '这是一个完全不同的国度，女人们会戴着夸张的帽子。',
          conclusion: '扣帽饰针：精美的蝶形帽针，长约6英寸，尖端被打磨得很锋利。'
        },
        {
          role: '红蝶',
          id: '6',
          title: '阴霾',
          content: '他要出门远行，我们留下了一张合影。',
          conclusion: '一张照片：年轻的和服妇人与她的丈夫站在一位面色阴沉的老人身后。照片背面写着“令人不快的女人”。'
        },
        {
          role: '红蝶',
          id: '7',
          title: '寒意',
          content: '人心是无法由他人改变的。',
          conclusion: '一封电报：妻私奔，速回。父。'
        },
        {
          role: '红蝶',
          id: '8',
          title: '爱恋',
          content: '徘徊君枕侧，缠绵意难绝。',
          conclusion: '一张照片：神情憔悴的年轻男人站在街上张贴寻人启事，上面印着一张白净羞怯的面容。'
        },
        {
          role: '红蝶',
          id: '9',
          title: '怨恨',
          content: '慕情不可止，思君添怨叹。',
          conclusion: '一篇日记：他真的，不知道这一切吗？不，那只帽针…他一定知道，他必须知道。'
        },
        {
          role: '红蝶',
          id: '10',
          title: '生成',
          content: '放下谈何容易，驱除了心中的鬼，人也将不复存在。',
          conclusion: '但在消逝之前，我应该身处何处呢？'
        }
      ],
      letterCN: [
        {
          role: '红蝶',
          id: 1,
          year: '2020',
          title: '一封陈旧的信',
          letter: '尊敬的唐纳利先生:\n自那次会面以来，已过去6个月，不知您近况如何?\n我已妥善处置了您的寄存物件，并确保她不会再为人所见。\n只是搬迁花费超出预期，望您可再援助一二，以避免寄存费用不足。\n另，听闻令郎发起了一项令人不安的调查，请尽快回信以避免发生争端。\n\n祝安康\n\n您忠诚的\n尤金·海沃德'
        },
        {
          role: '红蝶',
          id: 2,
          year: '2021',
          title: '一张泛黄的信纸',
          letter: '亲爱的迈尔斯：\n很抱歉，当我找到那个信物的下落时，它已经被人从拍卖行拍走。\n卖家是匿名，拍卖行不愿提供其身份。而外围调查，由于事情已经过去一些日子了，有效信息也并不多，只知道一位身材窈窕，面容姣好的年轻女性，有一些地方口音。\n但就描述而言，这位卖家与美智子大相径庭。\n至于买家，我用了一些手段得到了他的通信方式，但多次试图联系，通信都石沉大海。\n不过请放心，在我完成城中调查后，我将亲自前往他的庄园拜访，希望这位慷慨的绅士可以割爱。\n（那庄园离你新的目的地不远,如果你有意愿，我们或许可以一同前往？）\n衷心的希望，属于你的一切，终能回到你身边。\n\n你忠诚的朋友\n贝坦菲尔'
        },
        {
          role: '红蝶',
          id: 3,
          year: '2022',
          title: '一页日记',
          letter: '昨天晚上，在我即将入睡时，庄园的仆人出现在我客房门口，他们仍然没有贝坦菲尔的消息，按当初我与贝坦菲尔的约定，她理应在三天前就到达这里，这多多少少让我感到有一些意外。\n而更让我意外的是，仆人把那枚帽针交给了我。\n它早已不是我记忆中的样子，宝石剥落殆尽，帽针尾端也被打磨得如利器般尖锐，这让它看起来更像一个工具，而非饰品。\n仆人说庄园主人改变了主意，如果我愿意，天亮后就可以带着这枚帽针离开，我有一夜的时间考虑。\n深夜，我握着这枚帽针陷入沉眠，梦里我又回到了那座夜色昏黄的小镇，但与这些年缠绕我的梦魔不同。今夜的小镇平静而祥和，耳边，美智子最爱的那支和歌，也终于唱到了最后的段落。\n我再次睁眼时，已是清晨，看着手中的帽针，想到那被它带走的一切，我做出了决定。\n早餐时，我告诉仆人，我不会离开，我仍坚持要知道庄园主人曾许诺告知的“故事”的结局，即便条件是参与庄园主人的游戏。'
        },
        {
          role: '红蝶',
          id: 4,
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '红蝶',
          id: 5,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

