<template>
  <div>
    <h5>杰克</h5>
    <el-row :gutter="12">
      <Letter :letter="letterCN" />
      <Deduction :deduction="deductionCN" />
    </el-row>
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      deductionCN: [
        {
          id: '1',
          title: 'Coming Soon',
          content: 'Coming Soon',
          conclusion: 'Coming Soon'
        },
        {
          id: '2',
          title: 'Coming Soon',
          content: 'Coming Soon',
          conclusion: 'Coming Soon'
        },
        {
          id: '3',
          title: 'Coming Soon',
          content: 'Coming Soon',
          conclusion: 'Coming Soon'
        },
        {
          id: '4',
          title: 'Coming Soon',
          content: 'Coming Soon',
          conclusion: 'Coming Soon'
        },
        {
          id: '5',
          title: 'Coming Soon',
          content: 'Coming Soon',
          conclusion: 'Coming Soon'
        },
        {
          id: '6',
          title: 'Coming Soon',
          content: 'Coming Soon',
          conclusion: 'Coming Soon'
        },
        {
          id: '7',
          title: 'Coming Soon',
          content: 'Coming Soon',
          conclusion: 'Coming Soon'
        },
        {
          id: '8',
          title: 'Coming Soon',
          content: 'Coming Soon',
          conclusion: 'Coming Soon'
        },
        {
          id: '9',
          title: 'Coming Soon',
          content: 'Coming Soon',
          conclusion: 'Coming Soon'
        },
        {
          id: '10',
          title: 'Coming Soon',
          content: 'Coming Soon',
          conclusion: 'Coming Soon'
        }
      ],
      letterCN: [
        {
          id: 'I',
          year: '2020',
          title: '给德罗斯的回信',
          letter: '德罗斯:\n我尊敬的朋友，非常感谢你能喜欢那幅画，但很遗憾，我目前的身体状况已经不再适合长途旅行，无法回应你的盛情邀约。\n为表歉意，我将派我的学生前往，他是一位很有才华的年轻人，此次也会带上他的创作，想必你们会有许多“美学观点”的探讨。\n不过目前他仍有一些私人事务需要处理，预计于三个月后启程。\n\n祝一切顺利\n你的朋友\n詹姆斯'
        },
        {
          id: 'II',
          year: '2021',
          title: '4-3 “杰克”的记录',
          letter: '记录对象：“杰克”\n自称为一名艺术学生，于晚上19点抵达庄园。\n第一次见面地点为主宅大门，当时门外阴雨，他是肩部沾有雨水，裤脚与鞋子却十分干净，不像是经过长途跋涉赶来的人。\n第二次见面地点为主宅西侧起居室，当时所有人按照安排，都在那里休息。\n本记录的记录时间为第二次见面后。\n问：第一次见面时“杰克”是否有异常行为？\n答：有，当时先前到达的人上前与他寒暄，他并未及时回应，而是背过身子擦拭雨伞，又用手帕擦了擦手。然后才转过身，礼貌中带着生疏回复道：“真是抱歉，这样糟糕的天气，让人难以礼仪周全。”面部表情，无歉意。\n问：这些行为里，是否有让您印象深刻的地方？\n答：有的。\n问：比如？\n答：他擦手时，用手帕重复擦拭着指腹的动作。以及当我说到我的职业是书记官时，他的微笑很“迷人”。\n问：之后你有与他对话过吗？\n答：有的。\n问：关于什么话题？\n答：一幅画。\n问：什么时候？\n答：第二次见面时。\n问：能描述一下当时的情景吗？\n答：他背对着我在起居室里欣赏一幅画作，我靠近时，他忽然说：“真是一副佳作啊，我想，您不会不认同吧。”他并未回头，但从他的语气判断，他很确定来者是我。\n问：为什么？\n答：因为接下来，他说：“就像您的脚步声，也是我欣赏的节奏，嗒，嗒嗒嗒，嘀嗒嘀嗒……”\n问：你似乎对这句话记忆深刻？\n答：是的。\n问：为什么？\n答：因为他说话的语调，让人想起当下伦敦十分流行的那首关于白沙街的小曲。\n问：你当时如何回答他的？\n答：我说：“我对艺术，恐怕没有什么真知灼见。”\n问：然后呢？\n答：然后他说：“无需介怀，艺术本身并不存在对与错，就像这个世界，没有绝对的好与坏。”\n问：这是你想强调的记录么？\n答：不，我想强调的，是他的当时的表情，那种审视的眼神十分熟悉。\n问：再然后呢？\n答：我们一起看了一会画，他似乎想起了什么有趣的事情，忽然笑着说：“不过就我的美学观点而言，画上这群小可爱如果闭上双眼，会更加美丽。”\n问：你认同他的观点么？？\n答：不，我还是更喜欢人们凝视自己镜中倒影的样子。\n\n记录结束\n记录时间：16，六月\n记录人：柯根·尼古拉斯·基奥'
        },
        {
          id: 'III',
          year: '2022',
          title: '“杰克”的一页实验档案',
          letter: '编号：2-0-2\n姓名：“杰克”\n\n【测试标记】\n1、“非正义”\n2、艺术的纯粹\n3、自我审判\n\n【测试倾向】\n不受束缚的天生罪犯？\n\n【测试结果】\n1、整体评价：\n由于本组成员均对犯罪颇有研究，对将四人划分在一组，我保持较高警惕。\n犯罪于2-0-2来说是追寻“艺术”的纯粹。在此过程中，他完全沉浸其中，从未对自身行为进行反思。\n在实验中，与同组其余三人相比， 2-0-2 从未有过一刻在“正义”与“非正义”的之间犹疑。\n\n2、流程说明：\n实验初期，本组成员间形成了明确的阵营划分。然而根本认知的背离，让这种基于过往阶段性经历建立的同盟并不牢固。\n果不其然，一封留在晚餐桌上的罪行书，让同盟迅速瓦解。\n而之于个人，2-0-2未受到任何影响，其余三人则开始重新思考 “正义”的定义。\n这让2-0-2在整场实验中占得先机。\n实验过程中，2-0-2一心追寻成功实施2-0-3所描述的完美犯罪的方式，且犯罪目标自始至终都是2-1-1。\n最终，2-0-2实现目标，并将“正义”的2-0-4推入了信仰崩塌的深渊。\n\n3、分析总结：\n本组实验能够稳步朝着预设结果迈进，究其原因是2-0-2对自我认知的坚定不移。\n作为本组最鲜明的旗帜，在无药物影响下，2-0-2一直保持着绝对的冷静，目标明确且面对任何罪恶都不会经历任何程度的内心忏悔。\n2-0-2对于完美犯罪的追求单纯而极致。在他眼中这是“艺术”的纯粹，与正义与否无关，这一认知使他抛开一切世俗道德等方面的思考，不受约束。\n而利用2-0-4对程序正义的坚守，2-0-2成功逃脱了其余实验对象的制裁，且没有受到精神层面审判，成为了2-1-1口中的“正义的漏洞”。\n2-0-2的存在使得2-0-4抛弃了对“看得见的正义”的维护，试图对2-0-2行使酌情权，最终迷失自我。\n2-0-2在本组起到的作用，为之后的实验分组，提供了一种新的思路。在研究某一类人群时，除了使用竞逐的方式放大药效外，还可以在选择实验对象时扩大差异。\n特别是当那些立场看似相近的实验对象，随着实验进行，意识到彼此目标达成手段、甚至目标本身存在分歧时，抉择的多元性足以确保无论出现何种意外，最终都能带来的有价值的测试结果。'
        },
        {
          id: 'IV',
          year: '2023',
          title: 'Coming Soon',
          letter: 'Coming Soon'
        },
        {
          id: 'V',
          year: '2024',
          title: 'Coming Soon',
          letter: 'Coming Soon'
        }
      ]
    }
  }
}
</script>

<style>
.demo-table-expand {
    font-size: 0;
}

.demo-table-expand .el-form-item {
    margin-right: 0;
    margin-bottom: 0;
    width: 100%;
    white-space: pre-wrap;
}
</style>
