<template>
  <div>
    <h5>黄衣之主</h5>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '黄衣之主',
          type: '传闻',
          text: '当太阳沉向湖间，黑色的星星升起，栖身于褴褛黄衣的使者将从湖底苏醒，他是无以名状者，追逐求知欲过盛的灵魂。'
        },
        {
          role: '黄衣之主',
          type: '故事背景',
          text: '曾有一位穿着黄袍看不清面孔的使者出现，预言某个王朝即将到来的巨大灾难，人们称他为黄衣之主，不可名状者。他是灾难和苦痛的化身，但那些好奇心旺盛的人总是试图寻找他的踪迹，期望借此寻求世界真实面貌的启示。'
        }
      ],
      deductionCN: [
        {
          role: '黄衣之主',
          id: 1,
          title: '水神',
          content: '是谁，跨过了愿望的底线？',
          conclusion: '一张传教宣传单：开渔时向湖中许愿，然后播撒下足够祭品，若祭品被卷入湖底深处，便证明神接纳了渔民的供奉，来年水神将庇佑你得偿所愿。'
        },
        {
          role: '黄衣之主',
          id: 2,
          title: '我们信仰的',
          content: '无人可阻挡，虔诚的信仰。',
          conclusion: '一份广告：湖景村风景优美，民风淳朴，适合疗养度假，若是有孩子的家庭前往，还可获得价格优惠。'
        },
        {
          role: '黄衣之主',
          id: 3,
          title: '一个预言',
          content: '回应祈愿而来的，会是什么？',
          conclusion: '一个漂流瓶：封闭内湖中出现的漂流瓶，里面的纸条上写着“疯狂将摧毁最后的王权，来自旧日的主宰，将支配世界”。'
        },
        {
          role: '黄衣之主',
          id: '4',
          title: '深渊更深处',
          content: '他的凝视落在了谁的肩头？',
          conclusion: '七份寻人启事：发布于不同时期，但内容大致相同，前往湖景村度假的家庭有幼童神秘失踪，警方前往湖景村展开调查。但村民都表示不知情。'
        },
        {
          role: '黄衣之主',
          id: '5',
          title: '使徒',
          content: '危险也许在远方。',
          conclusion: '一张剪报：一位匿名小说家推出了一本讲述水神的恐怖小说《湖景之径》，他号称小说的创作灵感来自于前往湖景村度假时被邀请参加了湖中神灵的飨宴。'
        },
        {
          role: '黄衣之主',
          id: '6',
          title: '遗忘的仁慈',
          content: '一时的好运，又能拯救谁呢？',
          conclusion: '一份结案报告：看起来有些年头了，内容是说之前七个失踪的幼童，有一人在村外被路过的旅客找到，被发现时，幼童浑身湿透，精神恍惚，胡言乱语，需要心理医生介入治疗。'
        },
        {
          role: '黄衣之主',
          id: '7',
          title: '化身',
          content: '厄运也许在身旁。',
          conclusion: '一份广告：湖景村度假，《湖景之径》诞生地，你们听到了么？湖中神明的召唤。'
        },
        {
          role: '黄衣之主',
          id: '8',
          title: '印记',
          content: '反抗不过是无望的挣扎。',
          conclusion: '一张警务通报：湖景村大规模人口失踪事件，一夜之间全村不知所踪。警方没有在现场发现村民搬迁的迹象，但是在村落边的湖心，发现了许多空的船只。对此，警方将进一步调查。'
        },
        {
          role: '黄衣之主',
          id: '9',
          title: '我们畏惧的',
          content: '他来了。',
          conclusion: '一份警务通报：因楼下邻居举报楼上渗下血水，警方破门闯入一套间，发现大量血迹，房间有大面积被浸泡过的痕迹，房间的墙上发现了用鲜血绘制的巨大的蕨型花纹，目前尚不知晓是否有受害者，从现场遗留物品判断，该套间属于《湖景之径》的作者。'
        },
        {
          role: '黄衣之主',
          id: '10',
          title: '降临',
          content: '无人幸免，无处可逃。',
          conclusion: '一篇时尚风向：因为恐怖小说《湖景之径》的盛行，淑女和绅士们开始佩戴小说中描述的神秘花纹的饰品。'
        }
      ],
      letterCN: [
        {
          role: '黄衣之主',
          id: 1,
          year: '2020',
          title: '一封未寄出的家书',
          letter: '亲爱的达伦:\n我带着父亲的遗物来到了一个叫做湖景的村庄。\n除了我借宿的那户人家之外，这里没有其他外来户。\n据尤金和玛乔丽所说，十五年前他们带着侄女逃难到这个小村里，为了留下来做过许多努力。毕竟，如前文所说，这是个极端封闭的村庄。在侄女出嫁后，他们空出了一间卧室，所以我才能顺利借住于此。\n毕竟，也没有别的人家愿意接纳我了。\n在我去湖边散步时，常有些古板的村民会警惕地盯着我。但值得庆幸的是，所有村民都十分乐意介绍水神的传说。\n可在详细询问了水神的圣迹后，我发现了一些奇怪的地方。\n按照传统，为了使水神显灵，需要由穿着黄色长袍的圣徒们将一些动物血肉投入湖中。在巨大的阴影浮上来之后，祈愿者们依次大声地在岸边念出自己的愿望。如果水神接受了祈愿，会再度沉入湖底，而祈愿者们很快就能心想事成。\n听起来的确很神奇，可在我看来这很可能又是一些打着宗教名义实行的骗局。湖底很可能生活着大量肉食性的鱼类，而那个巨大阴影则来自于被血肉吸引的鱼群。同时，由于祭祀用品由穿着黄色长袍的圣徒们准备，每年村民都会向圣徒进贡。这种利益倾向也使“圣徒”们的行为变得可疑。\n至于愿望成真，我更倾向于人为与巧合。毕竟屋顶漏雨这种小事，那些“圣徒”显然可以轻易解决。\n尽管这里的“水神”可能并不存在，我仍会留下来观看三天后的祭祀活动。那时答案自然会浮出水面，我是说，字面意义上的浮出水面。\n另外，正如前几封信中提到的，我已经逐渐接近焰穴，每过一晚，都距离真相更近一步。\n也许最终，我能得到父亲追求的那个答案。\n替我向母亲问候，我很快就会回家\n\n爱你的\n沃尔克·贝尔格伦德'
        },
        {
          role: '黄衣之主',
          id: 2,
          year: '2021',
          title: '一本厚重的愿望记录册',
          letter: '扉页——\n(这本书似乎经过反复传阅.里面的书页都磨损染污严重,但唯独扉页纤尘不染、完好如初。扉页上无名无姓,只有几行用暗红色“浓料”书写的文字和正中央散发着腥味的蕨型花纹。)\n\n群星尚未归巢,深水之下,至高无上的神明在此沉眠。在吾神彻底苏醒之前,吾等神仆,需传达信仰,代行神嘱!\n\n随意翻开的一页——\n(记满了人为整理收录的愿望,每条之后还写有批注留言。从笔迹上可以看出,记录愿望的和批注留言的是两个人。)\n\n1月14日湖景村祈愿记录\n……\n村民11：住破船上的瘸腿老瞎子\n祈愿:至高无上的湖中之神啊，请您聆听我的祈祷，那个源自矿窟的噩梦、那场让我失去腿脚和眼睛的爆炸，日日夜夜折磨着我的精神,让我痛不欲生!您虔诚的仆从,在此祈愿您降下神迹、用深渊之触绞碎那个可憎的梦境!用黑色汪洋吞灭那场雷霆烈火!你的仆人霍普斯，永远恭候您。\n[批注:对于虔诚的信徒，真神会让他得偿所愿。而吾等代行神旨的方式,自然是助他于深水之下长眠。虽然他作为祭品的价值，比不上纯洁的处女和儿童,所以深渊尽头的圣所会永远为他关闭,但相信，在水下，被真神精神力量所包围的他，会得到一个新的梦境,再无苦痛。]\n\n村民12：尤金、玛丽乔夫妇\n祈愿:全知全能的神明,请原谅我无知的发问——每次开渔前,我们夫妇二人都会往湖中撒下足够多的祭品,同样每次都会向您祈祷，可是，却没有一次得到理想中的收获。深居于水下的神，您是否当真听到了我们的声音？恳求您回应我们的祈祷！恳求您降临于我们村庄！\n\n村民13：沃尔克(被尤金夫妇收留的外乡人)\n祈愿:未祈愿。\n\n[村民12和村民13的记录被人用醒目的红笔圈在一起。批注：\n痴愚而意志不坚的信徒、无礼而心怀不轨的渎神者,都没有资格窥见吾神尊容!湖下的真理亦禁止凡愚窥量!\n无法猜度的神迹早已笼罩四方,但好奇心只会引导他们步入死亡……\n至于吾等神仆，应在祭祀仪式上对这三人进行洗礼,然而水祭不洁之人为辱神之举，吾等应当在湖畔、在水下真神的见证下,用烈火拔除他们的污秽!]'
        },
        {
          role: '黄衣之主',
          id: 3,
          year: '2022',
          title: '半页访问记录',
          letter: '预备实验组谈话记录文档 -L-149\n访问者：（此栏并未填写）\n受访者：实验备选者05-L-01-000\n前言：\n在整理05-L-01-014、05-L-01-017的访问记录时，我发现他们多次提及数年前在湖景村一英里外找到的那个被报告失踪的幼童以及沿路留下的诡异涂鸦。05-L-01-014称，当年那名唯一幸存的幼童（即05-L-01-000号）被找到时浑身湿透，精神状态紊乱，无法描述自己失踪时发生的事，对“回忆”这件事本身极其抗拒，并伴随有渴求湿润环境、下意识用动物血浸泡石头、梦中会像软体动物一样蠕动身躯等诡异行为。在后续治疗中，05-L-01-000的精神状态渐趋稳定，意识恍惚的症状也只是偶尔发作，但他本人还是想不起在湖景村发生的事，或者说其身体本能地对此事避之不及。\n但据05-L-01-072的说法，在《湖景之径》合作出版之前，他曾多次拜访05-L-01-000确认相关事宜，并与之深入交流有关湖景村神灵祭祀之事。在这一过程中，05-L-01-000侃侃而谈，一再声明书中内容是据本人真实经历改编。\n旁观者眼中彼此矛盾的事实，05-L-01-000幼年与如今截然不同的状态，真相究竟如何，有待探究。也许我应该将类似的备选者都邀请到一起，重现他们潜意识中回避的真相。这大概率会成为目前为止最有趣的一组实验，而05-L-01-000.会成为这一组的首位备选者， 这点毋庸置疑。\n不过在此之前，我需要更多05-L-01-000本人的信息，并确定他对湖景村事件及所谓水神到底了解多少。\n<记录开始>\n……'
        },
        {
          role: '黄衣之主',
          id: 4,
          year: '2023',
          title: '《湖景之径》扉页上沾满黏液的记录',
          letter: '因好奇而生的求知动力成就创作者，因求知而生的勇气造就引领者，但不知深浅地将无知当无畏去窥伺常人不可理解的领域，那死亡也许是此举所需付出的最低代价。\n不过，当我意识到这一点时已经太晚。\n我不该回到湖景村，在大选前夕接受这个游戏邀约的决定过于草率、过于愚蠢。我不该被空缺的儿时记忆所引诱，更不该去挖掘那四个“怪物”背后的祂们！\n那四个家伙甚至不能称之为“怪物”，他们只是怪物的躯壳。我理当知晓那种感觉，那是来自被封锁的儿时记忆发出的警告——外界的真实一日无法传达到躯壳内，进入生者未知之恐惧之地的灵魂就一日不得解脱。我也理应知晓该如何破除困境，毕竟我已完全摸清了他们四人的信仰，是的，只要用惯用的手法，费些表演和口舌，你就能发现人类是多么容易被操控，信仰愈坚定者愈是如此。只是愚弄那几位的代价可能远超儿时的死里逃生……\n无论如何，未来不管是谁捡到了这本书，请求你务必将他带出去，书中的每一页批注和涂改是我对过去无知自我的否定，更是我赌上未来、赌上生命、赌上为人的尊严换回的真相。\n\n亚瑟·比尔斯'
        },
        {
          role: '黄衣之主',
          id: 5,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

