<template>
  <div>
    <h3>玩具商</h3>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '玩具商',
          type: '传闻',
          text: '从羞辱和欺骗中逃脱后，安妮终于发觉了自己的力量，也从小小的玩具商铺里获得了真正的安全感。这一次，她誓要讨回那些她应得的东西。'
        },
        {
          role: '玩具商',
          type: '故事背景',
          text: '安妮出生在一个富商家庭。安妮的母亲在生她的时候难产去世了。父亲希望将她打造成母亲的替身，责备她没有名媛淑女的模样，丝毫没有母亲和自己那样的才华和美貌。她唯一的快乐时光，是妈妈给她留下的一间小小的婴儿房，每天仅有的1小时休息时光，里面堆满了各式各样的木制玩具，做成了一个像童话般的世界，在这个地方，就是做自己也无人打扰，甚至还有一架粗糙的木制飞行器，似乎可以带她去往居室外的世界。\n等她快成年的时候，她的财富成了猎艳者觊觎的对象，追求者们都希望依附她过上无忧的生活。她也和其中一个男子谈起了看似完美的恋爱。在她成年的时候，她的父亲和未婚夫谋划了一场骗局一丝不剩的跑路了。\n安妮对她所信赖的人是最善良的‚会相信他们的一切。她曾经是这么认为的。\n不久后，母亲的私人律师找上安妮，将最后的30%遗产交付给她，安妮创立了玩具商铺，这些玩具对于安妮来说象征着舒适、家庭生活与稳定，只有在这些东西身边她才会感到安全，她看到玩具就想要收集，或许，这些玩具也可以带给其他的小孩子一些安慰。玩具产业在她的经手上慢慢起步了，她发觉自己并不是他们口中那个一无是处的女孩，她也发誓一定要讨回自己应有的东西和尊严。\n直到，邮箱收到一份匿名的邀请函，里面说知道那两个骗子的消息，她决定去一看究竟。'
        }
      ],
      deductionCN: [
        {
          role: '玩具商',
          id: 1,
          title: '温室',
          content: '被精心呵护的花朵,才有孕育香气的机会。',
          conclusion: '一副泛黄的画作:—个富有才情气质的女人坐在钢琴前．瞳孔中满是天真神色。'
        },
        {
          role: '玩具商',
          id: 2,
          title: '穹顶',
          content: '温室穹顶之下，却渴望炙热的天空。',
          conclusion: '一篇报道：英国大亨家名媛Wendy大婚，其丈夫为一捷克无名画家。'
        },
        {
          role: '玩具商',
          id: 3,
          title: '枯萎',
          content: '枯萎的花朵遗留的阴影,盖过了新生的嫩枝。',
          conclusion: '一张法院传票：11月29日，Anne诞生，Wendy因出血过多去世。其遗产中50%归属权包括房产相关交与成年后的Anne。'
        },
        {
          role: '玩具商',
          id: '4',
          title: '噩梦',
          content: '只浇灌一种养分的树苗，内核极度濒临死亡。',
          conclusion: '一段记录：“一无是处的废物，把我的缪斯还回来！”“怎么一点都不像她。”“淑女气质被你丢到哪里去了？'
        },
        {
          role: '玩具商',
          id: '5',
          title: '乌托邦',
          content: '濒死前，树根会拼命寻找可以生存的沃土。',
          conclusion: '一张时间表：夫人生前为小姐准备的玩具屋，开启时间早上7-10点，下午5-10点，8-9点。'
        },
        {
          role: '玩具商',
          id: '6',
          title: '犹豫',
          content: '在逃离之前，每个人都以为自己还有希望。',
          conclusion: '一个疑似滑翔翼的玩具：有很多组装的痕迹，看上去它的主人正在利用手边不多的材料计划逃离。'
        },
        {
          role: '玩具商',
          id: '7',
          title: '命定',
          content: '完美的情人，是缘分还是预谋的巧合？',
          conclusion: '一张照片背后的字：“他好像很了解我，最重要的是，他接受如此不堪的我。”'
        },
        {
          role: '玩具商',
          id: '8',
          title: '骗局',
          content: '没有被发现之前，骗局都是梦幻的际遇。',
          conclusion: '一封匿名信：“她答应我的求婚了，计划顺利进行，我们这段时间最好少联系。”'
        },
        {
          role: '玩具商',
          id: '9',
          title: '绝境',
          content: '任何有良知的人都不会为了享乐夺走他人的希望。',
          conclusion: '一封律师函：Wendy女士遗产继承中的50%由Anne女士转让其父亲。由于Anne女士现阶段财产低于英国贫穷水平，将Wendy女士遗嘱隐藏的30%给到指定继承人Anne女士。'
        },
        {
          role: '玩具商',
          id: '10',
          title: '商铺',
          content: '生活的希望总是由希望本身诞生。',
          conclusion: '一份账目表：看上去有很多收入，是一家生意很好的玩具商铺。背面写着：第一次有勇气的离开，或许是新的开始。'
        }
      ],
      letterCN: [
        {
          role: '玩具商',
          id: 1,
          year: '2022',
          title: 'NO.……(律师函信件号，由于反复折叠而产生深深的叠痕，数字已模糊不清)',
          letter: '致：安妮·莱斯特，霍洛威疗养院临时病房\n本人尼古拉斯·奥兹为温蒂·莱斯特代理律师，受温蒂·莱斯特女士委托，指派本人就温蒂·莱斯特女士遗产继承一事致函阁下。我很荣幸再一次为阁下服务。\n自上一次为您转让温蒂·莱斯特女士生前记录在案的50%遗产之后，我便失去了与阁下的联系。曾经的地址已查无此人，而这一地址也是通过阁下过去的一名男性友人找到的，他在一年前曾到访我的律所咨询过遗产继承的相关问题。我很抱歉得知阁下最近的遭遇，望阁下能在霍洛威疗养院的病榻中尽快痊愈，接下来，希望我带来的消息能振奋人心。\n根据遗产继承法，以及温蒂·莱斯特女士的生前遗嘱，我将正式通知阁下，除了温蒂·莱斯特女士生前记录在案的财产之外，尚有30%的隐藏遗产未被记录，包括温蒂·莱斯特女士于海外悉心保管的财物、委托其亲友寄存之贵重物品，这些将全部归阁下所有。关于它们的具体信息我将于信件末尾附上清单，请阁下查阅。很抱歉阁下目前的财产状况临界于我国最低贫困标准，希望它们能帮助阁下度过眼下艰难时期。\n另外，清单中有一架崭新的儿童木制飞机，我反复确认发现并没有出错，它的确属于温蒂·莱斯特女士留给阁下的遗产一部分，望阁下在查阅过程中不要感到意外。\n最后，望阁下痊愈后，欢迎来到本律师事务所，我将协同阁下办理遗产继承相关手续。\n\n阁下可信赖的律师，\n尼古拉斯·奥兹\n\n附件清单：\n古斯塔夫·鲍格朗装饰珠宝，一件\n无标黑玛瑙贝壳雕塑饰品，一套\n……\n……\n……\n12956英镑\n全新儿童木制飞行器，一件'
        },
        {
          role: '玩具商',
          id: 2,
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '玩具商',
          id: 3,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '玩具商',
          id: 4,
          year: '2025',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '玩具商',
          id: 5,
          year: '2026',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

