<template>
  <div>
    <h3>小提琴家</h3>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '小提琴家',
          type: '传闻',
          text: '只要能拨动整个世界的旋律，安东尼奥不在乎是谁在操控自己的身体。'
        },
        {
          role: '小提琴家',
          type: '故事背景',
          text: '“他能看见整个世界的律动，也被无处不在的琴弦所控制和束缚。”即便在酒色和名望之中沉沦，小提琴家安东尼奥也从未放弃对音乐的极致追求。他的琴技走向巅峰，但他才华却也步入了末路——直到只用一条G弦掌控的独奏横空出世，震撼全场！除了前所未闻的旋律，那场演出中近乎非人的身姿更成就了匪夷所思的传说：有观众扬言当场目睹魔鬼现身，在安东尼奥肩后操控他的双手演绎惊人技法。更有人在恍惚中看到小提琴家的全身都成了琴弓和琴弦，甚至连头发都能在律动中奏响音符。真相如何，谁又在乎呢？只要能拨动整个世界的旋律，安东尼奥不在意是谁操控自己的身体——他就是音乐的提线木偶。'
        }
      ],
      deductionCN: [
        {
          role: '小提琴家',
          id: 1,
          title: '天才',
          content: '音乐的天赋伴我成长，却从未带给我快乐。',
          conclusion: '少年病例报告：营养不良，强直性昏厥…压力过度…神经衰弱……猩红热……肺炎……肌肉痉挛……'
        },
        {
          role: '小提琴家',
          id: 2,
          title: '艳曲',
          content: '这份天赋，能换取多少曾缺失的欢愉？',
          conclusion: '一份压在窗台下的乐谱：“这是过夜的费用。风流事就应该离铜臭远一点。”'
        },
        {
          role: '小提琴家',
          id: 3,
          title: '赌债',
          content: '音乐家的尊严又能多值几个钱？',
          conclusion: '一份赌场的抵押单：小提琴家安东尼奥的乐器在此抵押，另还余欠款……'
        },
        {
          role: '小提琴家',
          id: '4',
          title: '邀约',
          content: '三年自由，换一身无债无愁。',
          conclusion: '一份劝诫书：……兹以为，安东尼奥大师深陷销金窟，在公主将其纳入宫廷乐队前，请务必慎重考虑对皇家声誉的影响。'
        },
        {
          role: '小提琴家',
          id: '5',
          title: '名望',
          content: '他们礼遇我，他们尊敬我，他们在仰望着我的琴和我的曲',
          conclusion: '一封密信：安东尼奥的曲子必须特供皇室，平民商贾都不配享此妙音。无论如何都必须将他留下，作为皇家水平远超世俗的象征。'
        },
        {
          role: '小提琴家',
          id: '6',
          title: '玩物',
          content: '他们将我束之高阁，他们将我囚于鸟笼，他们骗走了我的小提琴',
          conclusion: '一封被划烂的信：……若您执意离开，请用单条琴弦独奏一曲，只有这种神技，才足以证明您的天赋留在这个宫廷是“虚度年华，大材小用”……'
        },
        {
          role: '小提琴家',
          id: '7',
          title: '惧意',
          content: '原来这份才能，才是我的囚笼。但囚笼之外，放弃物欲放弃名望…迷失自我…',
          conclusion: '一章被揉乱的独弦曲谱，上有留言：“不要演奏它。”'
        },
        {
          role: '小提琴家',
          id: '8',
          title: '重返',
          content: '高高在上的耳朵，听不到真正应该敬畏的音符。',
          conclusion: '一张国家剧院的小提琴专场海报，上面被红字涂鸦：在巅峰被宫廷驱逐的失败者。'
        },
        {
          role: '小提琴家',
          id: '9',
          title: '陷阱',
          content: '……只要我不去触碰，就不会有回音',
          conclusion: '一份密信：他和之前一样高傲，依旧不愿在舞台上演奏那份乐谱。不过我有个办法，只要把他的琴弦……'
        },
        {
          role: '小提琴家',
          id: '10',
          title: '终曲',
          content: '如果巅峰已是陌路，那下落之后，是谁在继续拨动世界的旋律？',
          conclusion: '一张简报：小提琴家安东尼奥重登殿堂！G弦神技演奏如恶魔降世般席卷全场，令所有人深陷诡谲莫测的琴音之中无法自拔。'
        }
      ],
      letterCN: [
        {
          role: '小提琴家',
          id: 1,
          year: '2021',
          title: '一篇宫廷乐师的手记',
          letter: '已经入夜了，直到三天约定到期前的最后几个小时，房间里才终于传出了的琴音。\n那不是连续的篇章，每演奏几秒或十几秒，跃动的音符就被突然掐断。在窒息的安静中，我的灵魂被攥住悬在半空，直到音符又突兀地续上来。\n即便一直断断续续，这也是我这辈子听过最勾人心弦的曲子了：它让我徜徉在一个难以言喻的世界……抛下世俗的束缚和规矩，只剩自由，为所欲为……\n（笔记逐渐模糊）\n……\n就在刚才，送食物的佣人惊恐地从房间里逃了出来，嚷着看到的异象：一张宫廷戏剧的魔鬼面具掉在地上张牙舞爪……安东尼奥大师像被牵线一般扯在墙上吊起了手脚……琴弦和琴弓自己在他身前演奏……\n上帝为证！我绝不相信他的胡言乱语，更不会去一探究竟。我怎么能因一时好奇打断大师的创作？\n等等、等等！琴音，琴音完全停止了——这令人匪夷所思的杰作终于完成了？\n我再不奢望自己能达到那位大师一样“为才华所累”的境界，只是卑微地企盼着能有幸欣赏这支作品的完整演出……'
        },
        {
          role: '小提琴家',
          id: 2,
          year: '2022',
          title: '杂乱乐谱背面的留言',
          letter: '亲爱的安德莉亚：\n\n数月未见，最近还好吗？\n曾经，我们无数次庆幸那首咏叹调能拨开你耳中的迷障。比起那些听力健全、自诩高雅之人，你更能与我共鸣琴弓下书写的文字，琴弦中讲述的语言，乐谱上镌刻的回忆。\n“我想你，亲爱的。\n当阳光在海面跳跃时，\n当月光照耀在清泉时，\n当星光点缀在银河时……”\n琴弦跳动，你的声声唱词敲开了我的心门，填满了所有空间。\n而如今，这扇门再一次关闭，我成为了那个失聪者，闭耳塞听。\n\n你知道，我拥抱欢愉，避畏苦难。\n你也知道，我向来忌惮那首曲子，拼尽所有意志抵御着它的魅惑；\n即便你百般恳求，甚至以分手相胁，我也绝不会……也绝不该……\n……我！我还是妥协了。\n当再次演奏那首独弦曲，身体的每个骨骼，都不再属于自己了。沉浸在魔鬼之音的海洋中，苦涩腥咸的旋律刺痛着五官，模糊了所有感官的边界——\n为琴弦所俘获的傀儡，再度沉浸于销金窟的欢愉和久违的快感中。\n直到远处的哭喊穿透了一切——眼看着挥砍的琴弓随着惯性渐渐摆落，我心中恐惧和后悔才阵阵袭来。\n瑟缩在一片狼藉中的你哭泣着逃出了房间。\n阳光、月光、星光……在那一刻，所有音符都暗淡无光。\n…………\n我为你受到的伤害感到抱歉。\n我为发生的一切感到抱歉。\n我为我所做的和没有做的感到抱歉。\n\n那天之后，我四处奔波演奏，在人海中寻觅那双温润的目光，那声心中共鸣的天籁。\n……但你没有出现。\n直到一位自称剧院老板的人将我指向欧利蒂丝庄园：\n“在这里，你不仅可以见到她，还可以永远摆脱‘他’。”\n这是一场没有退路的赌局，但这次也绝不会血本无归。\n我深信你也在期待这段故事的续写，抑或是，一段与前奏相匹配的尾奏——\n这首曲子就名为《安德莉亚》。\n\n爱你的，\n安东尼奥'
        },
        {
          role: '小提琴家',
          id: 3,
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '小提琴家',
          id: 4,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '小提琴家',
          id: 5,
          year: '2025',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

