<template>
  <div>
    <h5>医生</h5>
    <el-row :gutter="12">
      <Letter :letter="letterCN" />
    </el-row>
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      letterCN: [
        {
          id: 'I',
          year: '2020',
          title: '给洛琳修女的信',
          letter: '尊敬的洛琳修女：\n我犯下了非常严重的错误。\n这导致在未来很长一段时间内，我将无法回到白沙街疯人院继续之前的志愿者工作。\n写信给您并不是想要为我糟糕的行为辩解，只是在离开前，我认为有必要向您报告我在工作中发现的一些事实。\n白沙街疯人院的病历记录存在着一些可怕的谬误。\n经过对病患丽莎·贝克的治疗与评估，我意识到那些孩子们——来自孤儿院的孩子们，他们也许在性情上不那么温顺，我的意思是，他们的确不那么容易感到快乐，并表现出多疑或偏执，但基于我的认识，这些孩子们，从心智和行为逻辑上，与“正常”的孩子并没有什么区别。这些孤儿们也许遭遇了一些恐怖的事情，也许他们的行为存在偏差，但我相信他们仍然值得第二次机会。\n因此，恳请您发起对院内病患的重新评估。\n 为了您自身的安全与一些必要的隐私顾虑，我强烈建议您向第三方的专业人士寻求协助。\n我知道自己的建议听起来有些荒谬，也许在不久之后您会听到一些关于我的“传闻”，但在那些孩子的治疗过程中，我遵守了自己的誓言并将为之战斗至最后一刻。\n为了病人的福祉，为了那些可怜的孩子，请您尽快发起评估。\n\n您忠诚的莉迪娅·琼斯'
        },
        {
          id: 'II',
          year: '2021',
          title: '一封邀请函',
          letter: '尊敬的黛儿女士:\n或许，您更希望我称呼您为琼斯医生?\n请原谅我的贸然叨扰。\n对于您目前的处境，我深感惋惜。\n对于那个意外，我的一位朋友，觉得他多少也有些责任。我受他所托，希望能做些什么，对如今的局面有所挽回。\n比如一笔可观的资金援助?\n或许，我们可以给彼此一个与过去和解的机会?诚邀您来我的庄园一叙，地址与旅行费用随信奉上。\n\n德罗斯\n敬上'
        },
        {
          id: 'III',
          year: '2022',
          title: '艾米丽·黛儿一页实验档案',
          letter: '编号：4-0-4\n姓名：艾米丽·黛儿\n\n【测试标记】\n1、被需要\n2、同情心\n3、救赎\n\n【测试倾向】\n\n寻求自我救赎的“罪人”\n\n【测试结果】\n1、整体评价: \n由于4- 0 - 4的职业背景和际遇, 对于她的到来，我本存在较高的警惕，但多年的逃亡生涯和内心煎熬已然使她曾经敏锐的观察力和基于职业追求带来的判断力在大多数时候都失去了效力，让她成为了一个足够安全的实验对象。\n2、流程说明：\n如实验计划所设计的，4 - 0 - 4对4 - 1 - 1表现出了超乎寻常的关注和保护欲，这种倾向随着实验的进行愈发高涨，直至逐渐变质。\n实验初期，4 - 0 - 4的这种倾向仅停留在对4 - 1 - 1释出友善信号，并提供力所能及的保护。\n到中期，4 - 0 - 4意识到了4 - 1 - 1本身的危险性，她非但没有远离，反而将最初的保护措施升级为阻断威胁。\n在此期间，因为针对4 - 0 - 3关键信息的投放，4 - 0 - 4本身也直接暴露在了危险之中，事实上，4 - 0 - 4察觉到了这一点，却表现得近乎置若罔闻。\n这种反常，在实验末期，她对是抹除威胁到4 - 1 - 1的安全隐患还是利用这个安全隐患转嫁自身生存威胁进行抉择时，得到了验证, 4 - 0 - 4最终选择了前者。\n\n3.实验总结：\n4 - 0 - 4作为这组实验中联系实验对象的重要纽带，实际起到的作用超出预期。\n在最初实验目的的设计上，她本应只作为一个催化4 - 1 - 1和4 - 0 - 3实验效果的参与者存在。但她与4 - 1 - 1复杂的过去，以及危桥效应影响下产生的情感链接，让实验主体4 - 1 - 1的实验结果产生了另一种可能性，虽然这种可能性最终未被实践，但却为之后的实验提供了一种新的设计思路。\n同时对于4 - 0 - 4的观察，让我意识到负罪感能起到的实验效果较难被准确观察与控制。\n在偿还亏欠和自我救赎的优先级判断中，主体意识和客体存在随时都在影响，即便有大量实验对象信息作为数据支撑，仍会伴随较大的随机性，并不太适合应用于此阶段实验。'
        },
        {
          id: 'IV',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

<style>
.demo-table-expand {
    font-size: 0;
}

.demo-table-expand .el-form-item {
    margin-right: 0;
    margin-bottom: 0;
    width: 100%;
    white-space: pre-wrap;
}
</style>
