<template>
  <div>
    <h5>前锋</h5>
    <Character :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      descriptionCN: [
        {
          role: '前锋',
          type: '传闻',
          text: '拉格比足球正吸引着人们的注意力，尽管自诩为这项新兴运动的创始人，威廉·艾利斯却正在被人遗忘。也许欧利蒂丝庄园的主人能为他带来一些帮助？'
        },
        {
          role: '前锋',
          type: '故事背景',
          text: '拉格比足球正吸引着人们的注意力，然而自诩为这项新兴运动的创始人，威廉·艾利斯却正在被人遗忘。他加入了一个小型的橄榄球俱乐部，但他很快发现，事情并不如自己预计的那么顺利。也许欧利蒂丝庄园的主人能为他带来一些帮助？'
        }
      ],
      deductionCN: [
        {
          role: '前锋',
          id: '1',
          title: '际遇',
          content: '命运是机会的影子。',
          conclusion: '一张照片：威廉·艾利斯在拉格比公学足球队内的纪念照。'
        },
        {
          role: '前锋',
          id: '2',
          title: '歪打正着',
          content: '我该摁哪个键？',
          conclusion: '当你不知道它们怎么办时，用力的敲！这些机器迟早会干活的。'
        },
        {
          role: '前锋',
          id: '3',
          title: '达阵',
          content: '我想，得分点应该在门后面？',
          conclusion: '当进攻队员攻入防守方的的分区内用手持球触地，达阵得五分。'
        },
        {
          role: '前锋',
          id: '4',
          title: '橄榄球联合会',
          content: '当运动联盟对球员们强调“业余精神”时，你得考虑实际的生活需要。',
          conclusion: '一张照片：年轻的威廉·艾利斯看着队友远去的背影。'
        },
        {
          role: '前锋',
          id: '5',
          title: '团队合作',
          content: '就像拉格比足球那样，这个游戏也需要配合。',
          conclusion: '呃……也许有时候浓缩才是精华？'
        },
        {
          role: '前锋',
          id: '6',
          title: '技术性犯规',
          content: '你知道我们在球场是什么样子的，对吧？',
          conclusion: '一张照片：持球向前奔跑的威廉·艾利斯，远处裁判正拿起口哨。'
        },
        {
          role: '前锋',
          id: '7',
          title: '前锋的尊严',
          content: '嘿，我想这并不是什么难事？',
          conclusion: '在冲锋进攻时，通常是有体型壮硕的前锋在最前面开路。可前方会站着什么人，不是前锋能决定的事。'
        },
        {
          role: '前锋',
          id: '8',
          title: '盲侧撞击',
          content: '让你的队手再也站不起来！',
          conclusion: '威廉·艾利斯站在抱腿倒地的球员身边。这个初出茅庐的年轻人已经被喝彩声冲昏了头脑。'
        },
        {
          role: '前锋',
          id: '9',
          title: '秘密',
          content: '每个人都有秘密，而了解其他人的秘密，不一定是件好事。',
          conclusion: '如果我没有去看那场魔术表演就好了。那个对锁链动手脚的家伙，他看到我了吗？'
        },
        {
          role: '前锋',
          id: '10',
          title: '退役',
          content: '生活很严酷，有时候你不得不暂时放弃自己最喜欢的东西',
          conclusion: '没人记得我，他们只会说“噢，那个带球跑的小子”。但我威廉·韦伯·埃利斯，才是这项运动的开创者！'
        }
      ],
      letterCN: [
        {
          role: '前锋',
          id: 'I',
          year: '2020',
          title: '威廉·艾利斯的邀请函',
          letter: '尊敬的威廉·艾利斯先生：\n人们常常谈论您在拉格比足球里获得了“不公平的优势”，而我更愿意将其称为“了不起的革新”。您将深沉的思考隐藏在壮硕的体格之下，成功地让所有人都坚信您只是抱着足球瞎跑的莽汉。\n您善于发掘规则的漏洞，而我们即将开始的游戏中正需要您这样的先遣者，以帮助我们进一步完善规则。一个兼具良好体格与缜密思维的人，是欧利蒂丝庄园寻宝游戏中不可或缺的宝贵助力。\n当然，作为回报，我将无条件全力支持您在拉格比足球协会的一切改革。\n\n静候您的光临\n主持人'
        },
        {
          role: '前锋',
          id: 'II',
          year: '2021',
          title: '前锋日记',
          letter: '12月2日\n雪怎么越下越大了!\n今早收到了通知，说是由于天气原因，游戏恐怕要延期开始。这几天我们都得老老实实地待在屋里，随意出门会受到惩罚……见鬼的惩罚！现在不只是宵禁，连白天的户外活动都没了!\n我真不想继续在这房子里闷着！跟那三个人相处时，屋里的气氛比屋外的天气还要槽糕！今早我又在厨房碰见了那个叫穆罗的家伙，他看了我一眼，话都没说就把自己的早餐端回了房间！唉，真不知道他在防备谁，又或者，他只是单纯的不喜欢我？\n我想起来，昨天早上刚到的时候，房子里只有我和穆罗两个人。他似乎对这里熟悉得很，给我指了房间的方向，一句话都不多说就离开了……威廉·艾利斯，得到友善的对待，为什么总是这么难？\n游戏什么时候开始？我想念球场，想念葡萄酒和烤肉排——等拿了奖金回去，我得叫球队里的家伙们办个派对！该死……我明明只是想来拿那笔钱，怎么能在这种无聊的地方浪费时间!'
        },
        {
          role: '前锋',
          id: 'III',
          year: '2022',
          title: '威廉·艾利斯的一页实验档案',
          letter: '编号：9-?-2\n姓名：威廉·艾利斯\n\n【测试标记】\n1、单纯\n2、冲动鲁莽\n3、不设防\n\n【测试倾向】\n深陷算计的愚者\n\n【测试结果】\n1、整体评价\n与同组参与者相比，9-?-2社会阅历较少，成长环境简单，单纯的个性使他难以被卷入矛盾中。但羊入虎口，思维简单的人在竞争中只会成为他人的踏脚石。\n2、流程说明\n实验中，9-?-2对与他无直接矛盾的人并不设防。他既不排斥与9-?-1接触，又对帮助他的9-?-3轻易产生了信任。\n唯一的不同在他对于9-?-4的态度：由于曾经亲眼所见的那场“舞台事故”，9-?-2对9-?-4十分警惕。这也导致他在中毒后第一时间认为是9-?-4所为，在其他人的刻意引导下，鲁莽地将意外解读为刻意伤害，矛头直指9-?-4。尽管9-?-2并不是真正的刽子手，但仍间接造成了冲突爆发。\n3、分析总结\n出身于校园环境的9-?-2性格较单纯，在长时间相处中很容易对他人产生类似伙伴的情感。气氛紧张时。他仍热心邀请9-?-3分食烤猪、共饮佐餐酒。他不擅长人与人之间的算计，轻信自己认为的“好人”。由于想得到队友们的认同，毫无保留地分享情报，迫切希望证明自己。\n9-?-3正是利用了他的特性，名正言顺地把影响他实施计划的人剔除出局。9-?-2是幸运的，在危险性最高的9-?-3眼中并没构成威胁。最终成为了杀人的刀子而不自知。但即使一无所知，违反规则的人仍然会受到惩罚。他的愚钝使他有了幸存的可能，也注定了他的结局。在人性的审判中，愚者的轻率和鲁莽便是他所犯下的罪行······'
        },
        {
          role: '前锋',
          id: 'IV',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '前锋',
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

