<template>
  <div>
    <h3>疯眼</h3>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '疯眼',
          type: '传闻',
          text: '欧利蒂丝庄园是巴尔克的实验场，谁也不知道他在地下藏了多少机关，或者，多少种机关。'
        },
        {
          role: '疯眼',
          type: '故事背景',
          text: '巴尔克·拉帕杜拉是一位建筑工人的长子。从小就在设计图纸和各式各样的机械与工具中玩耍，拥有绝佳天赋的他二十岁时已在当地小有名气。受雇于一对夫妇后，巴尔克来到当时仍然荒凉破败的欧利蒂丝庄园，承担了其中绝大部分的建筑设计工作。应雇主要求，巴尔克在庄园领地内带领工人不断地进行扩建。工作之余，他还加入了自己的小小“爱好”——机关，这座庄园变成了巴尔克的秘密实验场。据说直到那件不幸的事故发生之前，这个疯狂的建筑师还在计划增建新的机关。'
        }
      ],
      deductionCN: [
        {
          role: '疯眼',
          id: 1,
          title: '契约',
          content: '那曾经是一份恰当的工作。',
          conclusion: '破损的合同：有丹尼斯·德罗斯与巴尔克·拉帕杜拉共同签订。'
        },
        {
          role: '疯眼',
          id: 2,
          title: '实验场',
          content: '有人看到了废墟，而我看到了“可能性”。',
          conclusion: '图纸1：附带对称塔楼的建筑设计图。在建筑的中心位置用红色标记了一块矩形区域。'
        },
        {
          role: '疯眼',
          id: 3,
          title: '劳动力',
          content: '机器比人类更可靠。',
          conclusion: '图纸2：绘制着奇怪人形结构物体的图纸。看起来完成这份设计需要制造数百种零件。'
        },
        {
          role: '疯眼',
          id: '4',
          title: '奇怪的小孩',
          content: '我不喜欢那些吵闹的活物，他们使我头痛。',
          conclusion: '日记1：德罗斯夫妇提出了新的增建请求，他们带来了一批佣人。这只讨人嫌的队伍里还有一个奇怪的男孩，他对我的工作室表现出了极大的兴趣，得想个办法让他远离我的宝贝们。'
        },
        {
          role: '疯眼',
          id: '5',
          title: '密室',
          content: '还有比一个找不到的房间更安全的地方吗？',
          conclusion: '日记2：那小孩烦人至极，每次回头时总能看到墙角露出的衣摆或鞋子，蠢透了。'
        },
        {
          role: '疯眼',
          id: '6',
          title: '26号',
          content: '这是个突破。',
          conclusion: '实验记录1：对26号下达拿取编号为1木箱的指令，26号拿取1号木箱后停止移动。对26号下达拿取除编号为1以外木箱的指令，26号在拿取有编号的木箱后离开了实验区域，开始向无编号的木箱移动。'
        },
        {
          role: '疯眼',
          id: '7',
          title: '又一个',
          content: '我早该预见到的。',
          conclusion: '日记3：该死，是的，人类会繁殖。我应该好好记住这一点。我的雇主是一对年轻的夫妇，他们当然会生孩子！唯一值得高兴的是，小混球的注意力完全转移到“德罗斯小姐”身上了，这给我留出了修整密道的时间。'
        },
        {
          role: '疯眼',
          id: '8',
          title: '小麻烦',
          content: '他们再也不会令我感到惊讶了。',
          conclusion: '实验记录2：对26号下达启动指令，26号播放了未输入过的语音。该死的小鬼们！尤其是德罗斯小姐，她应该离我的机器人远点，它们不需要一些类似小猫小狗的名字。'
        },
        {
          role: '疯眼',
          id: '9',
          title: '暴民',
          content: '人类的愚蠢总是令我感到惊讶。',
          conclusion: '日记4：他们带走了所有人，包括孩子们。我应该让机器人守卫这里的，太迟了，太迟了。'
        },
        {
          role: '疯眼',
          id: '10',
          title: '守卫',
          content: '这等待真是漫长啊，但他们会回来的，不是吗？',
          conclusion: '图纸3：绘制着奇怪人形结构物体的图纸。新增了大量看起来像是武器的零件。'
        }
      ],
      letterCN: [
        {
          role: '疯眼',
          id: 1,
          year: '2020',
          title: '布杂艺术学院回绝信',
          letter: '亲爱的纪尧姆校长:\n收到您的来信时，我简直不敢相信我的眼睛，我的心中被喜悦和感激所溢满，快要承载不住，我从未想过自己一丁点微不足道的建筑才华能够得到这样的赏识，于我而言是多么大的荣幸啊。然而这封信或许会让您失望。\n首先,请原谅我擅自来一睹贵校风采,看着那些未来可能成为我同学的人们,如此的年轻有为，而我，一个乡间建筑工人的孩子，已年近三十，光是路费就耗尽了大部分积蓄，尽管可能有些许才华，但您的邀请对我来说只能是人生路上一个美好的梦，我不希望它醒于现实。事实上，我已经接受了一对庄园夫妇的邀请，会去为他们的庄园做修建，在这个世界阴暗的角落，为建筑添加一些见不得人的“装饰”，这应当才是我这种人的人生吧。\n最后，我对此一切深表遗憾！\n\n对您由衷感激的，\n您忠诚的\n巴尔克·拉·帕杜拉'
        },
        {
          role: '疯眼',
          id: 2,
          year: '2021',
          title: '一张信纸',
          letter: '先生，\n两个小鬼已抵达庄园数日有余。\n这两个家伙十分聪明，充满了好奇心，甚至会让我回想起那个总在墙角露出的衣摆。\n这原本是一组富有创造力的实验，虽然我讨厌其中一个孩子时常觊觎我的机器人。\n然而就在最近，我发现一切并未按照原本的设想发展，与其说是他们的聪慧超出了我的预期，不如说是他们确实可以在某些前提下达成短暂的合作，而恰巧这个前提就是我。\n常年埋没在阴暗处的锁链被无情地打上了聚光灯，每一处的锈迹被呈现在放大镜下，庄园从未被如此的一览无余过。\n即使目前还有两人暂未到达，但我毫不怀疑他们可以顺利地通过游戏，这样一来原本的实验便不再具有意义。\n于是我的脑袋里产生了两个疑问。\n天赋是上天难得的恩赐，它只会被给予极少数人，但是真的会有免费的馈赠吗？被命运青睐的他们，看起来就像是定子和转子，那么一旦他们之间的空气间隙被抽离，无法自由转动的二者又该如何斗争呢？\n至于另外一个问题，虽然我想我知道答案，但还是忍不住问出。\n您会允许再有人带着庄园的秘密离开吗？\n\n您最忠诚的，巴尔克·拉·帕杜拉'
        },
        {
          role: '疯眼',
          id: 3,
          year: '2022',
          title: '一封未被寄出的信',
          letter: '班恩,\n没有回信是因为我一直在思考一个问题。\n—直以来,我都认为理性是一种崇高的道德，是平面上运动着的均匀光滑的小球，不受任何阻力，在任何时候都不会出现偏差，永远保持一个方向。近来我发现“理性道德”这种东西，就跟理想实验一样，在现实生活中根本不会存在，哪怕是高智商群体，他们之间看似完美的合作，其结果最终也和其他平庸者一样,一败涂地。\n我承认我也曾对他们抱以某种希望，期待他们能够成功，或许是我在他们身上看到过熟悉的东西，而我不自觉地被那种东西吸引。不过换个角度，如果他们其实并不是真正的天才呢？我沉迷在他们智慧的表象中，一旦换个参考系——那场游戏，挫抑了他们的自负，同时也暴露出他们掩饰私欲的狼狈嘴脸。\n这也验证了他的想法是对的，内里混乱的东西就是需要我们进行修正而我们就是设计截止阀的人，只有光滑的圆弧内壁才可以提供一个没有噪音没有阻力的平稳工艺流程。尽管我曾受挫，但这一次我将全然地投入到计划当中，完全地，排出所有不完美的异常湍流。\n最后，我想你代我好好保管一样重要的东西，是我失败的试验品里找出来的故障零件，不它并不是失败，只是现在依旧不完美……\n巴尔克\n\n信件背面留有墨水洇花了的字迹，上面写着“Traitor?”\n和信笺摆在一起的，还有一个档案袋，档案袋上写着26，里面只有一副不完整的影像带。\n桌面的中央正摆着一个半个头颅的白色蜡像。\n\n截止阀阀体是阀的主要承压部件，并且容纳闭合元件。截止阀内的流动通道被设计成具有光滑的圆弧内壁而没有尖锐的角和尖棱，这样可提供一个不产生异常湍流及噪音的平稳工艺流动。流动通道本身必须具有恒定的面积以避免产生任何附加的压力损失和过高的流速。'
        },
        {
          role: '疯眼',
          id: 4,
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '疯眼',
          id: 5,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

