<template>
  <div>
    <h5>鹿头</h5>
    <Character :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      descriptionCN: [
        {
          role: '鹿头',
          type: '传闻',
          text: '班恩曾是个热心肠的猎场巡守，总是心软地放那些偷猎者离开。但他的宽容没有得到回报，从此班恩对任何进入自己“领地”的人都不再留情。'
        },
        {
          role: '鹿头',
          type: '故事背景',
          text: '班恩是个热心肠的猎场看守，总是心软地放那些偷猎者离开。但他的宽容没有得到回报，偷猎者们去而复返，袭击了他，可怜的班恩被摁在捕兽夹上，耳边不断回响着鹿群的哀鸣。偷猎者带着战利品离开后，猎犬把班恩拖回了庄园，从此班恩对任何进入自己“领地”的人都不再留情。'
        }
      ],
      deductionCN: [
        {
          role: '鹿头',
          id: '1',
          title: '守卫的职责',
          content: '这片森林不允许任何人踏入。',
          conclusion: '只有地主才能猎捕土地上的鸟类和野生动物。这就是为什么你需要一个猎场看守。'
        },
        {
          role: '鹿头',
          id: '2',
          title: '障碍',
          content: '有人在这里做了拦路的木板，他们想干什么？',
          conclusion: '这里仍然是一片宁静的森林，除了这些碍眼的木板。它们会卡住鹿角。'
        },
        {
          role: '鹿头',
          id: '3',
          title: '驱逐',
          content: '护林人的职责就是把那些闯入者赶走。',
          conclusion: '这些游客就像看不懂那些标识牌一样，也许我该把它们做得更醒目些。'
        },
        {
          role: '鹿头',
          id: '4',
          title: '抓捕',
          content: '总得有人为这些重复的，鲁莽的行为负责。',
          conclusion: '一张照片：壮硕的护林人拎着一个少年的衣领。'
        },
        {
          role: '鹿头',
          id: '5',
          title: '善心',
          content: '比起让这些误入森林的人被送进监狱，还是遣返他们更好。',
          conclusion: '“妈妈曾说过，与人为善能获得灵魂上的平静。她错了。”'
        },
        {
          role: '鹿头',
          id: '6',
          title: '米诺陶诺斯的山林',
          content: '你不应该让他们这么轻易地出入，这里可不是什么公园。',
          conclusion: '一张照片：几个偷猎者将护林人的脸摁向兽夹，一个少年拎着一颗驼鹿的头。'
        },
        {
          role: '鹿头',
          id: '7',
          title: '狩猎',
          content: '猎人与猎物，看守与入侵者，何其相似。',
          conclusion: '一个优秀的猎场巡守应当知道如何抓住那些入侵者，在这一点上，我们与猎人很像。'
        },
        {
          role: '鹿头',
          id: '8',
          title: '突袭',
          content: '对付一些狡猾的家伙，你得想点办法。',
          conclusion: '很显然，在他们意想不到的地方出现卓有成效。'
        },
        {
          role: '鹿头',
          id: '9',
          title: '修葺',
          content: '这些混球弄坏了太多东西。',
          conclusion: '一篇日记：世上有种最难修理的东西，是人心。'
        },
        {
          role: '鹿头',
          id: '10',
          title: '一视同仁',
          content: '他们都应该被送走！',
          conclusion: '一张照片：戴着驼鹿头颅的护林人看着在森林中逃窜的偷猎者。'
        }
      ],
      letterCN: [
        {
          role: '鹿头',
          id: 'I',
          year: '2020',
          title: '给巴尔克的信',
          letter: '亲爱的巴尔克:\n你已经在实验室里待了快一个月，小姐和少爷都开始朝林场跑了，这里对他们来说太过危险，偷猎者们一直在附近游荡。我甚至在林场里找到了新的捕兽夹，那些带着利齿的钢箍可以轻松地粉碎他们的脚踝。\n我希望你能制造一点防范这些混蛋偷猎者的装置，什么都可以，但是千万别太有杀伤力！我永远忘不了你那个威力巨大的“点火装置”，它差点引起了一场山火。\n说一些能让人能感到愉快的事吧，我在林场里发现了一只被遗弃的驼鹿幼崽。它太瘦弱了，一直在发抖，甚至没法自己站起来，我想这就是为什么它被单独留在灌木丛里。现在正是羊群产仔的季节，找几头母羊把它养大应该不难。\n我觉得“黑鼻子”是个不错的名字，如果你有更好的选择记得告诉我。\n\n你忠诚的朋友\n班恩·佩雷兹'
        },
        {
          role: '鹿头',
          id: 'II',
          year: '2021',
          title: '一张留言',
          letter: '巴尔克,\n\n我看到那些新的机关了,你也见到那个人了,对么?\n当我看到那个站在荒废之地尽头的身影时,我不得不怀疑一切是否是我的幻觉。\n我试探着像以前那样询问有什么可以效劳。\n我太久没有这样与人交流了,无法确定是否能被认出。\n幸好,我最担心的情况没有发生。\n因为那个人说:\n“继续你的工作,班恩,那些违反规则的人,需要付出代价。”\n一如曾经，我将如其所愿。'
        },
        {
          role: '鹿头',
          id: 'III',
          year: '2022',
          title: '一张沾满机油与血渍的纸条',
          letter: '你是对的，即便猎人忘记了猎弓的归属，即便愤怒的箭镞会伤及无辜，但我们都已无法再回头。\n更何况，终我一生，遇见的无辜之人屈指可数，而他们，都已经死在了那个血色月夜。\n非常不幸，你我都不在其中。\n所以，也只有你我，能帮助他将那些无辜之人无法宣泄的怨怒和不甘，还给这污秽的世界。\n\n班恩'
        },
        {
          role: '鹿头',
          id: 'IV',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '鹿头',
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

