<template>
  <div>
    <h3>隐士</h3>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '隐士',
          type: '传闻',
          text: '经历了辜负和背叛，看遍人们的纷争后，阿尔瓦认为，公式和原理永远无法推论人情，这世间能站在他身边的，只有那位拯救他于困境的神。'
        },
        {
          role: '隐士',
          type: '故事背景',
          text: '“阿尔瓦，我的朋友，如果连你都否定我的研究，我真不知道这世界上还有谁能理解我。”\n这句话曾是阿尔瓦·洛伦兹长久以来的噩梦，那时赫尔曼仍与他共事，两人总因为“永恒的完美机器”争吵不休。但一场实验引发的大火烧毁了一切，浓烟散尽，他手中只剩下赫尔曼的记录和手稿。\n多年过去，阿尔瓦成为了城里有名的发明家，甚至有了一个诚挚勤勉的爱徒。而正当他打算把一切倾囊相授时，却遭到了爱徒的指责和背叛：\n“一个江郎才尽的小偷，不配拥有这样的智慧。您独占我父亲的研究成果，又一直阻拦我的研究，怎么，就这么怕被人抢先？”\n师徒之争很快成为众人的谈资，阿尔瓦不愿辩白，但舆论早已在城市的每个角落飞速发酵。局面愈演愈烈之时，一场与多年前相同的爆炸结束了一切，等再醒来，一些身穿长袍的人推门而入。\n他们告诉阿尔瓦，他被一位慷慨的神所救，神会赐予他新的力量……以及不再被他人纷扰的新生。\n阿尔瓦选择了留下，在这里至少可以安安静静做自己喜欢的研究。现在他明白，公式和原理永远无法推论人情，这世间除了那位拯救他于困境的神外，没有任何人配站在他身边。'
        }
      ],
      deductionCN: [
        {
          role: '隐士',
          id: 1,
          title: '粒子',
          content: '渺小的微粒，足以构成庞大、喧嚣、变幻莫测的世界。',
          conclusion: '一封家书：“去吧，阿尔瓦，别再回这穷地方，去该被你改变的世界。”'
        },
        {
          role: '隐士',
          id: 2,
          title: '异电性',
          content: '吸引，来源于彼此的不同。',
          conclusion: '一则教师评语：赫尔曼满腔热忱，怀有极浪漫的科学理想；阿尔瓦则更沉默，是脚踏实地的实用主义者······在学术研究上，他们是极好的搭档。'
        },
        {
          role: '隐士',
          id: 3,
          title: '理论',
          content: '所有理论都来源于天马行空的梦，而我们的使命是将它证实。',
          conclusion: '一张图纸：夹在毕业证中，绘制着复杂的的机械结构，落款是赫尔曼·塞曼。'
        },
        {
          role: '隐士',
          id: '4',
          title: '可证伪性',
          content: '科学命题的标准之一，是必须有逻辑上的反例存在。',
          conclusion: '一页日记：离开的两年里他从不提及自己的事，但仍每月汇来研究经费。昨天他终于回来，我却越来越担忧那项研究的可行性······也许我们都不该试图证实不存在的东西，我的好友已经为此付出了太多。'
        },
        {
          role: '隐士',
          id: '5',
          title: '扭秤',
          content: '任何变化量都不容忽视。',
          conclusion: '小报头条：丈夫投资新兴项目耗尽家产，贵族女子积郁病逝。二人独子离家出走。'
        },
        {
          role: '隐士',
          id: '6',
          title: '绝缘体',
          content: '它阻止了能量的传输，但也避免了悲剧发生。',
          conclusion: '一张手稿：在密密麻麻的计算过程中，在零星的缝隙里，写满了同一句话：“阿尔瓦·洛伦兹背叛了我。剥夺我的理想，毁了我的一生”。'
        },
        {
          role: '隐士',
          id: '7',
          title: '场',
          content: '置身其中时，我们很难发觉自己正被改变。',
          conclusion: '一则报道：······此次事故中，一人于火场中丧生，初步调查起火原因为实验引起的爆炸。'
        },
        {
          role: '隐士',
          id: '8',
          title: '介质',
          content: '当所有过去留于一人，他便是承载那些过去的介质。',
          conclusion: '一篇日记：我试图将所有关于他和永动机的过去封存起来，但他们还是劝说我将那个失败品展出了······展览那天我又出现了幻觉，总觉得他也应该在场。'
        },
        {
          role: '隐士',
          id: '9',
          title: '参考系',
          content: '以过去为参考系，我们总是恐惧得出一切归零的结论。',
          conclusion: '一封自荐信：“当我看到展台上那件伟大作品的瞬间，我就确信，它将成为我毕生的追求······终有一日，‘永恒的完美机器’将不再是空谈。'
        },
        {
          role: '隐士',
          id: '10',
          title: '定律',
          content: '对客观事实的阐述，需要大量归纳和验证。',
          conclusion: '结论：“我找到了那个人的字迹，你剽窃他实验结果的证据！你这个骗子！”'
        },
        {
          role: '隐士',
          id: '11',
          title: '光',
          content: '是燃烧反应的产物，还是一种电磁波，又或者是神的创造？',
          conclusion: '一个声音：“阿尔瓦，你是我们想找到的‘科学的天赋’、启动更美好的世界的钥匙······”'
        },
        {
          role: '隐士',
          id: '12',
          title: '本质',
          content: '一种不变的属性。',
          conclusion: '最后的字迹：他们说的对，我需要的并不是那些愚蠢的东西，而我也早该知道，人类一向如此。'
        }
      ],
      letterCN: [
        {
          role: '隐士',
          id: 1,
          year: 'TBD',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '隐士',
          id: 2,
          year: 'TBD',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '隐士',
          id: 3,
          year: 'TBD',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '隐士',
          id: 4,
          year: 'TBD',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '隐士',
          id: 5,
          year: 'TBD',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

