<template>
  <div>
    <h5>勘探员</h5>
    <Character :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      deductionCN: [
        {
          role: '勘探员',
          id: '1',
          title: '善良',
          content: '你抛出的是橄榄枝，还是……',
          conclusion: '一则好人好事：一位叫诺顿的矿工，总是前往救济院参与对无家可归的老矿工的临终关怀。'
        },
        {
          role: '勘探员',
          id: '2',
          title: '勤劳',
          content: '付出越多，得到越多？',
          conclusion: '出工记录：诺顿坎贝尔总是第一个下矿，然后最后一个离开。'
        },
        {
          role: '勘探员',
          id: '3',
          title: '效率',
          content: '我们需要更多尝试。',
          conclusion: '一叠推荐信：看得出诺顿的每一任雇主都对他的勤劳好学赞赏有加，同时对不能长期雇佣他深表遗憾。'
        },
        {
          role: '勘探员',
          id: '4',
          title: '坚韧',
          content: '人不会永远倒霉，也许？',
          conclusion: '一页笔记：上面有13条记录，前12条看起来是地名，最后一条被划去。'
        },
        {
          role: '勘探员',
          id: '5',
          title: '耐心',
          content: '下一次……',
          conclusion: '日记：明天，我会去老头记录的最后一个地方，如果仍然一无所获，那么我希望他……'
        },
        {
          role: '勘探员',
          id: '6',
          title: '勇气',
          content: '危险越近，机遇越近。',
          conclusion: '一篇地质报告：该矿洞此前因不明物体坠击造成部分矿道堵塞，贸然疏通会造成矿洞内部结构坍塌。'
        },
        {
          role: '勘探员',
          id: '7',
          title: '机警',
          content: '你需要更加小心。',
          conclusion: '新闻：由于火药、雷管的使用，矿物开采将告别简单的凿岩开采时代。'
        },
        {
          role: '勘探员',
          id: '8',
          title: '分享',
          content: '你需要更多帮手。',
          conclusion: '开采注意事项：盗窃爆破品是违法行为，一经查明将报警处理。'
        },
        {
          role: '勘探员',
          id: '9',
          title: '魄力',
          content: '聪明人，懂得利用和舍弃。',
          conclusion: '一份事故报告：城郊一处矿洞发生爆炸坍塌，疑因开采商错误操作爆破品所致，对矿洞下是否存在生还者，警方表示希望渺茫。'
        },
        {
          role: '勘探员',
          id: '10',
          title: '幸运',
          content: '那只不过是别人的不幸。',
          conclusion: '一页病例：脸部中度灼伤，疑因过分靠近高温热源所致。'
        }
      ],
      letterCN: [
        {
          role: '勘探员',
          id: 'I',
          year: '2020',
          title: '来不及寄出的信',
          letter: '致诺顿:\n你这个臭小子!\n为什么突然不辞而别，再也不来看望我了?\n这个等死的粪坑我是再也待不下去了。\n我日夜思想回到矿洞，找到金灿灿主矿脉——\n你不会吧!\n你不会吧?\n你不会吧?\n你不会自已就先去了吧?\n\n那样你可真是、真是一个……\n别抛下我，求你了。\n你那张时而阴沉，时而灿烂的笑脸后面，到底藏着一颗怎么样的心?\n连一个老人…你不会欺骗一个在煤矿里摸爬滚打半辈子的老矿工吧?\n\n诺顿，好孩子，看在你父亲的面子上。\n不要抛弃他的老伙计。\n\n不!\n不…诺顿，该死的，你这块愚人金。\n\n铁凿本尼'
        },
        {
          role: '勘探员',
          id: 'II',
          year: '2021',
          title: '笔记的最后一页',
          letter: '(陈旧的字迹)\n账目:8月前结清酬劳,三成已付\n地点:欧利蒂丝庄园\n保存交通票据!续租,回来寻找新的落脚点。\n\n(新的字迹)\n那么大一笔钱!\n我还是第一次见那么多钱,这要是在矿上,得让多少人豁出命去争抢!\n瞧瞧,这就是不公平,穷人的人生难得安逸,而那些有钱人、老爷夫人们——他们只要躺着挥挥钞票就够了。\n过去的二十多年,我活得像阴沟里的老鼠,用暗无天日的地底生活换取苟且偷生的机会,拼了命的下井挖矿只为换点可怜的吃食。爆破的疤痕像蛆一样爬在我脸上,那些唾弃和嘲讽……我每次忍耐,就为了一点点向上爬的机会。\n真可笑啊,我费了这么多力气，这也只是底层人的努力——不过是终于从老鼠洞里爬了出来,不用再没日没夜地扒拉那些令人作呕的煤灰。而那些只会嘲笑人的可怜虫们,他们只配永远待在地底、被人踩在脚下腐烂生蛆。\n\n那笔钱是我应得且仅有我能得到的!想想吧诺顿·坎贝尔,这是多好的机会。简单的“游戏”,慷慨的雇主。铲除一个障碍、获得一大笔钱,这不比你以前做的那些容易得多?\n没有谁比谁的命更金贵,想想那个女人,想想她那副该死的倨傲的姿态!\n除掉她,至少在她下手之前!'
        },
        {
          role: '勘探员',
          id: 'III',
          year: '2022',
          title: '一篇调查记录',
          letter: ' ……\n在那篇矿洞开采事故的报道中，他们提到了唯一的幸存者——诺顿·坎贝尔。\n报道里是这样描述的：非法使用炸药导致了工作层矿顶的坍塌，数十名工人被困井下。复杂的矿井结构使救援工作难以开展。\n警方称，在搜救队即将放弃搜救时，有幸存者从离矿洞外几十米的山涧中打通了缝隙。与已经血肉模糊的遇难者相比，他仅遭受了部分烧伤……见报的内容仅有这些。\n我怀疑另有隐情，便花了些时间调查诺顿·坎贝尔。\n同是矿工的父亲早死于尘肺病，教育背景也一片空白……他只能像多数穷人一样奔波于生计。从前工友和雇主口中只能打探到这些。他性格阴沉，很少谈起自己的事。诺顿·坎贝尔作为客人被邀请到这个庄园，今天我找到了机会向他采访，只得到了些模糊的回答。\n问：一年前的矿难中，你是否参与了矿洞的非法爆破?\n答：这是常见的事。煤矿法就是摆设，都知道爆炸比凿岩开采快得多。\n问：根据调查，事故当天你提前了半个钟头下矿。\n答：习惯而已，那群懒鬼只会跟在我屁股后面，伸手等钱和矿石从天上掉下来。\n问：遇难者都死于坍塌时的乱石，你只遭受了脸部灼伤，是否说明矿难发生时你更靠近爆炸热源、但却有机会躲到安全地带?\n答：这种问题怎么不去问警方？他们调查的比我说的更清楚。\n我带的钱只够支付三个问题，和之前与他交谈时一样，诺顿·坎贝尔接受采访的态度并不友善，拿了报酬后便匆匆离开，他流露出的对富人的仇视是毫无掩饰的。\n之后，我们只在晚餐时见过一面。他和其他客人也没什么交谈，只是脸色更加阴沉。尽管普林尼夫人告诫我远离诺顿·坎贝尔，但在我看来，他只是对生活富足的人抱有嫉恨。\n经过采访和调查，我也有了更明确的猜想。被邀请来的人身上都有某个无法坐实的骇人传闻，这些游戏似乎指向了同一个目的。不过，那个人除外……'
        },
        {
          role: '勘探员',
          id: 'IV',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '勘探员',
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

