<template>
  <div>
    <h5>“慈善家”</h5>
    <Character :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      descriptionCN: [
        {
          role: '',
          type: '传闻',
          text: ''
        },
        {
          role: '',
          type: '故事背景',
          text: ''
        }
      ],
      deductionCN: [
        {
          role: '“慈善家”',
          id: '1',
          title: '“慈善”',
          content: '人们愿意给予那些好人信赖，所以我正试图做一个好人。',
          conclusion: '“噢，当然。我喜欢做慈善。”'
        },
        {
          role: '“慈善家”',
          id: '2',
          title: '无声潜行',
          content: '压低重心，放缓脚步，别被监管者发现，这正是我擅长的。',
          conclusion: '克利切·皮尔森完全不像个养尊处优的慈善家，他似乎对隐匿行迹颇有心得。'
        },
        {
          role: '“慈善家”',
          id: '3',
          title: '秘密',
          content: '在时间流逝中，没有任何秘密是永远缄默的。',
          conclusion: '孤儿日记1：“好心的太太给了我一块白面包，又热又软乎。可我却眼看着克利切从她背后拿了她的钱袋子。我真坏。”'
        },
        {
          role: '“慈善家”',
          id: '4',
          title: '宝藏',
          content: '别祈求宝藏从天而降，用你的双手去创造它。',
          conclusion: '孤儿日记2：“克利切说今晚上有个新来的孩子。他真走运，只少了左边。维诺妮卡说他需要休息，我看到她抱着换洗的床单，全是红色的污渍。希望他第二天能赶上早饭。”'
        },
        {
          role: '“慈善家”',
          id: '5',
          title: '逃离真相',
          content: '与真实背道而驰，这总能让我感到舒适和安全。',
          conclusion: '一张合照：克利切·皮尔森与一群残疾的小孩，他们背后的墙壁上挂着一条横幅：家，甜蜜的家。'
        },
        {
          role: '“慈善家”',
          id: '6',
          title: '协作',
          content: '在街头讨生活你往往需要学会合作，这里也不例外。',
          conclusion: '一篇报道：由克利切·皮尔森经营的白沙街第一家孤儿院正式运营。'
        },
        {
          role: '“慈善家”',
          id: '7',
          title: '灯下盲',
          content: '只见光，不见影，人往往看不到光鲜亮丽表面下的龌龊。',
          conclusion: '照片：克利切·皮尔森与一位穿着制服的神父在孤儿院中指挥着残疾的小孩演奏曲目。'
        },
        {
          role: '“慈善家”',
          id: '8',
          title: '掩人耳目',
          content: '这些傀儡散发着不祥的气息，它们好像在看着你。',
          conclusion: '给克利切·皮尔森·的信1：孤儿院里的孤儿们被确诊为精神障碍后应当被送往天主教会开办的疯人院内统一管理。'
        },
        {
          role: '“慈善家”',
          id: '9',
          title: '绝地求生',
          content: '监管者越来越近，而我绝不会放弃希望，我不会再被抓住。',
          conclusion: '档案：一张克利切·皮尔森的入狱照，左下角写着“偷窃”。'
        },
        {
          role: '“慈善家”',
          id: '10',
          title: '重新出发',
          content: '即使事情变得越来越槽糕，也要想办法振作起来。',
          conclusion: '一篇文章：上周教会医院的义诊中，发现白沙街孤儿院内有至少12名儿童罹患不同程度的精神疾病。白沙街孤儿院将由教会进行改造，作为儿童精神病院投入使用。'
        },
        {
          role: '“慈善家”',
          id: '11',
          title: '逃之夭夭',
          content: '即使事情变得越来越槽糕，也要想办法振作起来。',
          conclusion: '给克利切皮尔森的信2：明智的选择，上帝会感念您的慷慨，当然，政府给予的赔偿将弥补您在财政上的一切损失。白沙街需要一间新的孤儿院，我认为，此事委托您再合适不过了。'
        }
      ],
      letterCN: [
        {
          role: '“慈善家”',
          id: 'I',
          year: '2020',
          title: '给杜克神父的信',
          letter: '尊敬的杜克神父：\n\n我为您在白沙街的损失感到遗憾。\n您从没站在腐臭的沼泽里，自然不会了解这些一无所有者的恐怖之处。\n让他们睡在有屋顶的房子里，放些黑面包，每天劳作，给他们生存的希望和仍有价值的错觉，这些人就不会生出反抗的勇气。而您招募的那些医生完全忽视了这一点，只知道拼命地研究那些奇怪的汤剂，让这些人彻底变成疯子和傻子有什么好处呢？他们甚至无法正常地完成工作，一分钱都挣不回来！\n我很快会获得一笔丰厚的投资，新的疯人院已经在计划之中，我相信您对病人的怜悯会帮助这项慈善事业前行。如果能将白沙街的病人们转移到新的疯人院，使他们忘却过去的痛苦，这将使您在本地获得更大的赞誉。当然，您的善举会带来一些经济上的回报。我完全明白您不在意这些身外之物，请原谅我吧，实在不知道还有什么可以表达我的谢意。\n期待您的回信。\n\n您忠诚的\n克利切·皮尔森'
        },
        {
          role: '“慈善家”',
          id: 'II',
          year: '2021',
          title: '克利切的庄园日记',
          letter: '第一夜\n艾玛·伍兹小姐真是个可人儿。\n她俏生生的样子让我想起十多年前那个逃出来的女孩儿，当时要不是本大爷好心通知了疯人院的护工将她送了回去，她早就被街头混混们生吞活剥了！但我记得可清楚了，那个鸩占鹊巢的麦格伦“慷慨”地给了我十三个先令做回报。只有十三个！他怎么不发两个病号的白面包打发我？杜克神父怎么就选了这么一个吝啬的家伙当代理人。\n好笑的是，麦格伦先生那张臭屁脸没装多久就垮了。当时怀特姐弟在疯人院的遭遇，差点闹得不可收拾，那个断手的姐姐在我手里本来可是棵听话的摇钱树，到疯人院却被灌成了白痴。她弟弟更是被莫名其妙地夹了脑袋。\n可惜，太可惜了，多好的小帮手们，多甜蜜的一家人。\n现在机会来了，只要赢下游戏，我就能建立白沙街的第二个王国，艾玛这个甜妞儿就是我的王后——新的孤儿院值得试试更讨喜的代言人。\n到那时，我就再也不用装模作样地去讨好那些“上等人”了。\n在此之前，注意风度，克利切。'
        },
        {
          role: '“慈善家”',
          id: 'III',
          year: '2022',
          title: '克利切·皮尔森的一页实验档案',
          letter: '编号：4-0-2\n姓名:克利切·皮尔森\n【测试标记】\n1、自私自利\n2、好斗偏激\n3、身份扮演\n\n【测试倾向】\n唯利是图的小人，短浅的目光让4-0-2聪明反被聪明误。\n\n【测试结果】\n1、整体评价:\n4-0-2是在游戏中第一个出局的实验对象。他在庄园中因4-1-1的陷阱而失去了行动能力。而他最后是否真的回想起了4-1-1的身份?不得而知。\n\n2、流程说明:\n4-0-2针对4-0-3的陷害是幼稚且冒失的，这足以说明4-0-2是一个自作聪明，偏激好斗的实验目标。究其性格成因，源自于其混乱的成长环境。\n从小在街头流浪的4-0-2，向来以尔虞我诈来维持生计，从未得到过真诚善意的对待。因此，当4-1-1以天真的面庞施以关心时，4-0-2便轻而易举地沦陷其中。在4-1-1面前，他的机灵变成了笨拙，他的贪婪变成了弱点，他的自作聪明最后葬送了自己。\n\n3、实验总结:\n4-0-2残酷的生存智慧也是其仅存的一点“良知”：比起饿死病死在街头，逼迫孤儿们以身体残障博取同情顺势乞讨和行窃，在他看来是养活一帮边缘孤儿最经济实惠的方法了。\n这点也造就了4-0-2自大和自卑的矛盾性格：他在街头巷尾生活自如，甚至自诩孤儿院的“国王”。但在拼命想挤入的上流社会中，他则是一个会紧张到口吃的自卑小人。\n可以看出4-0-2有着身份扮演的习惯：他在孤儿们面前扮演“国王”，在教会面前扮演“慈善家”，在4-1-1面前扮演善解人意的稻草人——看似离奇的陷阱，却因此有迹可循。'
        },
        {
          role: '“慈善家”',
          id: 'IV',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '“慈善家”',
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

