<template>
  <div style="padding:8px;">
    <h5>野人</h5>
    <Letter :letter="letterCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      letterCN: [
        {
          id: 'I',
          year: '2020',
          title: '给亚瑟·罗素先生的信',
          letter: '尊敬的罗素先生:\n由于一些意外，任务目标在您的雇员到达前已被“除名”。\n非常遗憾，按照我们的合同，在这种情况下我将不会支付剩余酬劳。\n毕竟，没人能从那堆灰烬中找到一颗完整的头颅。\n\n祝好\n\n您忠诚的顾客\n麦克·莫顿'
        },
        {
          id: 'II',
          year: '2021',
          title: '一封皱皱巴巴的信',
          letter: '我走了！定金已经还给了你，塞在你枕头下面（我看你橱子没上锁，小心防偷）。哦，我甚至还多留下了一点，用来表达对你的小小谢意。\n感谢你帮我完成了在这里的最后一个心愿——一个王子该有的完美退场！我的心情从未像今天这样轻松愉快过。用不同凡响的方式“死去”，神秘地消失，留给人们一个传说式的背影。\n从今往后我终于逃脱了这被仿制的拙劣人生，再也不用和我的伙伴日复一日重复钻火圈的把戏，装疯卖傻博人眼球。你肯定不会理解这种滋味，当然，也不必理解。我敢说他们都不会认真寻找我，毕竟没人会在乎一个玩腻了的玩具，看厌了的观赏品。\n你和我不同，祝你享受舞台，享受伯纳德的关照。几天后的狂欢，正是你大展身手的时候。\n而我，祝我好运吧，我会去个没人能找得到我的地方，成为彻彻底底的“死人”。\n\n穆罗'
        },
        {
          id: 'III',
          year: '2022',
          title: '穆罗·莫顿的一页实验档案',
          letter: '编号:8-?-5\n姓名:穆罗·莫顿\n\n【测试标记】\n1、主人公情结\n2、缺乏归属感\n3、无法自我定位\n\n【测试倾向】\n在悲剧中寻求自我价值的“主人公”\n\n【测试结果】\n1、整体评价:\n特殊的成长经历导致离开马戏团的8-?-5很难对自己有明确的定位，虽然努力摆脱受人编排的命运，但他对自己的认知也往往来自于他人。\n2、流程说明:\n本组成员有十分明确的阵营划分:8-?-5与8-?-2结为坚固的同盟，共同对抗8-0-3和8-1-4。\n8-0-1被边缘化，但多次受到8-?-5与8-?-2的帮助。\n前期实验中，8-?-5没有迫切要达成的目的，同盟中的8-?-2表现出更强的目的性。前期8-?-5仅顺应时局采取行动，但在多次帮助8-0-1的过程中，8-?-5也逐渐对环境和自我产生明确的认知，认可了自己的价值和“使命”。\n本组实验以毁灭式的结尾结束，8-?-5成为唯一的幸存者。但在众人出局、仅有自己一人幸存时，8-?-5建立起的认知和归属感又一次崩塌。这也导致他在第9组实验未开始前便率先出局。\n3、分析总结\n根据过往经历，8-?-5最大的需求是探寻自己作为“人”的价值，找到归属感。\n马戏团的成长环境、被作为“野人”训练的经历……这些都导致他十分缺乏归属感：既不属于马戏团光鲜亮丽的演员们，也并非不懂文明的野人、野兽。\n马戏团中，8-?-5与大多数人疏离。但在实验的小环境下，与他人结盟让8-?-5感受到了团体的认可；与对手对抗让8-?-5有了被作为“人”正视的自我肯定。但建立在他人目光上的自我实现是不稳固的——一旦离开符合预期的特定环境，他又会再一次陷入无法自我定位迷茫中。\n这种现象也来源于8-?-5的主人公情结。他厌恶被编排，但从小的教育又让他潜意识里依赖既定的剧情：离开马戏团时希望有华丽的退场，实验中拯救8-0-1时又自我感动。通过实验里的相处，他重新认识了演员身份之外的同局者，也短暂找到了自己在现实中的主角位。但随着剧目落幕，人们接连退场。幸存的他又一次被“孤立”于集体外，失去归属，跌入空洞。'
        },
        {
          id: 'IV',
          year: '2023',
          title: 'Coming Soon',
          letter: 'Coming Soon'
        },
        {
          id: 'V',
          year: '2024',
          title: 'Coming Soon',
          letter: 'Coming Soon'
        }
      ]
    }
  }
}
</script>

<style>
.demo-table-expand {
    font-size: 0;
}

.demo-table-expand .el-form-item {
    margin-right: 0;
    margin-bottom: 0;
    width: 100%;
    white-space: pre-wrap;
}
</style>
