<template>
  <div>
    <h5>先知</h5>
    <Character :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      deductionCN: [
        {
          role: '先知',
          id: '1',
          title: '椋鸟',
          content: '嘿，你还好吗?',
          conclusion: '日记1：那是一只黑底白点的小可怜，它落在一棵橡树下，翅膀受了伤。冬天快来了，我不能让它躺在那里等死。'
        },
        {
          role: '先知',
          id: '2',
          title: '留恋',
          content: '与动物建立联系是件奇妙的事。',
          conclusion: '日记2：它的翅膀已经痊愈，试飞很顺利，但它看起来并不想离开。如果无法在冬季来临前重返鸟群，它的处境会很危险。明天再去发现它的地方试试吧。'
        },
        {
          role: '先知',
          id: '3',
          title: '信使',
          content: '惊鸟为智慧之人传讯。',
          conclusion: '日记3：在那棵橡树下，它终于振翅飞上枝头。可每当我试图离去，它就又会飞到我的肩膀上。看起来它希望我留在这里。'
        },
        {
          role: '先知',
          id: '4',
          title: '杜伊德',
          content: '这是艰难的复兴，尤其是在一片被罗马人征服过的土地上。',
          conclusion: '它带来了一位真正的杜伊德先知。'
        },
        {
          role: '先知',
          id: '5',
          title: '轮回',
          content: '人类的灵魂是不朽的，经过一定年限后，他们将进入另一个身体。',
          conclusion: '日记4：鸮的身体可以容纳尚未轮回的灵魂，他们的预言从不出错。从那双明亮的眼睛里，我总能看到不属于普通鸟类的智慧和平和。'
        },
        {
          role: '先知',
          id: '6',
          title: '誓约',
          content: '作为交换，立下不可违背的誓言。',
          conclusion: '“无论鸮睁眼或闭眼，圣洁灵魂的言语都不应被记载于有形之物。”'
        },
        {
          role: '先知',
          id: '7',
          title: '格秋',
          content: '如此奢侈，如此令人着迷，也如此沉重。',
          conclusion: '日记5：永远记得第一次见到她，那是生命中最美好的时刻之一。我不明白为什么她会如此特别，但我们一起度过的时间是如此迷人，以至于失去她成为一种不可忍受的选项。'
        },
        {
          role: '先知',
          id: '8',
          title: '预言',
          content: '“你不应该告诉她。”',
          conclusion: '格秋的信1:感谢您对小麦市场的预言，这使我父亲避免了巨大的损失。谁能想到呢?在短暂的时间内，运输时间竟缩短了如此之多。一切都如您所言“因为巨大变革的到来，农作物会变得唾手可得”!期待在社交季结束后与您见面。'
        },
        {
          role: '先知',
          id: '9',
          title: '寂静',
          content: '即使再大声，也不会得到任何回应。',
          conclusion: '日记6：那个声音消失了。鸮知道一切，这就是违背誓约的惩罚。'
        },
        {
          role: '先知',
          id: '10',
          title: '解决之道',
          content: '我不愿后退，也不能后退。',
          conclusion: '格秋的信2：亲爱的伊莱，听闻你的遭遇我感到万分抱歉。至于你提到的誓约，就像威尔士的英雄勒乌·鲁·吉夫斯一样。无论白昼或黑夜均不可，那便在黎明或黄昏，不论行走或骑马均不可，那就让他一只脚跨在山羊上一只脚放进锅里。总有一些窍门可以解决此事。'
        },
        {
          role: '先知',
          id: '11',
          title: '复响',
          content: '那个声音又在我脑中响起了。',
          conclusion: '“你会收到邀请，无论是什么，答应他。”'
        }
      ],
      letterCN: [
        {
          role: '先知',
          id: 'I',
          year: '2019',
          title: '【】敬启',
          letter: '尊敬的玩家：\n近好！\n您已顺利完成所有挑战任务，令人印象深刻！作为回报，请让我为您讲述威尔士英雄勒乌·鲁·吉夫斯之妻——布洛黛薇的故事，关于破坏誓约后，她得到了什么：\n“遭到背叛的勒乌被格罗夫·佩布投掷的长矛击中，变成了一只鹰，然后飞走了。勒乌的舅舅格维迪翁追上了他，发现他高高地栖息在一颗橡树上。 格维迪翁唱起了恩林诗，引导勒乌从橡树上落下，并将他变回了人形。在帮助勒乌恢复健康后，他们收回了被格罗夫与布洛黛薇侵占的土地。不仅如此，格维迪翁还追上了逃跑的布洛黛薇，把她变成了一只猫头鹰，一只受到所有其他鸟类憎恶的猫头鹰。\n格维迪翁宣布了布洛黛薇的结局：你将不再敢于明亮处露出自己的面孔，那是因为你将永远被其他鸟类敌视，无论它们在何处发现你，都将折磨和唾弃你。而你，永远不会忘记自己的名字——布洛黛薇。”\n可怜的布洛黛薇， 这就是为什么我们不鼓励破坏誓约，更不应当“亲手”去破坏它。\n我有一个小问题留给您：\n您，知道我的役鸟叫什么吗？\n\n祝安\n您真诚的\n伊莱·克拉克'
        },
        {
          role: '先知',
          id: 'II',
          year: '2020',
          title: '一封未寄出的家书',
          letter: '亲爱的格秋:\n你可能难以想象，我已经走到不可扭转的命运上。\n我来到这里寻求誓约的解脱之法，\n但前路或许比我们当初想象的都要艰险许多，\n这并不是什么无聊的玩笑。\n不知道为什么，今天看上去不太平静，\n我总是听到女子奄奄一息的喘息，\n直觉告诉我，我应该立刻离开，然而那个声音却再一次将我留在这里。\n然后我看到那位我始终相信的人，\n同我一样沉默的老好人，\n正用他的手毁坏我们仅存的希望，\n不过，不必过于担忧，\n无论将会遇见什么，我已坦然接受，\n毕竟，不谈论过去，不评议未来，\n我已付出足够多的代价，来铭记这神明为我启迪的真理。\n\n祝安\n伊莱·克拉克'
        },
        {
          role: '先知',
          id: 'III',
          year: '2021',
          title: '伊莱·克拉克的一页实验档案',
          letter: '编号：6-1-1\n姓名：伊莱·克拉克\n\n【测试标记】\n1、步步谨慎（“预知力”导致的精神负担）\n2、自视过高\n3、名利心\n\n【测试倾向】\n一无所知的“预知者”\n\n【测试结果】\n1、整体评价：庄园的首位不速之客，实验表现超出预期地有趣。\n2、分析总结：\n（1）与前组实验无异，恶意的导源始终是猜忌。\n极端情境下，合理制造利害不均等的“饵料”，易于刺激恶意甚至将其扩大化。\n（2）“预知”这一能力为首例，目前尚无充足实验结果佐证，无法准确定义，尚需更多实验数据支撑。\n但从6-1-1号的实验结果来看，若涉及诸如灵魂与未来方面的神秘学，湖景村试验场为激发此类能力的不二之选。之后的实验，或可搜寻类似6-1-1号的实验对象，于湖景村试验场集中观察。\n（3）预见未来，不一定能逆转未来。\n6-1-1号的实验结果表明，即便是概率事件下的分支选项，发展曲线最终也会无限趋近于某一既定事件。正如上两页中6-1-1号的实验行为记录所呈现的结果：他无法接受所预见的结局而作出多种尝试（包括但不限于抹除掉可能的妨碍对象）以求改变，却没想到为求改变而做出的一系列选择反而导向了最初预见的结局。可惜6-1-1号的试验有且仅有一次，结果不变，在实验过程无法重复的情况下，以下猜想无法验证：6-1-1号未能成功改变未来，是因为他为求改变所作出的选择本身就是会导致那个既定结局的选择，还是因为另外三位实验对象的行为规正了结局？\n关于这一点，另一派人也许更愿意用乌洛波洛斯象征之意来解释。\n（4）能预见未来的作弊者，反而是最一无所知之人。\n这正是整组实验最有趣的地方。初见这群实验个体时，谁又能推演得到实验结果是“预知者”葬送了“预知者”，“老实人”战胜了“作弊者”呢？'
        },
        {
          role: '先知',
          id: 'IV',
          year: '2022',
          title: '缠绕于役鸟脚环之内的隐秘纸张',
          letter: '飞鸟振翅得如此缓慢，水滴声止歇，铁腥气冻结，\n我的体内组成物质正渐次消散，雾与风的颗粒穿透我，\n我的眼中你的身影也慢慢隐去，世界静止，\n这一切我都真实地感知着。\n但不必为我悲伤，从预知到自己结局的那一刻起，我逐渐学会接受，只是不解——\n为何听从神的指示，死亡却徐徐走向我？为何深信先知所言，所见却始终欺骗我？\n直到此刻，脑海中的声音消失，我才终于理解为何神明让我答应一切。\n格秋，我曾允诺予你幸福与尊贵，然而噤声之下，一切姿态都是徒劳。\n心意与真理无法传达，我们所见甚微，我们不知甚多。\n所以愚钝的我到最后才意识到，我原来可以利用另一个躯壳兑现承诺，像卢格一样骗过神明。\n伊莱·克拉克会永远忘了你，“布洛黛薇”将重新记住你；\n而你，将听到我曾听到过的声音。\n最后，\n预言是对的，我该离开了，再见，亲爱的格秋。'
        },
        {
          role: '先知',
          id: 'V',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

