<template>
  <div>
    <h3>祭司</h3>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '祭司',
          type: '传闻',
          text: '菲欧娜·吉尔曼是一位神秘主义者，宣称是一位神明引导自己来到这个庄园，但没人相信她的说辞。'
        },
        {
          role: '祭司',
          type: '故事背景',
          text: '菲欧娜·吉尔曼是一位神秘主义者，总是随身携带着一枚古怪的金属环。菲欧娜宣称是神引导自己来到这个庄园，但没人相信她的说辞。'
        }
      ],
      deductionCN: [
        {
          role: '祭司',
          id: 1,
          title: '家庭',
          content: '不是每个人都适合这种生活。',
          conclusion: '一张照片：看起来很严肃的妇人抱着一个红头发的小女孩。'
        },
        {
          role: '祭司',
          id: 2,
          title: '别离',
          content: '他不会回来了，对吗？',
          conclusion: '一封信封：里面装着两份分居协议，没有多余的只言片语。'
        },
        {
          role: '祭司',
          id: 3,
          title: '理性',
          content: '审慎思考，得出结论，永远别让情绪驾驭你。',
          conclusion: '菲欧娜，不要像他一样，被那些英雄美人的故事搞坏了头脑。'
        },
        {
          role: '祭司',
          id: '4',
          title: '费那奇镜',
          content: '就像一曲永无止境的华尔兹，令人着迷。',
          conclusion: '每个人都在透过小孔看东西，这景象能被称为真是吗？'
        },
        {
          role: '祭司',
          id: '5',
          title: '远方',
          content: '有时候没有消息才是最好的消息',
          conclusion: '一封信件：菲欧娜，向东远行，探索世界的边境吧，也许你能在黄金之乡找到那个答案。'
        },
        {
          role: '祭司',
          id: '6',
          title: '信仰',
          content: '可以获得，可以被塑造，也可以被抛弃。',
          conclusion: '生而为人，信仰是一种选择，听从你自己的心声，不要畏惧他人的目光。'
        },
        {
          role: '祭司',
          id: '7',
          title: '愧疚感',
          content: '不够聪颖的我能够回应母亲的期望吗？',
          conclusion: '一张照片：红发少女坐在书桌前，接受年长妇人的教导，她看起来充满了困惑。'
        },
        {
          role: '祭司',
          id: '8',
          title: '探索',
          content: '任何事在没有亲身经历前都不应下定论',
          conclusion: '一封信封：里面放着一张去加尔各答的船票。'
        },
        {
          role: '祭司',
          id: '9',
          title: '救赎',
          content: '自然的法则隐藏在黑暗之中。',
          conclusion: '我听到了，那是天启。'
        },
        {
          role: '祭司',
          id: '10',
          title: '遗传',
          content: '每个人都或多或少地体现着父母的特质。',
          conclusion: '菲欧娜，为什么你不能像我一样呢？'
        },
        {
          role: '祭司',
          id: '11',
          title: '世界的真相',
          content: '今在，昔在，永在。',
          conclusion: '世间万物，有解才是必然吗？神啊，请回应我…'
        }
      ],
      letterCN: [
        {
          role: '祭司',
          id: 1,
          year: '2020',
          title: '湖景村调查报告',
          letter: '尊敬的吉尔曼小姐：\n我们的调查员沃尔克已经于一月前发回了第一批调查报告。\n沃尔克认为湖景村存在某些怪异的宗教活动，这可能对接下来的调查工作造成不良影响。\n事实上，我们也一致同意，这种宗教活动可能存在对调查员的人身危害。\n由于沃尔克已经申请休假，我们会在休假结束后与他练习确认是否继续调查，或指派另一位调查员前往湖景村。\n以下是沃尔克发回的报告原件：\n调查报告1\n9月12日，在多次遇到拒绝后外来户尤金·海沃德与玛乔丽·海沃德租得一间卧室。湖景村地形构造奇异，村民的主要居住区域被森林包裹，位于一座矿山脚下。还有一部分为靠近咸水湖的地块，三面环山，前往此区域只能通过一条狭窄的山间小路。\n调查报告2\n9月13日，尝试再次前往咸水湖地块，入口处出现了村民守卫进行交涉后被允许进入。咸水湖地块北面有一个山洞入口，有多名穿着黄色长袍的可疑人员把守。没有尝试靠近。\n调查报告3\n9月15日，咸水湖边出现了一艘大船，同样有穿着黄色长袍的守卫驻扎。我认为他们可能隶属某个宗教团体，这些人在湖景村似乎拥有某些特遣。村民拒绝回答相关问题，尤金与玛乔丽称呼那些守卫为“圣徒”。\n调查报告4\n9月17日，我尝试与其中一位圣徒搭话，对方出人意料地平易近人，这个宗教没有名称，又或者他并不想告诉我。总之，根据守卫的描述，他们致力于传播“神”的意志，并践行“神”爱世人的原则。只不过，这些“神”栖身于湖景村的咸水湖底，而世人得到神之爱的方式需要通过献祭。他没有对献祭的方式或者祭品进行回答。\n调查报告5\n9月19日，经过两天的旁敲侧击，玛乔丽向我透露了一些关于献祭的事情。她曾经躲在山顶从远处偷看过一次祭祀活动，圣徒从船上扔下祭品，不久后从湖底浮起海神巨大的阴影，而岸上的村民们则大声地诉说着他们的愿望，那声音大到足够到达山顶。很可惜，距离太远了，她看不清祭品究竟是什么。根据玛乔丽所说，村民的愿望最终都实现了。但她描述的愿望仅仅是一些日常所需，根据相关的调查经验，我认为愿望成真很可能是一种骗局。\n调查报告6\n9月21日，在过去的三天里我走访了每一位村民，表露出想要进一步了解湖神传说的意愿。他们对这个话题极度狂热，因此我得到了充足的消息。祭祀活动的用品由圣徒准备，均为活牲。向湖中投入牲畜后，湖神现身浮上水面，而村民们对湖神说出自己的愿望。这部分描述与玛乔丽的介绍一致，但玛乔丽不了解的部分是，许愿后圣徒会打开咸水湖背面的圣所，将祭品的残骸放入圣所完成最后的仪式。但最后的仪式究竟是什么，没有一个村民知道。我认为向守卫询问可能是个冒险的举动，下一次祭祀将在五天后举行，我会做好准备在那一天想办法进入圣所调查。\n沃尔克的第七份报告尚未寄回，我们计划与他的家人取得联系，催促他回家后立刻提交报告。\n祝安\n您忠诚的\n亚瑟·罗素'
        },
        {
          role: '祭司',
          id: 2,
          year: '2021',
          title: '一页泡皱的记录',
          letter: '吾友纳波利：\n这已经是我来到此处的第五天了。我们仍未收到“狂欢”开始的讯息。\n调查到目前为止，最可疑的是一个叫吉尔曼的女人。\n她是第三天来的，穿着怪异，成日神神叨叨，与所有人保持距离。每天下午都不见踪影，然后在傍晚带着一身难闻的气味再次出现。（但她的衣服却一直看起来很洁净）\n我曾经试图跟踪她的行迹，但多次行动都随着她凭空的消失与出现失败了。（基于我的职业考虑，这多少让我有些沮丧）\n不过，这一切疑惑，在今天有了一些进展。\n今天，第五个参与者来到了这里——他不愿意透露姓名，只说是一位作家。\n他和另一位生物学家几乎同时到达的，但因为他最后做的自我介绍，所以我姑且将他当作第五位。\n吉尔曼对作家先生显现出了不同寻常的关注。甚至私下攀谈了起来。他们使用着我不懂的语言，导致我无法知晓他们谈话的内容。\n但我发现，这位作家先生身上，有一种熟悉的气味，吉尔曼每天傍晚回来时都会带回来的，那种潮湿而泥泞的气味。\n明天，我或许可以将跟踪对象换成这位作家先生，希望能有新的突破。\n（下面的字迹因为长时间浸泡的关系，已然无法辩认）'
        },
        {
          role: '祭司',
          id: 3,
          year: '2022',
          title: '菲欧娜·吉尔曼的一页实验档案',
          letter: '编号：6-1-3\n姓名:菲欧娜·吉尔曼\n\n【测试标记】\n1、自信的怀疑论者\n2、浪漫主义\n3、天启\n\n【测试倾向】\n窥探“神意”的天启\n\n【测试结果】\n1、整体评价:6-1-3以自己丰富的学识和哲学的头脑来探寻信仰的真相，一个由她自己亲手构筑的真相。\n\n2、流程说明:\n6-1-3如期而至,基于她所掌握的情报,6-1-3快速锁定了6-0-5作为首个调查对象,前期6-1-3进展顺利,她占据着整个计划的主动权，但随着6-1-2的“意外”丧生，6-1-3对于6-0-5和湖景村所表现出的过度关注，同时引起了6-0-5和6-1-4的警觉，在6-1-6递补加入后，6-1-3过人的直觉，几乎让她逃过了6-0-5的“献祭”，但在关于“神意”的关键信息上，6-1-3的犹疑，让她错过了唯一的机会。\n\n3、分析总结:\n在确信药物效果已经足够稳定后，我决定向6-0-5发出邀请，但很长时期里，一直缺乏足够多的对照组，直到6-1-3的出现。\n作为我的老朋友为我“提供”的人选，虽然伴随着让整个计划夭折的风险，但我相信为了6-1-3这样特殊的实验体，是值得冒险的。\n毫无疑问，这是迄今为止最危险但也是最成功的一场实验。\n6-1-3聪敏、机警、极有行动力，并凭借她的特殊能力，发现了湖底的部分真相，6-0-5的故事为她补足了情报的缺失，也为药效的发挥，提供了足够多的操作空间。\n在整个实验中，作为目前掌握信息最多的参与者，6-1-3的最终实验结果，启发了我对于实验体选择的新思路。\n过人的头脑和更全面的信息掌握，并不会给实验带来更多的阻碍。相反，这一切都让那些虚妄的恐惧，变得更加真实可信。\n毕竟，真相与信仰都像费那奇镜中的绝景——\n“可以获得，可以塑造，可以抛弃，但不可触碰。”\n于她于我,皆如是。'
        },
        {
          role: '祭司',
          id: 4,
          year: '2023',
          title: '一张满是水渍的残页',
          letter: '今天下午，我第五次来到了湖边。\n再一次遇见了那个人，他仍然站在相同的位置，那艘破船旁，看向湖泊对岸密林的方向。\n我第四次问他，当年，年幼的他在湖底看到了什么。\n与前三次不同，这次他用那或许只有我们知悉的语言反问：\n“你希望我看到什么？”\n我无法回答，他似乎也没有期望从我这得到答案，自顾自地继续提问：\n“你不是去过么，你找到了什么？”\n我有一些惊讶，我确实去过湖底，但我以为我已经避开了所有人的耳目。\n所有——人——\n不过很快，我又有一些释然，一切都逐渐靠近我的猜想。\n可这仍然是一个我无法回答的问题——\n那里什么都没有，不是我在那的搜寻一无所获。\n而是我关于湖底的记忆，一片空白。\n我只有走进门之钥的记忆，却永远无法回想起门的另一边是怎样的景象。\n每当意识回归，我都已经浑身湿冷地站在湖边，就是他现在所在的位置。\n我不想再继续这场无果的对话，毕竟我还要为明天开始的“游戏”做准备。\n但在我转身离开时，他在我身后问了最后一个问题：\n“吉尔曼小姐，你有没有想过，不是我们在找寻答案，而是答案在召唤我们？”\n我呆立在原地，那种熟悉的、湿冷的感觉再一次袭来。\n曾经，在黄金之乡，也有人曾问过我这个问题。\n我猛然转头看向他的位置，但此时破船边已经没有人影，湖水冲刷着早已破败不堪的船身。\n第一次，这个我以为永远水平如镜的湖泊，涨潮了。'
        },
        {
          role: '祭司',
          id: 5,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

