<template>
  <div>
    <h5>空军</h5>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '空军',
          type: '传闻',
          text: '厌倦了日复一日在地面进行信号引导，玛尔塔想要驾驶属于自己的飞机，也许赢得这场游戏能令她如愿以偿？'
        },
        {
          role: '空军',
          type: '故事背景',
          text: '玛尔塔从小就擅长骑马射击，并在加入骑兵队后取得了上尉军衔。不满足于在马背上驰骋，玛尔塔学习了基础的飞机驾驶技巧，并很快沉迷其中。她放弃了在骑兵队的职位，加入空军，但玛尔塔并没有如愿当上飞行员，反而被要求在地面执行信号引导的工作。想要驾驶属于自己的飞机，她得找到可靠的“赞助商”才行。'
        }
      ],
      deductionCN: [
        {
          role: '空军',
          id: 1,
          title: '生来如此',
          content: '那是个女儿，真可惜。',
          conclusion: '玛尔塔，你不能选择自己的性别，这不是你的错。但每个人都可以改变。'
        },
        {
          role: '空军',
          id: 2,
          title: '家里的天使',
          content: '你会是个完美的妻子，就像考文垂·帕特莫尔的那首诗一样。',
          conclusion: '日记1：母亲对我说，你应当温柔，极具同情心并完全无私，成为“家里的天使”，玛尔塔。但我不想这样。'
        },
        {
          role: '空军',
          id: 3,
          title: '家里的将军',
          content: '出色的女主人能安排家中的一切杂务。',
          conclusion: '日记2：倘若我能组织、委派、教导仆人并明智地安排一切财务支出，那为何我不能成为一个出色的军官？父亲说过，玛尔塔，你的骑术不比任何一个骑兵上尉差劲。'
        },
        {
          role: '空军',
          id: '4',
          title: '成功',
          content: '我成功，因为我志在要成功，未尝踌躇。',
          conclusion: '一张照片：玛尔塔穿着不合身的骑兵上尉制服。'
        },
        {
          role: '空军',
          id: '5',
          title: '游戏',
          content: '该停止你的游戏了，玛尔塔。',
          conclusion: '她为什么就不能停止那些该死的活动？穿着男人的衣服，做那些不得体的事情！'
        },
        {
          role: '空军',
          id: '6',
          title: '亨利',
          content: '他是不同的。',
          conclusion: '一张照片：玛尔塔依偎在一位年轻飞行员的身边，他们看起来很幸福。'
        },
        {
          role: '空军',
          id: '7',
          title: '得体',
          content: '每个人都得找准自己的位置',
          conclusion: '日记3：母亲说亨利是一个不错的结婚对象，她说得没错。但身份或财产并不是他最大的优势。'
        },
        {
          role: '空军',
          id: '8',
          title: '无聊的差事',
          content: '玛尔塔，认清现实。',
          conclusion: '日记4：我不喜欢穿着制服等待，对着那些人微笑。也许我该在工作时溜出去。'
        },
        {
          role: '空军',
          id: '9',
          title: '天作之合',
          content: '而我找到了最完美的那个。',
          conclusion: '一张照片：亨利拿着一张滑翔机图纸向玛尔塔解释着什么。'
        },
        {
          role: '空军',
          id: '10',
          title: '放任自流',
          content: '噢，女人，总是那样。',
          conclusion: '一份没意思的工作，一个心不在焉的员工。'
        },
        {
          role: '空军',
          id: '11',
          title: '意外',
          content: '你应该知道在起雾的机场需要什么吧？别忘记信号枪！',
          conclusion: '一张照片：坠毁的滑翔机。'
        }
      ],
      letterCN: [
        {
          role: '空军',
          id: 1,
          year: '2020',
          title: '给德罗斯男爵的一封信',
          letter: '尊敬的德罗斯男爵：\n我收到了您的来信，并为此万分感激您，您信中的提议极大地引起了我的兴趣。\n正如您说的那样，我的确在为上一桩差事的收尾问题而苦恼加入到您的“游戏”并为您工作，也许能够解决我现在的烦恼。\n但同时，我需要您为我提供安全保障：一个崭新的身份，一份拥有充足动机的可信经历。\n我可以成为任何人，只要不是现在的“我”。\n别忘记发生在您家人身上的惨剧。\n我不希望惊动那一位大人，至少现在不行。\n期待您的回信。\n\n祝好\n知名不具'
        },
        {
          role: '空军',
          id: 2,
          year: '2021',
          title: '两张身份证明',
          letter: '第一张身份证明,已被撕成四片,拼凑起来勉强可以还原上面的记录:\n姓名:玛嘉蕾莎·哈丽\n职业:教师\n年龄:20\n出生地:英格兰\n瞳孔颜色:褐色\n签字:字体娟秀的的签名\n纸张背面写着一串奇怪的字符:\nksoqsklpwgvab\n第二张身份证明,纸张完整,有折痕,正面文字:\n姓名:玛尔塔·贝坦菲尔\n职业:空军\n年龄:20\n出生地:英格兰\n瞳孔颜色:褐色\n签字:笔锋刚硬的签名\n背面写着一些笔记,从字体与书写习惯看跟两份记录上的签名都不同:\n一个合适的新身份\n她是谁?\n与她一起来的同伴呢?\n胜利者?牺牲者?\n还是和那个酗酒的女人一样?\n弃权退出?\n(最后一行字迹潦草) \n无关紧要, 这已是唯一选择。'
        },
        {
          role: '空军',
          id: 3,
          year: '2022',
          title: '？？？的一页实验档案',
          letter: '编号：6-1-4\n姓名：？？？\n\n【测试标记】\n1、伪装者\n2、真实中的谎言\n3、身份扮演\n\n【测试倾向】\n遗忘本我之人。\n\n【测试结果】\n1、整体评价：最难伪装的身份是自己。\n\n2、流程说明：\n该组被设计成“匹诺曹”小游戏，四个试验品均被要求将“真与假”反过来演绎。\n按照规则，6-1-4号需在游戏中使用真实身份。但在自我介绍的时候，她依旧使用虚假身份，且她的虚假身份得到了同组其他三个实验体的认可。当晚6-1-4号便受到警告。于是第二天她重新自我介绍，但是她的真实身份反而被其他三个实验体推断为虚假信息。她在游戏内的“撒谎”行为，使得6-1-2号认定她为预言中那个造成最后“悲剧”的“谎言”。以至于，当她在游戏最后尝试向6-1-2号阐述“真相”时候，未能得到信任。造成她与6-1-2号的悲剧。\n\n3、分析总结：\n6-1-4号自身就是一个“假”的人，这也导致该组实验出现了一个有趣的现象：同组的实验体可以接受6-1-4号的谎言，但当她决定坦诚后，她吐露的真相在别人眼里却漏洞百出。\n6-1-4号在生活中一直以他人的身份出现，对她而言，“假身份”反而是真实的存在，而真实的她自己才是那个“假身份”。她与同组其他人在“真与假”的心理感知上存在偏差，所以当要求她用真实的自己出现时，对同组其他人以及她自己而言，反倒成为了一个谎言。\n事实也证明，当6-1-4号以“假身份”示人的时候，她表现得淡定从容，仿佛她就是这个人。而在游戏中要求她用真实的自己登场时，却表现得手足无措。\n由此推断，6-1-4号准备好了去假扮任何一个身份，唯独没有准备好做她自己。\n她就像是受到惩罚的厄科，永远无法自主地说话，只能靠模仿别人的声音来发声。\n而该组实验，最后造成四个实验体悲剧结果的原因也正在于此。并非如6-1-2号所预言那般源于谎言，相反，是那个每一次被当作谎言而未能被相信的真相。'
        },
        {
          role: '空军',
          id: 4,
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '空军',
          id: 5,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

