<template>
  <div>
    <h5>杂技演员</h5>
    <Character :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      descriptionCN: [
        {
          role: '',
          type: '传闻',
          text: ''
        },
        {
          role: '',
          type: '故事背景',
          text: ''
        }
      ],
      deductionCN: [
        {
          role: '杂技演员',
          id: '1',
          title: '家',
          content: '他就像父亲，理想中的那种。',
          conclusion: '照片1：留着八字胡的中年男性抱着一个金发的小男孩，站在马戏团帐篷前面。'
        },
        {
          role: '杂技演员',
          id: '2',
          title: '杂耍的秘诀',
          content: '丢掷技很有趣，它是串场演员的拿手好戏。',
          conclusion: '伯纳德说，布袋的尺寸、形状，以及填充物的种类至关重要。他拒绝了我往布袋里填充石块的要求，理由是“太不安全”。'
        },
        {
          role: '杂技演员',
          id: '3',
          title: '艺术的形式',
          content: '那些富有创意的实践才是促进舞台表演不断进步的原因。',
          conclusion: '笔记本：详细记录了硝酸铵的各项性质与部分“实验记录”。'
        },
        {
          role: '杂技演员',
          id: '4',
          title: '新面孔',
          content: '马戏团，是人来人往的地方，我们总是欢迎新面孔，显然，是漂亮的那些。',
          conclusion: '一张照片：红头发的英俊年轻人搂着一位美貌的金发少女。'
        },
        {
          role: '杂技演员',
          id: '5',
          title: '“亲爱的”',
          content: '人们如何称呼彼此往往体现着双方关系发展所达的程度。',
          conclusion: '我爱硝酸铵！只要与水混合，即使在炎热的夏天，也能变得凉快起来！伯纳德的表情实在太有趣了，他甚至称呼我为“亲爱的麦克·莫顿先生”！噢，伯纳德，我还想再听一次，下次，我要把冰凉的手伸进你的领子里。'
        },
        {
          role: '杂技演员',
          id: '6',
          title: '哭丧脸',
          content: '观看一张伤心的脸有时会为我们带来些许阴暗的愉悦感。',
          conclusion: '伯纳德问候了我心爱的小宝贝们，他认为裘克脸上的伤看起来更像“腐蚀”，他的怀疑真让我伤心！当然，我的确丢失了一瓶强水。也许，在伯纳德发现这次“管理不善”前，我得再弄一瓶回来。'
        },
        {
          role: '杂技演员',
          id: '7',
          title: '嘉年华',
          content: '狂欢通常意味着混乱，而混乱，意味着机会。',
          conclusion: '购物清单：硝镪水，骆驼粪，牛奶，鸡蛋'
        },
        {
          role: '杂技演员',
          id: '8',
          title: '落幕',
          content: '一切，都结束了。',
          conclusion: '剪报：嘉年华大屠杀凶手不明，民众认为当地警方侦办不利，要求进一步调查。'
        },
        {
          role: '杂技演员',
          id: '9',
          title: '安可',
          content: '观众们常常因欣赏表演而希望表演者能够再回到舞台上继续演出。',
          conclusion: '我翻遍了市殓房，找到了所有人，除了那对新来的奇怪的情侣。他们那天被安排压轴，没机会偷溜出来。'
        },
        {
          role: '杂技演员',
          id: '10',
          title: '幕后返',
          content: '念出他们的名字，让他们，再次回到舞台。',
          conclusion: '邀请函：随信附上了一张黑发女人的照片，照片背面写着一个名字——娜塔莉。'
        }
      ],
      letterCN: [
        {
          role: '杂技演员',
          id: 'I',
          year: '2020',
          title: '给亚瑟·罗素的信',
          letter: '尊敬的亚瑟·罗素先生:\n感谢您上次发来的调查报告，帮助很大。\n关于驯兽师娜塔莉，或玛格丽莎·泽莱，我还想了解她的家庭，在进入喧嚣马戏团之前她的生活是怎样的。\n我将在下周离开一段时间，酬劳的支付方式与之前一致，调查报告不必寄出，我会在之后登门领取。\n\n期待您的回信\n\n您忠诚的\n麦克·莫顿'
        },
        {
          role: '杂技演员',
          id: 'II',
          year: '2021',
          title: '麦克·莫顿的庄园日记',
          letter: '第四页\n还真是出乎意料的一次聚会啊，没有想到会在这里见到我的“老朋友”!\n这几天我总是隐隐约约看见那熟悉的一瘸一拐的身影，我的心忍不住“砰砰”直跳，但是又不敢相信，他果然还活着！！！不过说起来，这四个丑八怪的脸放在一起还真是好笑，餐桌上他们坐一边的时候我都快要忍不住了，哈哈哈哈哈哈！\n（该页还有一些笔尖戳过的痕迹）\n\n第六页\n呵，那种女人果然一点也不会变，真是令人生气，在餐桌上那么明目张胆，她还以为这里是“喧嚣”呢，妄想再次耍弄她那些小把戏，把这里搞得乌烟瘴气！\n\n第七页\n可恶，他又流露出那种神情，和在“喧嚣”时一模一样，我不能再让那个女人得逞！\n\n第九页\n为什么他们会都在这里，这太不对劲了！难道是有人故意这么安排的？会是谁？\n我想起他们看我时的那种眼神，对，我确定他们晚上一起看着我，难道是那个女人？不对，她也不至于那么聪明，靠的不过是些姿色上的小把戏而已。\n啊，他们那残缺的身体，以前明明能给人带来欢声笑语，为什么现在在这里会这么让人觉得可怕！我不能再想了！\n嗯，我要好好想想对策了。\n(该页下方有一道钢笔划痕)'
        },
        {
          role: '杂技演员',
          id: 'III',
          year: '2022',
          title: '麦克·莫顿的一页实验档案',
          letter: '编号：8-? -2\n姓名:麦克·莫顿\n\n【测试标记】\n1、天真的复仇者\n2、眷恋家人\n3、思维敏捷\n\n【测试倾向】\n迷路的“家人”，回不去的“喧嚣”。\n\n【测试结果】\n1、整体评价：\n作为8-1-4的对照组，同为“喧嚣”马戏团幸存者的8-?-2没有被施以药剂。在整个游戏过程里，8-?-2的确没有沉浸在故友相聚的氛围中，是头脑最为清晰的实验目标。\n\n2、流程说明：\n8-?-2带着探明真相的目的来到庄园，未想能重见“喧嚣”的诸多旧人。而在8-0-1被袭击的那一刻，8-?-2心中已有了模糊的答案，过往种种黑暗面也随之揭开。在游戏中，8-?-2和8-?-5联手设计的“嘉宾演出”，彻底击碎了8-0-3与8-1-4的合作关系。但面对再度失去8-1-4而消沉的8-0-3，8-? -2选择放弃报复，留在了他怀念已久的舞台上。\n\n3、实验总结:\n曾经乐观率性的8-?-2如何复仇是本组实验最大的悬念之一。而最后8-?-2放弃复仇的选择，并没有脱离他的本性：“喧嚣”马戏团的家人在他心中是第一位的。这种对家庭的依恋幼稚且盲目。当“喧嚣”过往的黑暗面被一一揭开，8-?-2才终于发现自已的快乐舞台只存在于那段表面平静的短暂时光（这点我感同身受）。而信念崩塌的8-?-2没能再成熟地面对现实——这再度证明：天真和乐观在游戏中无法存续。'
        },
        {
          role: '杂技演员',
          id: 'IV',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '杂技演员',
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

