<template>
  <div>
    <h5>红夫人</h5>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '红夫人',
          type: '传闻',
          text: '玛丽对下棋毫无兴趣，因为皇后是最容易被吃掉的棋子。'
        },
        {
          role: '红夫人',
          type: '故事背景',
          text: '谁会向这样一位娇俏可人儿提起“面包”这么煞风景的东西呢？她从出生起就环绕在鲜花、珠宝与华服之间，追求着时尚与美丽，出身于气氛轻松的皇室家庭使她带有不恰当的天真无邪，以至于上了断头台，还在苦恼着被行刑官剪断的长发。面朝下凝视着水盆中的倒影，她看着自己的裙子逐渐变成了红色。这就是红夫人记忆中最后的景象了。'
        }
      ],
      deductionCN: [
        {
          role: '红夫人',
          id: 1,
          title: '婚姻',
          content: '这是女皇玛利亚·特蕾西亚签下的契约。',
          conclusion: '密信1：国王的兄弟们对他某一项可笑的缺陷幸灾乐祸，虎视眈眈地觊觎登上宝座的机会。只要王后尚未诞下子嗣，这种阴暗的愉悦就可以持续下去。'
        },
        {
          role: '红夫人',
          id: 2,
          title: '夏宫',
          content: '小特里亚农宫并不是什么冥想静思之地，不过是她用于远离宫廷的避难所。',
          conclusion: '密信2：玛丽是个彻头彻尾的个人主义者，她只想到她自己，只想着那些时髦玩意儿。年轻又愚蠢的王后还不了解造谣污蔑、众口一词的强大威力。王室权威的溃败将从凡尔赛宫蔓延出来，关于国王的无能和王后的不知餍足，人们会爱死这些传言。'
        },
        {
          role: '红夫人',
          id: 3,
          title: '友人',
          content: '当你在婚姻中寻求不到任何慰藉，那友情将变得异常重要。',
          conclusion: '流言1：朗巴勒亲王妃是王后目前最亲密的友人，这种关系使年轻又孤独的王后头昏目眩，我听说她们之间有些不能大声宣扬的秘密。'
        },
        {
          role: '红夫人',
          id: '4',
          title: '波利涅克的沙龙',
          content: '如果对你仍有所求，那她就会成为你平生见过最体贴的善人。',
          conclusion: '密信3：推动波利涅克伯爵夫人进入夏宫并取代朗巴勒亲王妃是一件好事。她谦逊优雅，楚楚动人，但这个紫罗兰色双眸的天使将比蓬巴杜夫人更加费钱。她会为我们筑起新的社交联盟，以便把那些功勋贵族和来自奥地利的政治顾问们拒之门门外，使他们远离荣宠的中心。'
        },
        {
          role: '红夫人',
          id: '5',
          title: '孩子',
          content: '法兰西王后的分娩并不是一个单纯的私人家庭事件。',
          conclusion: '流言2：是个女儿！真没想到，国王竟然恢复了正常。据说分娩持续了整整七个半小时，而朗巴勒亲王妃是第一个冲进产房的人。'
        },
        {
          role: '红夫人',
          id: '6',
          title: '王座',
          content: '幸福生活的抛物线已经达到顶峰，再前行则会一路向下，直至谷底。',
          conclusion: '密信4：失去荣光的旧贵族们，尚未走出阴影的新贵族们，被罢黜的礼仪夫人们，因为相貌丑陋必须循规蹈矩的女人们.这些不受欢迎的群体聚集到美景宫中，在那个秘密的房间中炮制出谣言的毒药。他们对国王的生活展示出伪善的同情，只去专门针对容光焕发、幸福快乐的年轻王后。'
        },
        {
          role: '红夫人',
          id: '7',
          title: '君主思想的捍卫者',
          content: '他们也许处于危险之中，那又怎么样呢？',
          conclusion: '流言3：普罗旺斯伯爵和阿图瓦伯爵把自己的总部设在科布伦茨，向那些叛逆者宣战。而国王与王后身陷困境，采纳了宪法，为了活下去他们丢弃了王室的尊严，多么可悲可笑！'
        },
        {
          role: '红夫人',
          id: '8',
          title: '囹圄',
          content: '人往往在最艰难的时刻才能辨别谁是真正的朋友，可通常我们又不希望这种情形真的发生。',
          conclusion: '流言4：朗巴勒亲王妃仍然留在王后身边，而可爱又温柔的波利涅克伯爵夫人，早早地随着家族逃离了法国。她仍然不间断地往宫中寄信盼望着那些许机会，也许王权会再度复兴，那时候，她就又是一个忠诚的朋友了。'
        },
        {
          role: '红夫人',
          id: '9',
          title: '自由',
          content: '我们以你的名义行动。',
          conclusion: '密信5：革命的目的是击溃王权和专制，为此我们必须毁灭王后。而攻击落在王后身上，最好集中于她作为女人的身份。把各式各样的罪恶、道德败坏和变态反常全都不假思索，推到这只奥地利母狼身上，将《玛丽·安托瓦内特丑恶的一生》散发出去，将她的糟糕名声传播出去！'
        },
        {
          role: '红夫人',
          id: '10',
          title: '告别',
          content: '再崇高与纯洁的信念，倘若为小人所利用，也只会变的卑下和龌龊。',
          conclusion: '密信6：只要几天，几个星期，巴黎就会忘记，曾经有个名叫玛丽·安托瓦内特的王后被斩首，而人们很快就会想念曾经践踏王室的快乐，又期盼着迎来新的国王。革命终有一日将会成功，但必然不是建立在今日的伪证之上。'
        }
      ],
      letterCN: [
        {
          role: '红夫人',
          id: 1,
          year: '2020',
          title: '判决书',
          letter: '有罪\n让娜·德·瓦罗尔判决有罪。\n近年，让娜·德·瓦罗尔为了让红衣主教德雷萨相信其王后密友身份，引诱德雷萨的亲信前龙骑兵雷托作为内应，诱骗妓女奥莉诺乔装成当今王后玛丽·安托瓦内特。\n在此期间，让娜·德·瓦罗尔用玛丽·安托瓦内特王后的身份与德雷萨通信，并骗取钱财，更致使主教德雷萨为其签订下价值160万法郎红宝石项链的购买协议。\n以上罪行，在主教德雷萨向本院所提供的协议、通信信件等物证中都被予以证实。\n经审理查明，德雷萨提供的通信信件与王后本人字迹完全不同，且让娜·德·瓦罗尔指使乔装王后的奥莉诺与德雷萨见面时，王后行踪公开，有明确不在场证明，同时，经由其他证人指证，让娜·德·瓦罗尔也曾通过侯爵夫人及国王卫队长德·拉莫，骗取其他皇室成员大量钱财。\n其犯罪行为证据确凿，影响恶劣，现判决如下:\n本院认为，让娜·德·瓦罗尔以非法占有为目的，多次利用玛丽王后名义采用非法手段对德雷萨主教进行诈骗，涉案金额高达200万法郎，其行为已构成诈骗罪，指控罪名成立。\n处罚:处鞭笞刑，拷刑并终生监禁。\n\n无罪:\n主教德雷萨被指控诬陷罪名，因证据不足，且不存在诈骗和诬陷行为，判处无罪，但由于间接损害法国王后玛丽·安托瓦内特名誉权，现对其革职流放以示警告。\n\n1786年5月31日'
        },
        {
          role: '红夫人',
          id: 2,
          year: '2021',
          title: '一张泛黄的信纸',
          letter: '先生，\n收到您的委托后，我便立即启程前往历史学家的家中。在我说明来意后，对方遗憾地表示，因为数量有限，部分复刻品短时间内无法提供多余的样本给我进行研究，作为弥补，他慷慨地带我参观了这些复刻品的原件。\n在这些原件中，最宝贵的是玛丽的结婚契约，这是一份奇长无比、叠成几折的文件，今天这张羊皮纸已经发黄，在上面可以看见一个十五岁女孩，用笨拙的小手使劲地写下的全名：玛丽·安托瓦内特·约瑟芬·约翰娜。历史学家的描述令人身临其境，“那一天是5月16日，在凡尔赛宫路易十四的教堂里，玛丽举行了她的第二次婚礼，也是她真正的新婚大典。阳光透过五彩斑斓的玻璃照在她奢华的裙子上，就像是迎接新世界的第一道信号。赖姆斯大主教主持着这一神圣的结婚仪式，他将十三枚金币和结婚戒指交给王储，王储将戒指戴在新娘的无名指上，把金币交给新娘，接着这对新人一起跪下，接受众人的祝福。”，他娓娓道来，声音十分低沉，那美好的一天就像是一幅幅画在我眼前飞过。\n“除了这一点”，他指了指玛丽签名旁的墨迹，向我解释道：“婚礼那天，在所有签名的人中，只有她的羽毛笔不听使唤，会溅出墨点，也正是从那刻起大家就开始了对这个女孩的窃窃私语，一个不详象征的来临。”我直直地盯着那个污渍，它就像是被埋在土壤中生命力顽强的种子，每日被历史所灌溉。经历了漫长时间的酝酿，这粒种子在土壤中萌发的时间，甚至超出了它发芽生长的时间。实际上，玛丽在法兰西的一生，只有短暂的二十三年，从十五岁到三十八岁，斧头落地，小树芽就被斩断。而她根植的这片土地上所刻着的，是哈布斯堡古老的传家箴言：“让别人去征战杀戮，而你，幸福的奥地利，去联姻结盟。”\n她从来不是唯一的公主，不是唯一的玛丽。\n历史学家将他的一些笔记给了我，这部分我同信件一起寄给您，希望这些资料对您构思新的“故事”会有所帮助。\n\n您忠实的，\n罗伊'
        },
        {
          role: '红夫人',
          id: 3,
          year: '2022',
          title: '一封回信',
          letter: '尊敬的先生，\n我是您新的出版编辑（名字被划去），能有机会与您合作，我真是倍感荣幸。\n上个月我们收到您的样稿后，马上根据您的要求，再次举行了小规模的试读，受邀者按照惯例是根据您提供的名单指定，除了一位目前远在亚洲工作的女士无法联系到外，名单上其他人都接受了邀请。\n试读结束后，他们无不表示这真是一个扣人心弦、精彩绝伦的故事。\n特别是书中（名字被划去）孤独的内心、错步的命运无不让人想起那位大名鼎鼎的王后，我想这将为我们之后宣传，提供一个绝佳的切入点。\n而那彷徨不去的幽魂，让人不寒而栗的同时，也深深打动了一位来自法国尊贵的女士，她合上书时，甚至落泪了，她认为那幽魂与其说是对这世界的怨恨，不如说是对自身一次次被命运玩弄的不甘，从结尾段落的心境描写中，她仿佛看到了自己深陷深渊的一部分。\n为此，她希望您能与她的艺术顾问（名字被划去）见一面，谈谈将这一部作品改编成歌剧的可能性，这位女士在欧洲闻名遐迩，她的艺术顾问据说也来自在艺术界极具声望的家族，我想这次合作对您以及我们出版公司而言，都是不可多得的机会。\n\n您虔诚的（落款后半段被划去）'
        },
        {
          role: '红夫人',
          id: 4,
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '红夫人',
          id: 5,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

