<template>
  <div>
    <h5>昆虫学者</h5>
    <Character :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      descriptionCN: [
        {
          role: '昆虫学者',
          type: '传闻',
          text: '变故发生后，梅莉终于明白，人类与昆虫并无不同，他们只有在需要你时，才会足够忠诚。'
        },
        {
          role: '昆虫学者',
          type: '故事背景',
          text: '昆虫学者梅莉·普林尼一直是生物学界津津乐道的话题，一部分是因为她的出身，从贫寒的庄园女仆到女主人到富有的寡妇再到生物学界冉冉升起的明日之星，而更多流言的是关于她的外貌，梅莉极少露面，相对于高谈阔论的学会，她似乎更沉迷游走于密林、沼泽与荒野去寻找那些奇异的昆虫，即便是为数不多的几次在公众前出现，也带着遮盖住整张脸的夸张纱帽，有人说这是因为她丑陋不堪，不肯以真面目示人，有人说这是因为她美艳动人，害怕人们将关注点集中于她的外貌而非她的研究。'
        }
      ],
      deductionCN: [
        {
          role: '昆虫学者',
          id: '1',
          title: '稳态',
          content: '安全的生活取决于相对不变的环境。',
          conclusion: '一张照片：梅莉和一名年龄相仿的男子，在一片茂密的森林里，幸福相拥。'
        },
        {
          role: '昆虫学者',
          id: '2',
          title: '生物相',
          content: '我们真心渴望的，往往是表面生活所无法满足的。',
          conclusion: '一份处方：安眠药。'
        },
        {
          role: '昆虫学者',
          id: '3',
          title: '个体化原理',
          content: '那些痛苦，倘若无法让人却步，就只会让人索取更多。',
          conclusion: '一本字迹杂乱的笔记本:我对她的一成不变感到恶心。'
        },
        {
          role: '昆虫学者',
          id: '4',
          title: '向光性',
          content: '相信你所愿意相信的，难道不会更快乐吗?',
          conclusion: '一张照片：梅莉独自一人坐在餐桌上，沉默地凝视着对面空空的座位。'
        },
        {
          role: '昆虫学者',
          id: '5',
          title: '底栖生物',
          content: '海的底部有美梦也有绝望。',
          conclusion: '教会法院司法分居协议书：判决双方为司法分居。'
        },
        {
          role: '昆虫学者',
          id: '6',
          title: '关键性',
          content: '权利往往掌握在沉默的少数手中。',
          conclusion: '一张照片：梅莉坐在餐桌上,一名年龄相仿的男子坐在她的对面，面露不悦。'
        },
        {
          role: '昆虫学者',
          id: '7',
          title: '地理隔离',
          content: '那么近，那么远、',
          conclusion: '一份邀请函：我们对您的过往经历十分有兴趣，相信您的风趣幽默能感染我校学生。'
        },
        {
          role: '昆虫学者',
          id: '8',
          title: '专性寄生物',
          content: '生命的轻与重，他和我。',
          conclusion: '一篇日记：我将拿什么面对以后漫长的人生，缺失的生活？'
        },
        {
          role: '昆虫学者',
          id: '9',
          title: '异域物种形成',
          content: '周遭的气味发生了微妙的变化。',
          conclusion: '一张照片：一群蜜蜂围绕着一个戴着面纱的女子。'
        },
        {
          role: '昆虫学者',
          id: '10',
          title: '噬母现象',
          content: '每一次新生，总归需要伴随一些“牺牲”',
          conclusion: '一篇日记：我知道什么才能让我的精神世界永远快乐。'
        },
        {
          role: '昆虫学者',
          id: '11',
          title: '卵生',
          content: '新的个体破卵而出',
          conclusion: '一张照片：梅莉独自一人坐在餐桌上，微笑地看着对面的座位。'
        }
      ],
      letterCN: [
        {
          role: '昆虫学者',
          id: 'I',
          year: '2021',
          title: '一封家书',
          letter: '我的小甜心：\n你的父亲与我一直焦急着地等待着你的家用，期盼着你能如从前一样附上只言片语，我们都为你感到担忧。\n村民们说你定是因为我们催促你，并称你为“老姑娘”而不开心了，但在我们的记忆里你从小就没有为什么事生气过。你明白你的父亲与我，从来没有坐上过离开村庄的拖货马车。我们只是期盼着你能嫁得好一些，其他同你一样去大庄园做仆人的女孩子都说，能嫁个管家什么的她们都不敢奢望。\n你的回信着实吓了你父亲与我一跳，你说你一定会嫁给你们庄园的主人。你说为了能与他有共同话题，每晚会溜进他的书房看虫子相关的书籍直到深夜。我和你的父亲听后十分不解，在我们的认知里，只听说过能做好家务的夫人，能打理好庄园的夫人，或者是家室很好的夫人，不明白很了解昆虫怎么也可以成为庄园主的夫人。相比之下，我们更担心你会因为每晚读书，无法专心干好白天的工作，而被辞退。毕竟你现在的工作，是你所拥有的一切。\n你在信中还提到了你对主人的情感是仰慕和钦佩，你描述了他的为人和才华，但是原谅我们实在不能理解这种所谓了解昆虫的才华。村里也有许多认识虫子的人，那是多年务农的经验知识。或许，是我们杞人忧天，但我们仍希望你明白，我们虽然在物质上比较匮乏，希望在自己的能力范围内过得更好，但这并不意味着，这一切要你一局婚姻去换取。\n你的父亲与我都害怕，你想去的位置太高了，跌下来的时候不是你的父亲与我能接住的。\n\n挂念你的，\n安娜·恩德洛武'
        },
        {
          role: '昆虫学者',
          id: 'II',
          year: '2022',
          title: '笔记中的一页',
          letter: '7月调查报告\n研究目的:\n不同种类的昆虫各自具有不同生物习性,原本互不干预的昆虫在有限资源内会产生竞争关系。该实验旨在观察不同种类的昆虫放在同一器皿内可能会发生的结果。\n\n关键词:\n资源、关系、利用\n\n实验参考:\n有关雄性螳螂的一次成功实验。\n\n昆虫界的神经构造是反常识的，尤其对螳螂来说，下半身的神经负责呼吸、感觉以及运动，而头部的大脑却并不具备这么复杂的功能。对雄性螳螂来说，即使没了头，它依然能控制着后腿。雌性螳螂感到饥饿时，会利用周围所有的一切来保证生存，即使是身旁的雄性螳螂，他的头也会成为她的“盘中餐” 。有时断了头的雄性螳螂的下半身会更为灵敏，断头处理法可以帮助交配困难的雄性螳螂。\n\n实验对象:\n1、有翅亚纲-网翅目-竹节虫:伪装大师\n竹节虫最擅长伪装，他可以依照环境切换不同的形态，装扮成植物的样子，让自身完全融入到周围的环境中，惟妙惟肖，如不仔细观察，很难察觉他本来的样子。他的“伪装术”并非与生俱来，生物基因具有调节功能，当环境遭遇重大变故，生物会从环境的教训中得到学习，并发展成为自我保护的行为或习性。尽管竹节虫具有奇特的伪装生存行为，比其他的昆虫技高一筹，但他的伪装过于完美，以至于在迷惑敌人之前已经迷惑了自己。\n2、有翅亚纲-鳞翅目-飞蛾:\n蝴蝶和飞蛾都具有卵、幼虫、蛹这三个阶段，然而破茧之后才知道她是飞蛾而不是蝴蝶。\n飞蛾具有趋光性，当她奋不顾身扑向危险时，她似乎并不知道自己即将面对死亡。点燃一把火，等待她靠近光源，观察她是否真的会奋不顾身地扑向火焰。\n3、有翅亚纲-鞘翅目-金针虫:地下工作者\n常年生活在地下的昆虫，习惯了黑暗的环境，资深的“地下工作者”。即便他行动隐蔽，但他依旧是贪婪的，用一点“诱惑”，轻轻地在泥土表面撒上一圈粉末，当他的头从地里冒出来的时候他会知道那是毒药而不是食物吗？\n\n实验过程:\n（这部分被墨水涂成了黑色。)\n实验结论:\n险恶的环境下，昆虫会相互蚕食。\n这一页笔记还夹着一张未送出的纸条，\n德洛斯小姐，\n我们的眼睛被一层薄纱蒙住，于是狰狞的面孔变得柔和，善良的面孔变得可怖。\n我们无法取下那一层薄纱，漫天的迷雾已笼罩清澈的月光，无论前进的道路是否清楚，请记得我们来到这里的目的。'
        },
        {
          role: '昆虫学者',
          id: 'III',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '昆虫学者',
          id: 'IV',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '昆虫学者',
          id: 'V',
          year: '2025',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

