<template>
  <div style="padding:8px;">
    <h5>昆虫学者</h5>
    <el-collapse v-model="activeNames">
      <el-collapse-item title="角色日信件" name="1">
        <el-row>
          <el-col :span="24">
            <el-table :data="letterCN" style="width: 100%">
              <el-table-column type="expand">
                <template slot-scope="props">
                  <el-form label-position="left" inline class="demo-table-expand">
                    <el-form-item>
                      <v-html contenteditable="true">{{ props.row.letter }}</v-html>
                    </el-form-item>
                  </el-form>
                </template>
              </el-table-column>
              <el-table-column label="NO" prop="id" />
              <el-table-column label="年份" prop="year" />
              <el-table-column label="标题" prop="title" />
            </el-table>
          </el-col>
        </el-row>
      </el-collapse-item>
    </el-collapse>
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      letterCN: [
        {
          id: 'I',
          year: '2021',
          title: '一封家书',
          letter: '我的小甜心：\n你的父亲与我一直焦急着地等待着你的家用，期盼着你能如从前一样附上只言片语，我们都为你感到担忧。\n村民们说你定是因为我们催促你，并称你为“老姑娘”而不开心了，但在我们的记忆里你从小就没有为什么事生气过。你明白你的父亲与我，从来没有坐上过离开村庄的拖货马车。我们只是期盼着你能嫁得好一些，其他同你一样去大庄园做仆人的女孩子都说，能嫁个管家什么的她们都不敢奢望。\n你的回信着实吓了你父亲与我一跳，你说你一定会嫁给你们庄园的主人。你说为了能与他有共同话题，每晚会溜进他的书房看虫子相关的书籍直到深夜。我和你的父亲听后十分不解，在我们的认知里，只听说过能做好家务的夫人，能打理好庄园的夫人，或者是家室很好的夫人，不明白很了解昆虫怎么也可以成为庄园主的夫人。相比之下，我们更担心你会因为每晚读书，无法专心干好白天的工作，而被辞退。毕竟你现在的工作，是你所拥有的一切。\n你在信中还提到了你对主人的情感是仰慕和钦佩，你描述了他的为人和才华，但是原谅我们实在不能理解这种所谓了解昆虫的才华。村里也有许多认识虫子的人，那是多年务农的经验知识。或许，是我们杞人忧天，但我们仍希望你明白，我们虽然在物质上比较匮乏，希望在自己的能力范围内过得更好，但这并不意味着，这一切要你一局婚姻去换取。\n你的父亲与我都害怕，你想去的位置太高了，跌下来的时候不是你的父亲与我能接住的。\n\n挂念你的，\n安娜·恩德洛武'
        },
        {
          id: 'II',
          year: '2022',
          title: '笔记中的一页',
          letter: '7月调查报告\n研究目的:\n不同种类的昆虫各自具有不同生物习性,原本互不干预的昆虫在有限资源内会产生竞争关系。该实验旨在观察不同种类的昆虫放在同一器皿内可能会发生的结果。\n\n关键词:\n资源、关系、利用\n\n实验参考:\n有关雄性螳螂的一次成功实验。\n\n昆虫界的神经构造是反常识的，尤其对螳螂来说，下半身的神经负责呼吸、感觉以及运动，而头部的大脑却并不具备这么复杂的功能。对雄性螳螂来说，即使没了头，它依然能控制着后腿。雌性螳螂感到饥饿时，会利用周围所有的一切来保证生存，即使是身旁的雄性螳螂，他的头也会成为她的“盘中餐” 。有时断了头的雄性螳螂的下半身会更为灵敏，断头处理法可以帮助交配困难的雄性螳螂。\n\n实验对象:\n1、有翅亚纲-网翅目-竹节虫:伪装大师\n竹节虫最擅长伪装，他可以依照环境切换不同的形态，装扮成植物的样子，让自身完全融入到周围的环境中，惟妙惟肖，如不仔细观察，很难察觉他本来的样子。他的“伪装术”并非与生俱来，生物基因具有调节功能，当环境遭遇重大变故，生物会从环境的教训中得到学习，并发展成为自我保护的行为或习性。尽管竹节虫具有奇特的伪装生存行为，比其他的昆虫技高一筹，但他的伪装过于完美，以至于在迷惑敌人之前已经迷惑了自己。\n2、有翅亚纲-鳞翅目-飞蛾:\n蝴蝶和飞蛾都具有卵、幼虫、蛹这三个阶段，然而破茧之后才知道她是飞蛾而不是蝴蝶。\n飞蛾具有趋光性，当她奋不顾身扑向危险时，她似乎并不知道自己即将面对死亡。点燃一把火，等待她靠近光源，观察她是否真的会奋不顾身地扑向火焰。\n3、有翅亚纲-鞘翅目-金针虫:地下工作者\n常年生活在地下的昆虫，习惯了黑暗的环境，资深的“地下工作者”。即便他行动隐蔽，但他依旧是贪婪的，用一点“诱惑”，轻轻地在泥土表面撒上一圈粉末，当他的头从地里冒出来的时候他会知道那是毒药而不是食物吗？\n\n实验过程:\n（这部分被墨水涂成了黑色。)\n实验结论:\n险恶的环境下，昆虫会相互蚕食。\n这一页笔记还夹着一张未送出的纸条，\n德洛斯小姐，\n我们的眼睛被一层薄纱蒙住，于是狰狞的面孔变得柔和，善良的面孔变得可怖。\n我们无法取下那一层薄纱，漫天的迷雾已笼罩清澈的月光，无论前进的道路是否清楚，请记得我们来到这里的目的。'
        },
        {
          id: 'III',
          year: '2023',
          title: 'Coming Soon',
          letter: 'Coming Soon'
        },
        {
          id: 'IV',
          year: '2024',
          title: 'Coming Soon',
          letter: 'Coming Soon'
        },
        {
          id: 'V',
          year: '2025',
          title: 'Coming Soon',
          letter: 'Coming Soon'
        }
      ]
    }
  }
}
</script>

<style>
.demo-table-expand {
    font-size: 0;
}

.demo-table-expand .el-form-item {
    margin-right: 0;
    margin-bottom: 0;
    width: 100%;
    white-space: pre-wrap;
}
</style>
