<template>
  <div>
    <h5>律师</h5>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '律师',
          type: '传闻',
          text: '即便被那场身败名裂的官司击垮了，弗雷迪也从未怀疑：法律的目的从不是允许做什么，而是明令不能干的事。但现在，还剩什么是不能做的呢？'
        },
        {
          role: '律师',
          type: '故事背景',
          text: '受困于过去的失败官司，他现在干着一份卑微的工作，拿着微薄到可笑的薪水。与此同时，弗雷迪希望可能找到一条摆脱过去的出路，并且最终过上那种他从未拥有的生活。当然，首先他得找到那个毁掉他美满生活的罪魁祸首。'
        }
      ],
      deductionCN: [
        {
          role: '律师',
          id: 1,
          title: '合作伙伴',
          content: '成功的生意人往往拥有至少一个可靠的伙伴。',
          conclusion: '一则结婚声明：1874年3月14日，里奥·贝克与玛莎·雷明顿在德文垂郡结为夫妻。这对甜蜜的夫妻在约瑟夫神父的见证下宣誓。据悉，玛莎·雷明顿即日更名为玛莎·贝克。'
        },
        {
          role: '律师',
          id: 2,
          title: '淘金者',
          content: '看起来游戏场地里有不少好东西。',
          conclusion: '弗雷迪·莱利的人生信条：绝不放过任何牟利的机会。'
        },
        {
          role: '律师',
          id: 3,
          title: '独家消息',
          content: '“这是个变化中的时代，掌握独家消息你才能获得成功！”',
          conclusion: '一张广告：弗雷迪·莱利为您提供最佳的理财建议，不良资产处置与并购专家，您可靠的事业伴侣'
        },
        {
          role: '律师',
          id: '4',
          title: '兢兢业业',
          content: '人们更愿意相信努力的人，至少，你要看起来努力。',
          conclusion: '一张名片：弗雷迪·莱利，为您的生意和成功竭诚服务。'
        },
        {
          role: '律师',
          id: '5',
          title: '命运',
          content: '我深深地感到，我们的相遇是上天的安排。',
          conclusion: '一封信：弗雷迪·莱利写给玛莎·贝克的情书，看起来这位陷入爱河的律师在谋划着什么。'
        },
        {
          role: '律师',
          id: '6',
          title: '引狼入室',
          content: '邀请一位你并不了解的客人是件冒险的事情，我会记住这一点的。',
          conclusion: '一封信：里奥·贝克与玛莎·贝克邀请弗雷迪参加丽莎于1877年12月21日举办的周岁派对。'
        },
        {
          role: '律师',
          id: '7',
          title: '隐秘的妒火',
          content: '他应该从这里消失，或者说，不要出现在我面前。',
          conclusion: '一张合照：照片中是一个三口之家，有人故意剪坏了这张照片，看不到照片中的爸爸。'
        },
        {
          role: '律师',
          id: '8',
          title: '虚情假意',
          content: '伸出援手并不是出于兄弟情义，而是为了攫取更大的利益。',
          conclusion: '一篇报道：上面写着负债超过四位数的军工厂觅得新主。'
        },
        {
          role: '律师',
          id: '9',
          title: '完美计谋',
          content: '他真是个蠢蛋，一切都在我掌握之中。',
          conclusion: '一篇报道：军工厂失火，新任厂长于大火中失踪。'
        },
        {
          role: '律师',
          id: '10',
          title: '逃之夭夭',
          content: '我终于……成功了。',
          conclusion: '一张合照：弗雷迪·莱利·和玛莎·贝克亲密地靠在一起。她手上拿着新娘的捧花。'
        }
      ],
      letterCN: [
        {
          role: '律师',
          id: 1,
          year: '2020',
          title: '一封分手信',
          letter: '亲爱的弗雷迪：\n当你看到这封信时，我应该已经离开了。\n我知道你也许会感到困惑，但看看那份报纸吧。\n不，实际上，可能你对新闻中发生的事了如指掌。\n那该死的收购，毁了一切。\n还记得离开白沙街的前一晚吗？\n我问你，密涅瓦是一个好的投资计划吗？\n那是唯一一次， 我要求你百分百的诚实。\n你回答我，如果投资人拥有充足的经验与资本，这将为他带来巨额的财富。\n可看看新闻里说了什么吧！\n“这位可怜的投资者购入了一间负债超过四位数的工厂”。\n是的，里奥并不聪明，没什么投资经验，更别说资本了。\n可就算是没脑子的人都知道，不要花钱去承担额外的债务。\n我知道你会有什么反应。\n所以我不会留下来听你讲那些漂亮话。\n丽莎，我的女儿，我不会让她一个人呆在孤儿院里。\n至于未出世的安纳西，我会给她起一个新名字。\n别替我们担心将来的生活会怎样。\n安纳西会和丽莎一块长大，成为一个诚实的人。\n弗雷迪，没人能完全逃避责任。\n我们都需要为做过的事付出代价。\n\n玛莎·雷明顿'
        },
        {
          role: '律师',
          id: 2,
          year: '2021',
          title: '一封诊断回函',
          letter: '尊敬的莱利先生：\n上周我与尊夫人进行了3小时左右的谈话，从心理学角度判断，她只是轻度焦虑，这种现象，在怀孕之初很常见，您无需过度担心，充足的休息和适当的辅助药物可以极大缓解这种症状。\n辅助药物我已随信奉上，请按照药品说明服用。\n另外，尊夫人下次复诊时，若您能一同前来与我商讨一下关于上次提及的投资“那所医院”的事宜，我将不甚感激。\n梅斯默医生'
        },
        {
          role: '律师',
          id: 3,
          year: '2022',
          title: '弗雷迪·莱利一页实验档案',
          letter: '编号：4-0-3\n姓名：弗雷迪·莱利\n\n【测试标记】\n1、谎言\n2、爱人\n3、不择手段\n\n【测试倾向】\n攫取利益的“场面人”\n\n【测试结果】\n1、整体评价：\n从各个方面而言，4-0-3都是一个非常标准的实验对象，虚伪、残忍、高傲、好高骛远，野心打造的培养皿让这些劣根性在他身上以最典型的方式呈现，而报复心则变成了比药物更好的催化剂。\n\n2、流程说明:\n 实验准备阶段，4-0-3对4-0-2表现出强烈敌意，也对4-1-1和4-0-4表现出不同程度的警戒心。对其他实验对象都主观保持一定距离。\n直到4-0-2与他的爆发冲突，暴露了他过于强烈的报复心。触发了风险性较高的惩罚执行人，不过因为暂时没有更合适的实验对象可递补，在这轮实验中，并没有对4-0-3进行根除性惩罚。\n实验第二阶段，参考第一阶段新收集的信息，对4-0-3进行了诱导，让他提前接收到了本次实验为他设置的关键信息。4-0-3的敌视对象从4-0-2变为4-0-4。在这一阶段，他针对4-0-4的行为较第一阶段更谨慎且具目的性，但这种行为特征仅限于行动对象是4-0-4时，这使他忽略了更致命的潜在威胁。\n\n3、实验总结：\n4-0-2的实际到达时间与预期稍有不符，这一定程度上影响到了4-0-3和4-0-4的药物使用序列，在实验流程中造成了一定麻烦，但至少目前看来对实验结果本身并没有造成太大影响。\n但考虑到之后实验的多样性，这种风险还需要进一步避免， 在实验环境足够稳定前，不要盲目使用药物。\n而且本次实验也证明，某些实验结论的验证，并不一定需要药物介入。\n单就4-0-3而言，早期，他所有的行为目的，都源自阶级优越感和追逐最大化攫取利益的人性本质，这些更具社会性的行为动机即便是负面的，但实际上却为他在实验预设的环境中创造了一个区别于其他实验对象的安全区。\n直到更个体性的动机来源——爱占据主导，基于这种正面本质滋生的负面行为动机——复仇，在对标的物造成更大伤害的同时，也破坏了他自身的防御外壳，使4-0-3屏蔽了自身针对标的物以外的警戒视角，彻底暴露在了真正的危险之中。'
        },
        {
          role: '律师',
          id: 4,
          year: '2023',
          title: '一封遗嘱',
          letter: '遗嘱人：\n姓名：弗莱迪.莱利\n年龄：38岁\n我立此遗嘱，对我名下所有财产，作如下处理：\n名下所有现金存款，全数遗留交予凯恩.莱利先生由其自行处理。\n其余所持债券、动产及不动产，除位于密涅瓦附近的公寓外，都委托基奥-巴利尔律师事务所进行拍卖。拍卖所得，用以偿还我个人名下债务。\n位于密涅瓦附近的公寓继续作为抵偿悬赏，寻找失踪女性——（被涂掉，依稀看清首字母是L）\n本遗嘱一式两份，一份由我收执，一份交由委托执行人基奥-巴利尔律师事务所保存。\n此遗嘱若6个月内未由我本人撤回，既视为即时生效。\n自书立遗嘱人签名：弗莱迪.莱利\n见证人签名：（被涂掉）'
        },
        {
          role: '律师',
          id: 5,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

