<template>
  <div>
    <h5>大副</h5>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '大副',
          type: '传闻',
          text: '为了寻找亲人的下落，挽回家族的名誉，海上骑士何塞·巴登决定踏入欧利蒂丝庄园这块被诅咒之地，这次，那块神奇的怀表，还能庇佑他一帆风顺么？'
        },
        {
          role: '大副',
          type: '故事背景',
          text: '何塞.巴登大副与船长父亲一起为英王的海上帝国保驾护航，然而，有一天因事担搁在利物浦的巴登没有随父出海，日落之时他在港口等待父亲，但那一班为英王运送古董的航船却没有按时返航。不久何塞收到消息，那艘失踪航船的货物清单上有把来自中国的古董伞，现在它出现在一个叫欧利蒂斯庄园的地方。曾经的海上骑士决定亲自踏进这块被诅咒之地，寻找父亲的下落，或至少……夺回属于自己的东西。'
        }
      ],
      deductionCN: [
        {
          role: '大副',
          id: 1,
          title: '日落之时',
          content: '三，二，一……祝你好梦。',
          conclusion: '一篇航海日志：我们拥有了新的身份，新的旗帜，新的航线，一切都很顺利，或者说比想象的更加顺利。'
        },
        {
          role: '大副',
          id: 2,
          title: '航标',
          content: '不要迷失航线。',
          conclusion: '一张海图：详细标注了多个皇家口岸之间适用于各种船只的航线，其中有一片区域上有危险和不建议通行的标注。'
        },
        {
          role: '大副',
          id: 3,
          title: '风暴',
          content: '麻烦总是不期而遇。',
          conclusion: '一篇日记：我们遇上了风暴，但这是一次无法无法延期的航程，父亲决定调转航线，我们知道那里很危险，但我们是最英勇的海上骑士，不是么？'
        },
        {
          role: '大副',
          id: '4',
          title: '海草',
          content: '视线之外，是恶魔的触角。',
          conclusion: '一则新闻：尽管损失了大部分船员，但历经了两个月的奋斗，巴登家族冲出了海上坟场，击败了劫掠的海盗，保护了陛下的财富，终于返航了。'
        },
        {
          role: '大副',
          id: '5',
          title: '救赎',
          content: '神明无法宽恕的罪恶，国王可以。',
          conclusion: '委任调整：自今日起，巴登家族不仅将为国王的运输护航，同时也将开始为王室执行“特殊任务”。'
        },
        {
          role: '大副',
          id: '6',
          title: '假寐',
          content: '安眠不是唯一的逃避方式。',
          conclusion: '一张诊断说明：巴登子爵的惊梦症日趋严重，我们尝试了各种药物都无明显效果，子爵只能借助大量酒精入睡，长此以往，他恐怕将不再适合出航。'
        },
        {
          role: '大副',
          id: '7',
          title: '牺牲',
          content: '“英勇”总是代价高昂。',
          conclusion: '一篇日记：那里没有海盗，也没有风暴，只有我们的良知和同伴，那片噩梦般的海域带走了他们，却把流淌于巴登家族血脉中的恶魔唤醒。'
        },
        {
          role: '大副',
          id: '8',
          title: '药',
          content: '忘却是最好的疗伤灵药。',
          conclusion: '一封被撕碎的信纸：我不需要我的儿子记得如何当一个好人，我只需要他带我们走出每一片海沙和暗礁。'
        },
        {
          role: '大副',
          id: '9',
          title: '海图',
          content: '无法前行，就原路返航。',
          conclusion: '一张海图：航线有大量被修正的痕迹，修正者的署名是何塞·巴登。'
        },
        {
          role: '大副',
          id: '10',
          title: '月升之时',
          content: '三，二，一……醒来吧。',
          conclusion: '一张处罚令：何塞·巴登大副因酗酒多次登船失期，如若再犯，将剥夺其职位和头衔。'
        }
      ],
      letterCN: [
        {
          role: '大副',
          id: 1,
          year: '2020',
          title: '一篇航海日志',
          letter: '9月24日 天气:多云\n因为巴登子爵错过了登船的最后时间，这次航程中，我将代替他履行帕耳塞洛珀号的航行当值记录。\n这次航行的目的地并非此前商贸航线的港口，而是一个位于地中海东北角上的坐标。此前我们从未前往过那片海域，因此，为了保险起见，船上除了航行所需的必需品外，并未装载其他货物，而是装备了足以让我们应对任何敌人的枪械与火炮，但希望我们没有用上的机会。\n国王万岁\n…………\n一行扭曲的字迹:火炮无法杀死它们…'
        },
        {
          role: '大副',
          id: 2,
          year: '2021',
          title: '最后一页日记',
          letter: '矜贵的少爷有了新的发现。\n驶向胜利的航标在我们各自收到的邀请函里，那个属于我们自己的关键词。\n而属于我的是——Boat。\n这个发现让我想起了一个之前一直忽略的细节，那个关键词奇怪的首字母写法。\n它跟前几天出现在大厅里的手写字条，有些不同，或许我该对这个“附加规则”更警惕一些。\n但不管发出那张纸条的人动机是什么，让不可控的异类退出，对我而言，并无坏处。\n而那个写法我并非第一次看到，父亲那张货物清单的验货人签名栏里，它也曾经出现过。\n那个签名的人，叫作Bourbon。'
        },
        {
          role: '大副',
          id: 3,
          year: '2022',
          title: '何塞·巴登的一页实验档案',
          letter: '编号： 5-0-3\n\n【测试标记】\n1、障眼法\n2、认知博弈\n3、自我审判\n\n【测试倾向】\n自我救赎的“救赎”者\n\n【测试结果】\n1、整体评价:\n当自我认知的偏差威胁到生存时,出于防御目的,实验用例自身会给出一套平衡认知的解法,并使自己相信它,无论真假。\n2、流程说明\n5-0-3曾学习催眠,这让他在实验开始之初短暂地占领了先机。他主观地为整个实验划定了初期阵营,同时暂时找到了最强的盟友。\n但5-0-3作用于其他实验用例的催眠效果短暂而不稳定,而5-0-3对此浑然不知。5-?-1与5-0-2正是利用了这一点,蒙蔽了5-0-3。\n5-?-4出人意料的牺牲行为,让5-0-3摇摆不定的善恶观出现了裂缝,5-?-1和5-0-2抓住这个时机,将5-0-3指认为唯一罪魁,这勾起了5-0-3最痛苦的记忆,陷入自我审判,几乎击溃了他的精神,让他实质上提前出局。\n3、分析总结:\n作为故人的“遗赠”,我非常珍惜对5-0-3的使用,所以在负责监视的行刑者判定其精神即将崩溃时,我本已做好暂时中止对其进行实验的计划。\n但曾经对他进行深度催眠的人显然为他埋下了特殊的精神锚点, 在他已无法对其他实验用例形成威胁、完全暴露于危险之中时, 支撑起了他最后的精神防御, 使他最终完成了所有为他准备的实验流程, 并借助5- 0 - 3 - U的能量再次完成自我催眠, 从自我审判中豁免。\n从此次实验结果中, 仍无法明确判断药物控制与精神控制谁在认知操控上有更强的主导能力, 或许我应该更耐心的等待那个来自我更慷慨的友人的“礼物”。'
        },
        {
          role: '大副',
          id: 4,
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '大副',
          id: 5,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

