<template>
  <div>
    <h5>守墓人</h5>
    <Character :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      descriptionCN: [
        {
          role: '',
          type: '传闻',
          text: ''
        },
        {
          role: '',
          type: '故事背景',
          text: ''
        }
      ],
      deductionCN: [
        {
          role: '守墓人',
          id: '1',
          title: '晚钟',
          content: '晚钟响起，将整个世界留给了黑夜与我。',
          conclusion: '晚钟响起，将整个世界留给了黑夜与我。'
        },
        {
          role: '守墓人',
          id: '2',
          title: '流言',
          content: '比病魔更可怕的……',
          conclusion: '一张搬家通知:……克雷斯太太，很抱歉地通知你，考虑到邻里的意见，我们不能允许您和您的孩子借住在这里，请在三天内搬离……也许您应该考虑放弃这个被诅咒的孩子。房东马歇尔'
        },
        {
          role: '守墓人',
          id: '3',
          title: '手绘画',
          content: '那些尖锐的恶意……',
          conclusion: '一张儿童手绘画:大概能够看出画中一名母亲护着怀中年幼的孩子，周围被涂抹成尖锐的黑色，刺向中心。'
        },
        {
          role: '守墓人',
          id: '4',
          title: '最后的信',
          content: '当我长眠于此，请勿为我哀歌。',
          conclusion: '一封信:亲爱的安德鲁，理解他人如此困难，以至于流言和恶意成了世人对付异已者的武器。也许寻求自我的救赎，比改变他人来得容易……请勿为我的离开哭泣.死亡将人分开.但死亡终将使人相逢。'
        },
        {
          role: '守墓人',
          id: '5',
          title: '天堂来信',
          content: '预定一个好位子吧，通往天堂的列车也有一等座。',
          conclusion: '小册子:拉兹墓园，被世人称为是人间通往天堂的圣殿。长眠于此之人将得到祝福，墓园中的鸢尾将携着善良的灵魂飞往天堂……'
        },
        {
          role: '守墓人',
          id: '6',
          title: '救赎',
          content: '救赎从来不易。',
          conclusion: '“想要长眠此地，除了善行，还需要付出一点‘诚意’。我想你应该能明白，救赎从来不易。”'
        },
        {
          role: '守墓人',
          id: '7',
          title: '命运之门',
          content: '命运总在不经意间开启一扇大门，可门的另—面又会是什么……',
          conclusion: '一则不完整的地下广告:一场谋求学术进步、且报酬丰厚的交易……要求尽可能完整、尚有医学价值、未完全腐烂……'
        },
        {
          role: '守墓人',
          id: '8',
          title: '一念之间',
          content: '我不该再犹豫……',
          conclusion: '一篇日记:我想我不该如此犹豫，善者葬于圣殿，恶者本就不属于这里……'
        },
        {
          role: '守墓人',
          id: '9',
          title: '刺耳的声音',
          content: '有时候谎言总比真相容易接受。',
          conclusion: '一篇日记:墓园东角，那微弱的刺耳声音……不，不，一定是路过的猫发出的声音。马歇尔先生已经……'
        },
        {
          role: '守墓人',
          id: '10',
          title: '交易',
          content: '一场不为人知的交易。',
          conclusion: '一张照片:深夜，医院外科解剖室，一名医生拍摄自己的学术研究……照片角落中有一个不起眼瘦弱身影，手上拿着铁铲和一袋金币……'
        },
        {
          role: '守墓人',
          id: '11',
          title: '败露',
          content: '这该死的光，照亮了罪恶的秘密。',
          conclusion: '一份秘密调查报告:拉兹墓园遗失多具骸骨，棺木均有被打开过的痕迹。其中墓园东角的一具棺木盖板反面有几道指甲划过的抓痕……守墓人安德鲁·克雷斯以及巡夜人从墓园失踪。'
        }
      ],
      letterCN: [
        {
          role: '守墓人',
          id: 'I',
          year: '2022',
          title: '一封无署名的打印信',
          letter: '尊敬的克雷斯先生:\n又一次合作愉快。\n昨晚依旧是个忙碌的夜晚，不知你回家后是否有个好梦？\n这批“石板”有些“松软”，甚至过于松软了。\n——检验结果告诉我，“它们”晚于你所记录的“石板”出产时间。\n虽然博士并不在意，他只想试验顺利进行，但我不得不慎重一些，我是说，你知道的，昨晚的交易与以往任何一晚都不同，暴露之后的惩罚会严厉得多，不是花钱就能解决的。\n我们当然可以帮你处理掉这批“石板”，但这意味着，我们的合作性质将发生改变，不再是单纯的利益关系，而是更强绑定更亲密的关系。你明白我的意思，克雷斯先生。\n最后，为了你我双方都好，我建议你暂时离开这个地方，信封里额外的报酬算是本人的一点心意。如果你不知道去哪，可以拆开最下面的封袋，里面有一张车票，背面标注的地点是我一位老朋友废弃多年的住宅，我想他不介意借你躲一躲。那么，再见克雷斯先生。\n你我这段时间就不用联系了。\n\n祝好\nM.S'
        },
        {
          role: '守墓人',
          id: 'II',
          year: '2023',
          title: '安德鲁的庄园日记',
          letter: '到达老宅的第三周：\n生活再次恢复了平静，因阳光直射而被灼烧的皮肤也已痊愈。\n在我走投无路之时，宅子的主人提供了避难所，并完美地履行了承诺——\n没有冗杂的工作和恼人的噪音，圣洁的引路人只需将时不时出现在宅子附近的多块“石板”处理殆尽——\n与圣殿中的工作略有不同，这些“石板”多数残缺，似乎经历过来自高处的坠落和撞击。\n虽未收到明确的指令，但这或许是我能够表达感谢的唯一方式了……\n然而，每当我为新的“石板”制作墓碑，那句话便再次出现在眼前：\n“安德鲁·克雷斯，鸢尾凋零，长眠于下。”\n 留存在石碑上的墓志铭，在我心中千百遍地镌刻，令我无时无刻不想回到那个地方。\n真的没有机会了吗……\n“石板”如期而至，但伴随而来的，还有一封新的邀请函。\n细沙正在缓缓流逝，但我不该再犹豫了……\n或许……这是我回到圣殿的唯一方式。'
        },
        {
          role: '守墓人',
          id: 'III',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '守墓人',
          id: 'IV',
          year: '2025',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '守墓人',
          id: 'V',
          year: '2026',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

