<template>
  <div>
    <h5>孽蜥</h5>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '孽蜥',
          type: '传闻',
          text: '卢基诺对禁忌领域的过分深入为自己带来了巨大的麻烦，日复一日，那些鳞片怎么都剥不完。'
        },
        {
          role: '孽蜥',
          type: '故事背景',
          text: '卢基诺·迪鲁西曾是一位出色的学者，醉心于研究爬行类生物。从同僚手中获得一条罕见的毒蛇后，卢基诺永远地消失了。人们在他的居室里发现了满地沾血的鳞片，奇怪的是，这些巨大的绿色鳞片表面粗糙，异常坚硬，看起来并不属于任何一种已知的爬行类生物。'
        }
      ],
      deductionCN: [
        {
          role: '孽蜥',
          id: '1',
          title: '研究',
          content: '是什么推动我们去进行研究?贪婪，对知识的贪婪',
          conclusion: '日记1:我们会从这个世界中感受到什么，决定了我们是谁。而我从这个世界感受的，是未知。人们难道不会因为那些晦涩不明的信息，若有若无的暗示而感到不安吗?如果一个问题无法得到圆满解答，它将在我脑子里不断地“作祟”。'
        },
        {
          role: '孽蜥',
          id: '2',
          title: '毒液',
          content: '什么工作不会存在风险呢?只要回报值得',
          conclusion: '文档1:珠毒蜥，体长57-91厘米，鳞片很小，外观类似珠子。除腹部外，大部分鳞片上都覆盖着骨质真皮。毒液可致大鼠呼吸衰竭，但对人类效力有限，叮咬区域局部水肿，疼痛持续时间可达24小时，并伴有出汗和血压下降。此品种尾部旦断裂便不能再生。'
        },
        {
          role: '孽蜥',
          id: '3',
          title: '社交',
          content: '这是工作带来的副产品之一',
          conclusion: '日记2:杜凯因·汤普森博土把他真正的想法藏得很好，但时间会说明一切。也许是因为我让他的“媒人”事业受挫，又或者，是汤普森博士的价值观起了作用:“如果一个人无法被拉拢，那他就是潜在的敌人”。'
        },
        {
          role: '孽蜥',
          id: '4',
          title: '浅尝辄止',
          content: '剂量的重要性常常在诡辩中被忽视',
          conclusion: '文档2:三色箭毒蛙，体长1.6-2.7厘米，具有宽阔的头部与截短的鼻子，皮肤光滑。第一根手指比第二根手指长，所有手指部分呈蹼状。背面通常是绿色或黄色，并有纵条纹。毒液镇痛效果优于吗啡。'
        },
        {
          role: '孽蜥',
          id: '5',
          title: '捷径',
          content: '钱可以买到一切吗？',
          conclusion: '日记3:杜凯因·汤普森博士的告示为他带来了大量研究素材，对他的新课题拭目以待。但愿他不会又把这些素材变成新的“展览品”'
        },
        {
          role: '孽蜥',
          id: '6',
          title: '困境',
          content: '用有限的人生追求无限的知识，注定会失败',
          conclusion: '文档3:希拉毒蜥，体长30- 60厘米，鳞片类似珠毒蜥，色块面积更大，色彩更丰富，尾部粗壮，断尾后不能再生。毒液可使人四肢麻痹，呕吐，并随后陷入昏睡，即时获得治疗后不存在致命风险。较大的撕裂伤口会引起炎症和极度疼痛。'
        },
        {
          role: '孽蜥',
          id: '7',
          title: '小人物',
          content: '我们总是容易忽视那些不起眼的人',
          conclusion: '日记4:实验室的清洁工向我提起了一种奇怪的蛇，他宣称这种蛇可以在十几天内长出四肢。听起来很像乡野莽夫的疯言疯语，但我很快意识到这个人是认真的。我建议他戴上手套或用其他工具抓住那只“蛇”，也许我们能够共同发现一种新的生物。'
        },
        {
          role: '孽蜥',
          id: '8',
          title: '诱惑',
          content: '即使明知是陷阱，仍然一往无前',
          conclusion: '日记5:汤普森博士发起了一项我无法拒绝的提议，共同研究那只品种不明的蜥蜴?又或者是蛇。总之，这意味着我将有机会确立新的种属。听起来有些太好了，但谁能对这样的诱惑说不呢?'
        },
        {
          role: '孽蜥',
          id: '9',
          title: '陷阱',
          content: '最好的陷阱是让人心甘情愿地踏进去',
          conclusion: '文档4:该生物具备完整的前肢，后肢未完全发育，头颅双侧均无外耳孔。全身覆盖灰褐色方形鳞片，腹部鳞片尺寸较背鳞稍大。眼睑可开合，伴有瞬膜。已检查口腔，上颌前部存在中空尖牙，毒液疑似无效，大鼠无异常表现。'
        },
        {
          role: '孽蜥',
          id: '10',
          title: '界限',
          content: '只有当我们跨越时，界限才会变得清晰',
          conclusion: '日记6:伤口开始变得干燥，粗糙，没有疼痛感。我的体力变得更好，嗅觉变得更灵敏，过去留下的伤疤也在淡化。与希拉毒蜥和珠毒蜥截然不同，这种生物的毒液也许能够改变世界!我应该加快实验速度。'
        }
      ],
      letterCN: [
        {
          role: '孽蜥',
          id: 'I',
          year: '2020',
          title: '湖景村调查报告',
          letter: '尊敬的吉尔曼小姐:\n正如您上次回信中所谈到的那样，我们对沃尔克在湖景村的寄宿家庭进行了深入调查，并持续关注着沃尔克家人的动向。\n在这个过程中我们发现，沃尔克的兄弟，达伦，一位大学实验室的清洁人员，他所任职的实验室内有位教授神秘失踪。警察在这位教授的书房中发现了奇怪的巨大鳞片，通过一些内部消息，我们了解到这些鳞片与我们的调查员在湖景村当地林场内找到的鳞片非常相似。\n而更让我们感到不安的是，达伦在上个月也突然销声匿迹，甚至扔下了自己病重的母亲。\n这一系列失踪事件均与湖景村相关，我们的调查员认为其中可能牵涉到一些有组织犯罪。出于对员工人身安全的考虑，我不得不非常遗憾地通知您，调查将无法继续进行。您此前支付的相应款项将在本周内退还。\n\n祝安\n您忠诚的\n亚瑟·罗素'
        },
        {
          role: '孽蜥',
          id: 'II',
          year: '2021',
          title: '一篇日记',
          letter: '当我真实地与他们相见后，他们的身影终于变得明晰。那位先生名为卢基诺·迪鲁西——他比我预见的更和善、友好。初到时我在餐厅里遇见了他，他穿着一件洗得快褪色的白衬衣，头上贴着绷带，正阅读桌上写着房间和姓名的名片。他是那么彬彬有礼，甚至并未像常人那样大呼小叫地对我肩上的鸮产生好奇，只是礼貌地问好，为我指引房间。\n另一位名叫黛米·波本的女士在下午到达了庄园。晚餐时，餐桌上气氛很好，波本小姐很健谈。迪鲁西先生话不多，但也会在沉默的间隙回答、应和我们。他介绍说自己是一名研究者，为了收集资料来到这里。\n我隐约看到迪鲁西先生的衣领下有些鳞片似的碎屑和怪异的伤痕，他察觉了我目光，笑着解释那是研究留下的“礼物”。他稳重而严谨，的确具有研究者的气质，我难以想象是什么样的经历让他受到如此怪异的影响。我又想起曾经看到的结局，奇怪，我在那悲剧的结尾并不能看清迪鲁西先生的影子……\n关于未来的景象里还有第四人，也许，明天我们可以在愉悦的气氛中等待她的到来。'
        },
        {
          role: '孽蜥',
          id: 'III',
          year: '2022',
          title: '卢基诺·迪鲁西的实验报告',
          letter: '编号：6-1-4\n姓名：卢基诺·迪鲁西\n\n【测试标记】\n1、警觉性\n2、适度的求知欲\n\n【测试倾向】\n怀揣戒心的探寻者，本组唯一存在的实验对象\n\n【测试结果】\n1、整体评价：\n对于未知，6-1-4可以自我把握探寻的尺度。也许正因其可控的好奇心，他是本组中唯一一位“存在”的参与者。\n\n2、流程说明：\n第6组实验过程中，6-1-4全程拥有十足的警觉性。即使在6-0-5献祭、局面已经完全混乱后，也能清醒地与危险保持距离。\n在实验的善后处理过程中，发生了预料之外的状况：实验结束的第一晚起，6-1-1于处理室中消失，在地面留下一片水渍；次日6-1-3消失，同样仅留下深色的积水。同组除6-1-4外的其余五人，皆在其后三日内接连消失，其中包括已确认丧生的参与者的遗体。\n目前仍未知五名参与者消失的原因，但经过检验，留下的水渍与本组实验场地中的湖水成分高度相似。\n\n3、实验总结\n第六组消失的五人，无论从生命体征的意义，还是从现实肉体的意义上，都已经不复存在。而比起“消失”，我更愿意称他们为“被抹除了存在的证明”。在层层监管下，化为了一滩潮湿阴冷的水渍。\n6-1-4是唯一被留下的观察对象，这也许正因他对未知的适度好奇，未知也适度地“关照”了他。与他曾经被爬虫咬伤的经历对比，我认为他在过去的经历中至少学到了保持适当敬畏和警惕。\n在先前收集的资料中，那些愚昧的渔民对湖中“未知的存在”言之凿凿。如今我也见识到相似的怪象，但也许我有机会进行观察和实验，用更严谨的原理进行解释。\n五人的消失使本组实验不再具有太多意义，因此本组档案已经封存（或考虑废除）。可以重新开启“第六组”，再次向湖景村实验场地投入卢基诺·迪鲁西，以及其他与本组相似的“独特而危险”的实验对象。\n新的第六组能否得出与本组相似的结果？是否能重现此次的有趣情境？人们向来对未知恐惧，但在那些神秘的现象中寻求规律，也正是实验中令人激动的部分。'
        },
        {
          role: '孽蜥',
          id: 'IV',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '孽蜥',
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

