<template>
  <div style="padding:8px;">
    <h5>机械师</h5>
    <el-collapse v-model="activeNames">
      <el-collapse-item title="角色日信件" name="1">
        <el-row>
          <el-col :span="24">
            <el-table :data="letterCN" style="width: 100%">
              <el-table-column type="expand">
                <template slot-scope="props">
                  <el-form label-position="left" inline class="demo-table-expand">
                    <el-form-item>
                      <v-html contenteditable="true">{{ props.row.letter }}</v-html>
                    </el-form-item>
                  </el-form>
                </template>
              </el-table-column>
              <el-table-column label="NO" prop="id" />
              <el-table-column label="年份" prop="year" />
              <el-table-column label="标题" prop="title" />
            </el-table>
          </el-col>
        </el-row>
      </el-collapse-item>
    </el-collapse>
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      letterCN: [
        {
          id: 'I',
          year: '2020',
          title: '一张订购回执',
          letter: '尊敬的列兹尼克小姐：\n您好！\n很高兴再次收到您的订购单，订购单中绝大多数商品我们已经为您准备妥当，只有其中一件关节接驳的元件，很遗憾，我们目前批量生产的商品并无法达到您对灵活度的要求。\n不过我们可以为您推荐一位这类结构元件制作的专家，他的才华毋庸置疑，但脾气略微古怪，并不接受对完成品的反复修改，考虑到这类元件定制价格昂贵，我们建议您亲自前往他的所在地面对面沟通定制事宜。\n他的地址是：\n（信件的下半页被撕去了）'
        },
        {
          id: 'II',
          year: '2021',
          title: '庄园日记第四页',
          letter: '下午的时候，又有一个人来到了庄园。\n他看起来受过不错的教育，不过那一身装束，已足够昭示他绝非善类。\n最初，我们只是彼此间简单地打了个招呼，就各忙各的了。但在我准备将墙上已经坏掉的时钟拆卸下来时，他突然出现在我身后，向我询问时间，我告诉他现在是下午三点二十一分。\n我转身的时候看见他正若有所思地看着我，我告诉他，我是一名钟表师傅，发明过许多钟表零件，其中有一些可以用来修好这个钟。\n而钟不继续运转的原因有两个，一是没有电池了，二是需要重新上链。\n这似乎引起了他的兴趣，他开始喃喃自语了起来，“电池……上链……”，像是在重复我的话，但语气很是不屑。\n我询问他缘由，他说，他觉得制作出延长设备寿命的零件不应该用“发明”一词。\n而且，有比俗套的伏打电堆和振荡球更一劳永逸的方法。\n我知道他说的是什么，但那太过荒谬。\n在我的认知里，要让钟表自主运转且误差保持在有效容差内，这要么是最伟大的革新，要么是最天真的幻想。\n相较于天方夜谭的永动概念，我更倾向于从能量守恒的角度来寻求答案，比如热量的转换？\n或许等我离开这座庄园后，可以尝试看看。\n说到这座庄园，经过两天“探索”，我基本已经确定，这里有一个有趣的“人”存在，这个“人”及其所有者，都值得进一步调查。\n另外，今天在我用玩偶跟踪那个“人”时，我发现，下午那个“天真”的家伙，也在暗处。'
        },
        {
          id: 'III',
          year: '2022',
          title: '特蕾西·列兹尼克的一页实验档案',
          letter: '编号：10-0-1号\n姓名：特蕾西·列兹尼克（名字有被涂改的痕迹）\n\n【测试标记】\n1、高智商\n2、最优秀的学生（标记有被涂改的痕迹）\n3、缺陷测试\n\n【测试倾向】\n组件缺失的“精密仪器”\n\n【测试结果】\n1、整体评价：过人的头脑、敏锐的观察力以及出类拔萃的动手能力，让10-0-1像最优秀的学生一般，在实验过程中完成了为她所设置的试题的每一个解答步骤，但因为关键信息的缺失，她并未在有效时间内，得出正确答案。\n2、流程说明：\n作为递补者，10-0-1实验开始之初，就展现出了远超之前实验用例的高智商和观察能力，为了确保实验的顺利进行，不得不提前派出行刑者介入观测。\n但是这种预防性质的观测，因为10-0-2的到来和行刑者主观意识的变化，最终升级成为了行为干预。\n迄今为止，漫长的实验过程中，第一次出现了挑战游戏规则的实验用例和几乎契合完美的合作者。\n10-0-1对自己认知清晰，在获得“最后的组件”10-0-2的协助后更是变得极度自信，期望在胜利的同时，最大程度地攫取额外奖励，虽然最终结果并未如她所愿，但整个实验过程中，她确实出色地扮演了进程引导者的角色，对久违的胜利者的诞生起到了催化作用。\n3、分析总结：\n在前一个实验用例失效后，我接受建议启用了新的10-0-1，因为药物实验已经进入了相对稳定的阶段，此次实验的主要目的是对实验整体的运行机制进行风险查验。\n因为10-0-1的出色“表现”，机制风险暴露无遗，不过这类风险在加入药物影响后，是否仍会存在如此大的威胁性，需要在下一组实验中进行进一步验证。\n值得注意的是，整个实验过程中，10-0-1对实验内容的掌握程度稍稍超出我的预期，目前还无法判断这种现象的产生，是因为本组实验者本身特质造成，还是实验内部出现了不可控因素，抑或是此前早期实验组的遗留影响。\n不管是哪种原因，为了保险起见，在将来的实验中，无论实验结果如何，都应及时完成对实验用例的后续处理。'
        },
        {
          id: 'IV',
          year: '2023',
          title: '一封遗嘱',
          letter: '遗嘱人：\n姓名：弗莱迪.莱利\n年龄：38岁\n我立此遗嘱，对我名下所有财产，作如下处理：\n名下所有现金存款，全数遗留交予凯恩.莱利先生由其自行处理。\n其余所持债券、动产及不动产，除位于密涅瓦附近的公寓外，都委托基奥-巴利尔律师事务所进行拍卖。拍卖所得，用以偿还我个人名下债务。\n位于密涅瓦附近的公寓继续作为抵偿悬赏，寻找失踪女性——（被涂掉，依稀看清首字母是L）\n本遗嘱一式两份，一份由我收执，一份交由委托执行人基奥-巴利尔律师事务所保存。\n此遗嘱若6个月内未由我本人撤回，既视为即时生效。\n自书立遗嘱人签名：弗莱迪.莱利\n见证人签名：（被涂掉）'
        },
        {
          id: 'V',
          year: '2024',
          title: 'Coming Soon',
          letter: 'Coming Soon'
        }
      ]
    }
  }
}
</script>

<style>
.demo-table-expand {
    font-size: 0;
}

.demo-table-expand .el-form-item {
    margin-right: 0;
    margin-bottom: 0;
    width: 100%;
    white-space: pre-wrap;
}
</style>
