<template>
  <div>
    <h5>蜘蛛</h5>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '蜘蛛',
          type: '传闻',
          text: '出色的演员永远不会过气，瓦尔莱塔的最新节目——神奇蜘蛛秀正在上演！\n当然，我们诚挚建议您不要近距离观看。'
        },
        {
          role: '蜘蛛',
          type: '故事背景',
          text: '瓦尔莱塔曾是个出名的滑稽戏演员，在观众失去兴趣后，沦落到三流马戏团表演。她想要重新站上舞台，再次成为万众瞩目的大明星。在一位机械师帮助下，瓦尔莱塔装上灵活的机械义肢和精巧的机关装置。创造出新表演项目—人形蜘蛛秀。老东家拒绝了她的演出，但瓦尔莱塔没有气馁。她接受了一份演出邀请，并准备在欧利蒂丝庄园举行自己的复出秀。但很显然，出于人身安全的考虑，任何观众都不应近距离观看。'
        }
      ],
      deductionCN: [
        {
          role: '蜘蛛',
          id: 1,
          title: '价值',
          content: '甲之蜜糖，乙之砒霜。',
          conclusion: '照片：装着婴儿的手提篮被丢在演出座椅下面。'
        },
        {
          role: '蜘蛛',
          id: 2,
          title: '珍宝',
          content: '他们错了，这是无价之宝!',
          conclusion: '人们会花大价钱买票，就算只是看她用四个肉球一样的手臂在地上磨蹭。'
        },
        {
          role: '蜘蛛',
          id: 3,
          title: '家人',
          content: '无论否认多少次，你仍然是我的“父亲”。',
          conclusion: '照片：没有四肢的女孩亲昵地依偎在戴着礼帽的男人怀中。'
        },
        {
          role: '蜘蛛',
          id: '4',
          title: '惊奇小屋',
          content: '麦克斯说，这里是我的家。',
          conclusion: '海报：只需5又3/4便士即可入场，欣赏这神奇的生物，企鹅与人的混合体!只在麦克斯的惊奇小屋!'
        },
        {
          role: '蜘蛛',
          id: '5',
          title: '人气明星',
          content: '那是什么东西?看起来有点……恶心。',
          conclusion: '照片：人们在惊奇小屋外排起了长队，戴着礼帽的男人兴奋地数着钱。'
        },
        {
          role: '蜘蛛',
          id: '6',
          title: '他的最爱',
          content: '麦克斯说，钱是买不来真心，可真心也换不了钱。',
          conclusion: '可钱能让你开心，对吗?'
        },
        {
          role: '蜘蛛',
          id: '7',
          title: '习以为常',
          content: '观众是薄情的。',
          conclusion: '除了跳来跳去和缝补破布之外，她还会别的吗?真无聊。'
        },
        {
          role: '蜘蛛',
          id: '8',
          title: '力所不及',
          content: '这曾是她的优势，也是现在最大的劣势。',
          conclusion: '照片：没有四肢的女孩又一次从红色皮球上摔下来，身上瘀痕累累。'
        },
        {
          role: '蜘蛛',
          id: '9',
          title: '倾其所有',
          content: '这是我唯一拥有的，可笑而悲惨的表演。',
          conclusion: '只要再给我一点时间练习，麦克斯，我会再次成为你的明星。'
        },
        {
          role: '蜘蛛',
          id: '10',
          title: '过期',
          content: '你知道商品都有使用期限，对吧?',
          conclusion: '照片：门外一个装着人的笼子被运上马车，戴礼帽的男人数着钱没有抬头。'
        }
      ],
      letterCN: [
        {
          role: '蜘蛛',
          id: 1,
          year: '2020',
          title: '【】敬启',
          letter: '尊敬的【】:\n每一年的第一天，无论是再绝望的人，也总该生出一些希望吧。\n我也是这样想的。\n那天我起得很早，坐在床上等待。\n贝蒂带来了早餐，皮普带来了午餐，克拉拉带来了晚餐。\n“你想出去玩吗?”\n因为这是新年的第一天，每个人都这么问。\n我没有告诉他们我在等什么。\n但显然，每个人都知道答案。\n他们脸上总是有那种微妙的……情绪。我不喜欢那种眼神，和他们看向小猫小狗一样。\n只有麦克斯，他看向我的眼神，和看别人没什么两样。\n我知道他们在背后怎么议论他，麦克斯是传统意义上的好人吗?不是。\n可从他那里，我终于能得到与其他人无异的东西，也许人们觉得不好，但那是我需要的东西。\n当然，那一年的第一天，我没等到他。\n麦克斯在第二天早上回来了，满身酒气。\n“新年快乐!”他丢给我一件深灰色的男士根西衫。\n克拉拉觉得很生气，她认为麦克斯缺乏同情心，丝毫不把我放在心上。\n她永远也想不明白，我需要的究竟是什么。\n无论如何，我不会忘记这一天的。\n不是为了这件“礼物”，也不是为了麦克斯。\n是为了我，终于明白自已需要什么。\n\n新年快乐\n您真诚的\n瓦尔莱塔'
        },
        {
          role: '蜘蛛',
          id: 2,
          year: '2021',
          title: '给旧友的信',
          letter: '亲爱的瓦尔莱塔：\n亲爱的！能收到你的信真的出乎我的意料！\n虽然不知道你说的“喧嚣”马戏团是什么样的地方，但听你说过得好，我们终于能放心了。那些收留你的，想必也是跟我们一样善良的人。\n你走的那天，贝蒂他们非常担心。你努力表演的样子，缝补衣物的样子，笨拙踩着球、好笑地滚动着爬行的样子……我难以想象，除了我们以外，还有谁能接受你。\n今年冬天很冷，你要注意别着凉。你那些改造后的奇怪关节总会生锈发疼，半夜还会发出扰人的响声。不过，你好歹可以四处爬动了。如你所说，你得好好感谢那个帮你改造身体的人，真不知道那人是怎么对着你丑陋又恐怖的肢体下手的。\n对了，我们过得还不错。你还记不记得，以前由于演出节目老套，我们这里总是出现营收问题？大家没有好衣服穿，更别提吃点好东西。但你走后，日子一天比一天好起来，麦克斯前几天甚至请大家喝了葡萄酒，说是犒劳辛苦的演员们……唉，那酒的味道还不错，如果你在这里就更好了。\n又是新的一年，感谢你的新年来信。亲爱的瓦尔莱塔，你也要照顾好自己！你走后，我们可太孤独了。\n就写到这里吧，我还要去准备今晚的晚餐。麦克斯说要跟我聊聊新年表演的节目，我的表演将会是最重要的那个。该死，我真不想参加这东西，麻烦透了。\n\n瓦尔莱塔，祝你新年快乐。\n思念你的，\n芭芭拉'
        },
        {
          role: '蜘蛛',
          id: 3,
          year: '2022',
          title: '瓦尔莱塔的一页实验档案',
          letter: '编号：8-0-1号\n姓名：瓦尔莱塔\n\n【测试标记】\n1、边缘化\n2、盲目的善意\n3、讨好型人格\n\n【测试倾向】\n被希望欺骗的“道具”\n\n【测试结果】\n\n1、整体评价：\n8-0-1号长期被他人排挤，善良的个性使其遭受更严重的迫害。\n\n2、流程说明：\n 对8-0-1号使用药剂在实验计划之外，且药剂未对实验对象行为产生预期影响，因此暂以最终结果为标准进行编号。\n8-0-1号不是此次实验的核心，但她单纯的个性值得进行研究，因此并未计划在8-0-1号身上使用药剂。\n实验过程中，8-0-1号从未对他人的欺压做出反抗。而她为达成目标表现出的顺从，导致了加害者的变本加厉。\n\n3、分析总结：\n8-0-1号的行为模式单纯、目标明确：遵照规则完成任务，企图通过讨好和顺从吸引同盟者。\n先天缺陷和过去的经历造成了8-0-1号的个性：自卑、软弱、面对他人欺压时表现出习惯性的避让。长期被边缘化的8-0-1号渴望重回舞台，得到他人的重视。由于缺少对正向情感的体验，她如抓住救命稻草般对“希望”深信不疑，甚至变得盲目。最终的结果是，她缺少对人类恶意行为的估量，昏睡于那些虚幻的希望之中。\n在这组实验里，8-0-1号处于底层位置。在8-0-1号被8-0-3号伤害后，“和谐”的氛围被打破。兔子的出现正暴露狼群的行踪，以整组视角来看，8-0-1号的受害起到了激化矛盾的作用。\n对8-0-1号的研究并无太高价值，该实验对象也无继续利用的必要。但可以关注实验的副产品——“善”的退场将对“恶”产生怎样的影响？这是个值得推进的研究方向。'
        },
        {
          role: '蜘蛛',
          id: 4,
          year: '2023',
          title: '最后一页日记',
          letter: '我要有新的舞台了，对吗？\n如果真的如那位庄园主所说，我要有新的舞台了，对吗！\n瓦尔莱塔，你终于等到了，他们甚至会再次和你一起同台表演——那个辉煌一时的“喧嚣”马戏团！\n\n他们都不知道，嘉年华开始的前一天，我简直懊悔极了。\n那天无人应邀参加我的排练，我被伯纳德赶出来“冷静几天”。我一个人走在路上，带着那个软塌塌的皮球。\n一个路过的孩子看到了我，问：\n“嘿，你是马戏团的演员吗？”\n还没等我回答，另一个孩子踢了我一下，说：\n“离那东西远点儿，那是个怪物！”\n他们笑着、尖叫着跑开，而我在想，是啊，我失去了舞台，失去了我在“喧嚣”唯一的节目。一切都怪我，我该表演得更出色、更让他们喜欢的。\n后来，我看到火灾的报道，害怕极了——如果马戏团的人都死了，那还有谁能证明我曾是个演员呢？\n\n……无论如何，我都是该感谢庄园主先生的。\n感谢他的剧本，感谢他让我们再次相聚。感谢我即将拥有的、最棒的演出机会——\n我会静静等大家到来，像当年站在“喧嚣”的后台等待时一样。\n\n这次，我一定会让大家排好最棒的剧目，一切也都会像那首信中的童谣写的：\n\n“我们会忘记一切，重获新生。”'
        },
        {
          role: '蜘蛛',
          id: 5,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

