<template>
  <div>
    <h5>咒术师</h5>
    <el-row :gutter="12">
      <Letter :letter="letterCN" />
      <Deduction :deduction="deductionCN" />
    </el-row>
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      deductionCN: [
        {
          id: '1',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '2',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '3',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '4',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '5',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '6',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '7',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '8',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '9',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '10',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        }
      ],
      letterCN: [
        {
          id: 'I',
          year: '2020',
          title: '【】敬启',
          letter: '尊敬的玩家:\n没有人可以决定自已如何来到这个世界。\n玛丽妈妈说，每个婴儿降生时都拥有预见之力，啼哭是对未来苦难的回应。\n随着婴儿长大，这种预见的能力将伴随着出生瞬间的记忆一同消失。那是神的恩赐，好让人类有足够的希望存活。\n如果想要找回那些记忆，会怎么样呢?\n她没有回答。\n但我找到了办法。\n通过力高爸老爹，与另一个知情的灵魂交流——我真正的母亲。\n那个给予我肉身的女人。\n好吧，事情并不怎么顺利。\n事实上，情况糟透了。\n我是一场暴行的罪证，一个可耻的孽子，一份不洁的血统。\n而我的母亲，一个虔诚的雅克世追随者 ，她的愤怒理所应当。\n这让我吃惊吗?并不。新奥尔良的街道上每天都行走着数不清的混血儿。\n这让我伤心吗?也许有那么一点。但我仍然拥有一个令人惊叹的养母，她平等无私地爱我。\n不过这的的确确为我带来了一些后果。\n我需要支付力高爸老爹的报酬，与神明定下的契约是不可违背的。\n我一度非常苦恼要如何找到足量罪孽深重的灵魂。\n当然，现在这个问题已经解决了，我找到了一个丰饶的狩猎场。\n\n祝安\n帕缇夏.多里瓦尔'
        },
        {
          id: 'II',
          year: '2021',
          title: '帕缇夏的庄园日记',
          letter: '第一夜\n力高爸老爹没有回应我。\n这反而是一种启示,对我所行之事的默许——我来对了地方。\n这几个自视甚高的愚人显然无法感悟到力高爸老爹的神通广大。但当他们知道还有方法可以与过往之人相见时,心有所念之人便会讨好我,心有所惧之人则会排挤我。\n但不管用什么借口,披上如何卑劣的伪装,他们最终要面对的都是自己的罪孽。\n妈妈曾说,有些罪孽不分善恶,只是单纯的出自人心:问心有愧,就是自觉有罪。\n但这份日记不会留下任何透露秘密的线索。毕竟,他们的秘密并不属于我。\n履行契约的施咒者只是用尽所有手段,送负罪的灵魂去十字路口接受引路人的指引而已。\n任何人都可以通读这份日记,但最有价值的,只有一个信息：我来了。'
        },
        {
          id: 'III',
          year: '2022',
          title: '帕缇夏·多里瓦尔的一页实验档案',
          letter: '编号：5-?-5号\n姓名：帕缇夏·多里瓦尔\n\n【测试标记】1、固守信仰\n2、刻薄高傲\n3、攻击性\n\n【测试倾向】\n信仰异教的狩猎者\n\n【测试结果】\n1、整体评价：5-?-5号是一位信仰坚定、目的明确、执行力强的异教信仰者。\n\n2、流程说明:\n药剂尚不稳定，故未在本组实验中投入使用。因此，本组实验者的判断和行为是完全由各自的性格、立场所驱使的。而这激发这组矛盾的核心是5-?-5号。\n5-?-5号以献祭“猎物” 来维系与“神明”的约定，并以此为动机加入庄园游戏。然而在游戏过程中，其信仰的神明给予5-?-5号的助益和护佑均无法客观佐证。\n3、分析总结:\n5-?-5号的行为模式并非单纯基于信仰，而是与其自我认同的诉求有关。\n 由于出身不为族人所承认，成长环境中又充满歧视，5-?-5号对自己的身份非常敏感。而“获得神明认可”的期望，成为了她在同族中寻求身份认同的迫切诉求。\n在履行与神明约定的过程中，5-?-5号毫不避讳地将自己摆在了外族人的对立面，并时刻以“猎物”的标准衡量对方的行为。这种高傲刻薄的态度为她引来诸多非议和偏见，导致5-?-5号的自我认知固化为“不受欢迎的人”。这解释了5-?-5号为何未被5-?-4号的善意触动。\n与充满敌意的“狩猎”过程形成鲜明反差的，是5-?-5号决定猎物命运的方式非常天真——无论献祭的技法多么诡谲，评判仪式成败的关键均是“猎物能否在神明面前悔悟”:猎物们必须与自己的过去消解才能摆脱困顿。而5-?-5号却从没有这样的机会，只能直面过去强加在身上的蔑视和偏见。\n从猎物的解脱中获得满足：这是狩猎者独有的“温柔”。\n至于这种信仰是否真的能得到回应，下组实验可在这点上进一步……'
        },
        {
          id: 'IV',
          year: '2023',
          title: '写在衣服碎片上的诡异文字',
          letter: '（涂黑），我愿你陷入幻觉的泥沼，在沉醉中成为通灵的媒介；\n（涂黑），愿你被虚伪的事实蒙蔽双目，在记忆的森林中长眠。\n（涂黑），愿你被鲜血的河流包围，在自我悔悟中完成绝唱。\n（涂黑），愿你在经历毒蛇的撕咬后苏醒，接受洗礼后开启新生。\n（涂黑），佑我勇气，护我平安。当一切归于平静，当邪恶来临，快快屏息，与祷祝之光一同离去。\n（文字周围附有一些血迹和看不懂的符号）'
        },
        {
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

<style>
.demo-table-expand {
    font-size: 0;
}

.demo-table-expand .el-form-item {
    margin-right: 0;
    margin-bottom: 0;
    width: 100%;
    white-space: pre-wrap;
}
</style>
