<template>
  <div>
    <h5>冒险家</h5>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '冒险家',
          type: '传闻',
          text: '他曾驾驶帆船跨越英吉利海峡，乘坐热气球飞越森林，造访过各种奇妙的国度……库特·弗兰克的生活和游记小说一样精彩！'
        },
        {
          role: '冒险家',
          type: '故事背景',
          text: '库特是一位经验丰富的冒险家，他热衷于探索人类的极限，驾驶帆船跨越英吉利海峡，乘坐热气球飞越原始森林，当然，也包括参与一场赌上性命的游戏。作为生存大师，他能够成为最终获胜的那个赢家吗？'
        }
      ],
      deductionCN: [
        {
          role: '冒险家',
          id: 1,
          title: '寻宝',
          content: '嘿，这里就像巨龙的巢穴，也许我能发现一些宝贝？',
          conclusion: '一篇日记：我在一片旷野中行走。然后，看！这是我从巨龙巢穴中找到的……手电筒？我太把那些故事当真了。'
        },
        {
          role: '冒险家',
          id: 2,
          title: '求学之路',
          content: '你应该去上大学，父亲是这样说的。',
          conclusion: '一篇日记：我不喜欢学校。都是些刻薄和势利的家伙。'
        },
        {
          role: '冒险家',
          id: 3,
          title: '俄罗斯轮盘',
          content: '我爱这里，五光十色！每个人都看起来很友好！',
          conclusion: '一张账单：尊敬的库特·弗兰克先生敬启，请于本周五前缴清700英镑欠款，逾期将收取一分月息，并以复利计算。'
        },
        {
          role: '冒险家',
          id: '4',
          title: '谎言的开端',
          content: '我怀念在军营的日子，或者说，我怀念那段时间遇到的人们。',
          conclusion: '一张照片：年轻的冒险家穿着新兵制服，他看起来瘦弱又阴沉。'
        },
        {
          role: '冒险家',
          id: '5',
          title: '治愈人心的故事',
          content: '为什么不把自己看过的故事说出来呢？这样大家都会高兴。',
          conclusion: '一张照片：年轻的冒险家拿着一本游记小说着迷地看着。'
        },
        {
          role: '冒险家',
          id: '6',
          title: '完美的演说',
          content: '每个出名的冒险家都是个厉害的说书人，不然那些传奇是怎么流传出来的？',
          conclusion: '一张照片：穿着军装的冒险家正在眉飞色舞地对其他人讲述着什么。每个人看起来都很投入。'
        },
        {
          role: '冒险家',
          id: '7',
          title: '做个英雄',
          content: '真正的英雄从来不抛弃队友。',
          conclusion: '一篇日记：那些家伙看不起我，觉得我毫无用处。我要证明他们错了。'
        },
        {
          role: '冒险家',
          id: '8',
          title: '自我意识',
          content: '谎言说上一千遍就会成真，至少在自言自语时是这样。',
          conclusion: '一篇日记：那些……是我的经历。我的，“真实”的经历。我是个真正的冒险家。'
        },
        {
          role: '冒险家',
          id: '9',
          title: '拦路的“巨龙”',
          content: '这些巨大的、长着獠牙的……龙！你们不能阻挡冒险家的脚步！',
          conclusion: '实际上，刚才我可能看错了。'
        },
        {
          role: '冒险家',
          id: '10',
          title: '逃避现实',
          content: '认清生活的真相后，你还会继续热爱它吗？',
          conclusion: '一篇日记：我想要离开这里。不管去哪里都好。只要，离开这个学校。'
        },
        {
          role: '冒险家',
          id: '11',
          title: '机智',
          content: '作为冒险家，你得恰当的避开危险。',
          conclusion: '一篇日记：我曾近距离观看比斯开人和曼却人的战争！那真是一场宏大的战斗啊！当然，我顺利地从那里撤离了。'
        },
        {
          role: '冒险家',
          id: '12',
          title: '格列佛游记',
          content: '一本魔法之书！',
          conclusion: '一篇日记：不可思议的景象……当我阅读这本书时，周围的一切仿佛都放大了。'
        }
      ],
      letterCN: [
        {
          role: '冒险家',
          id: 1,
          year: '2020',
          title: '给杜克主教的信',
          letter: '尊敬的杜克主教：\n白沙街疯人院已于上月完成了院中病例复审。我们将于下月15日开始为心智健全之病例陆续办理出院手续。\n本次来信意在与您进一步讨论93号病人的处置方案。经过再次测试，我们得出一个非常不幸的结论，93号病人仍然深受夸大妄想症的困扰。他声称自己独力横跨了英吉利海峡，并拥有超乎常人的野外生存技能，包括但不限于制造或驾驶热气球飞艇。\n尽管您一再强调他需要尽快出院，但我们确信病患有极大可能在院外接触新的刺激源而发展出新类型的妄想。93号病人目前不具有攻击性，但在如此严重的夸大忘想影响下，他可能进行或说服他人一同进行部分危险活动。当然我们都非常清楚，他从未也不可能独自驾驶热气球飞跃原始丛林。但考虑到他煽动性的演讲技能，将其置之不理极有可能为他人与他自己带来致命危险。\n请慎重考虑此前的决定。\n期待您的回信。\n愿主的光辉永远照耀于您。\n\n您忠实的\n洛琳·米勒'
        },
        {
          role: '冒险家',
          id: 2,
          year: '2021',
          title: '一页探险小说',
          letter: '……这是一段惊心动魄的旅程。\n大雪下了两天，路很滑，到处都在结冰。我和那三个家伙被困在了半山腰——迷路的猎人、冻得不太聪明的青年、以及一个已经失去理智胡言乱语的男人。\n我们找到了一间小木屋，猎人和青年跟我一起躲了进去。而那个古怪的男人并不听劝告，一个人住进了旁边的树洞里。\n我用火柴和干草在木屋里生了火，又去屋旁的河里找了些鱼。水流很急，差点把我冲走，然而这是我必须为同伴们做的，毕竟只有伟大的冒险家才有求生的经验。夜晚，我和青年一起去门口放哨，竟听到了野兽在草丛中踱步发出的窸窣声……这果然是一片危机四伏的森林!\n清早醒来时，树洞里的男人不见了，也许是他悄悄离开了这里，也许是他已被暗中的野兽撕碎吞食。经验匮乏的人来到这儿很难活到最后，而经验十足的冒险家才能成为最终的胜者。\n傍晚，我去寻找水源，竟在雪地里发现了一些血迹和男人衣服的碎片。我顺着那些血迹走……\n“我看见了，一个野兽拖着他，把尸体丢进草丛里。它一口咬掉了那男人的头。”\n“你确定你看到的是野兽？”猎人问我。\n“千真万确。”\n过了几天，我终于没忍住，把看到的事讲给了猎人听。我真不忍心告诉他们那男人已经死了，但我得让他们知道离开我视野范围后的危险性。猎人若有所思，返回了小木屋，还拿上了刀。\n“这里不安全，”他说，“为了灭绝后患，恐怕你得带我去看看野兽的巢穴。”\n他是对的，我们明天得去看看，说不定还能找到那男人的遗体……'
        },
        {
          role: '冒险家',
          id: 3,
          year: '2022',
          title: '库特·弗兰克的一页实验档案',
          letter: '编号：9-?-1\n姓名：库特·弗兰克\n\n【测试标记】\n1、回避型人格障碍\n2、好奇心害死猫\n\n【测试倾向】\n游离于状况外的幻想家\n\n【测试结果】\n1、整体评价:由于回避型人格障碍,9-?-1号内心极度需要他人的认可。他为自己捏造的经历和对现实事物的幻想本是逃避焦虑、自我保护的工具,但在为了隐藏秘密不惜一切手段的人群面前反而招致了祸端。\n\n2、流程说明\n本组参与者的共同点在于都有着无法告人的秘密:摆脱自己的过去、或维护一直以来的伪装。除9-?-1号外,其他几人相互猜疑,秘密都在濒临暴露的边缘。9-?-1号原本不处于矛盾的中心,但他表现得过于积极,最先发现了上局幸存的8-?-5号的行踪，引起了9-?-3号的警惕。在对各人细致观察后，9-?-1号又杜撰了冒险小说，更引起9-?-3号的怀疑。因此即使他的行为本身不具有恶意,但仍被多疑且危险性极高的9-?-3号除名。\n9-?-1号始终游离于矛盾之外,但却第一个出局,并在之后为9-?-3号所利用,成为9-?-4出局的导火索。\n\n3、分析总结\n曾经的经历导致了9-?-1号的回避型人格障碍:对他人的目光格外敏感,惧怕批评、孤立和不赞同。\n9-?-1号惧怕被群体排斥,一方面他虚构经历、为自己捏造出了领导者的身份。另一方面强行与他人交流,迫切希望证明自己。9-?-1号甚至在日记记录中混入了大量杜撰内容,一定程度上干扰了实验的记录和总结。\n自我意识太强、沉迷幻想都是9-?-1号出局的原因,但参与者们为隐藏秘密、不惜一切代价的行为才是本组人员接连出局的根源。在伪装越来越接近暴露时,人会使用越来越极端的方式进行掩藏。秘密暴露的危机感可以轻松引起仇恨、使人自相残杀,甚至并不需要药物的参与……'
        },
        {
          role: '冒险家',
          id: 4,
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '冒险家',
          id: 5,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

