<template>
  <div>
    <h5>宿伞之魂</h5>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '宿伞之魂',
          type: '传闻',
          text: '谢必安与范无咎寄魂于伞，相生相错，愁思难断。'
        },
        {
          role: '宿伞之魂',
          type: '故事背景',
          text: '范无咎与谢必安自幼结义，情同手足。某日两人相偕走至南台桥，天将下雨，谢必安要范无咎在桥下稍待躲雨，自己回家拿伞。岂料谢必安走后，大雨倾盆，河水暴涨，范不愿失约，死守桥下。不久谢取伞赶回，只见河水没过桥面，范已不知所踪。谢必安痛不欲生，从此只着白衣，无论晴雨都背着当日黑伞，神色癫狂，最终自缢于南台桥下。而那把见证两人兄弟情谊的黑伞，却在不久后被一商贾买下，不知去向。'
        }
      ],
      deductionCN: [
        {
          role: '宿伞之魂',
          id: '1',
          title: '同道',
          content: '初见，何来一见如故？',
          conclusion: '绑在一起的两块腰牌：依稀可以看到范无咎和谢必安两位衙役的名字。'
        },
        {
          role: '宿伞之魂',
          id: '2',
          title: '忧',
          content: '做恶之人！罪有应得！',
          conclusion: '一张状书：地方大员状告衙役在酒肆伤其独子。'
        },
        {
          role: '宿伞之魂',
          id: '3',
          title: '疾风',
          content: '情谊何苦？',
          conclusion: '行侠仗义换来的不一定是赞誉。'
        },
        {
          role: '宿伞之魂',
          id: '4',
          title: '骤雨',
          content: '浮名何用？',
          conclusion: '“当天是谁动的手？是你还是谢必安？”'
        },
        {
          role: '宿伞之魂',
          id: '5',
          title: '劫',
          content: '命若蜉蝣，岂可撼树？',
          conclusion: '一封密函：地方大员让县衙十天之内，给她一个交代。'
        },
        {
          role: '宿伞之魂',
          id: '6',
          title: '一个理由',
          content: '不可弃……',
          conclusion: '第一份认罪书：谢必安承认自己于酒肆伤人，与他人无关。'
        },
        {
          role: '宿伞之魂',
          id: '7',
          title: '一个借口',
          content: '不可留……',
          conclusion: '第二份认罪书：范无咎承认自己于酒肆伤人，与他人无关。'
        },
        {
          role: '宿伞之魂',
          id: '8',
          title: '无人可安',
          content: '身在绝处，并不是每次都可以逢生。',
          conclusion: '一张委派状：委派谢必安和范无咎一同追拿逃犯。'
        },
        {
          role: '宿伞之魂',
          id: '9',
          title: '无人不咎',
          content: '天与不取，必受其咎。',
          conclusion: '一纸书信：范无咎约谢必安南台桥相见，商议如何解决“伤人”一事。'
        },
        {
          role: '宿伞之魂',
          id: '10',
          title: '风雨不度',
          content: '是非？对错……',
          conclusion: '谢必安用缉拿逃犯的功绩，换来了一个选择“真相”的机会。他选择自己做唯一的“戴罪之人”。'
        },
        {
          role: '宿伞之魂',
          id: '11',
          title: '南台不归',
          content: '谁是食言之人？',
          conclusion: '范无咎明白，大员要的不是真相，而是要有人为此付出代价。'
        },
        {
          role: '宿伞之魂',
          id: '12',
          title: '云销雨未霁',
          content: '再见，岂会此生不见？',
          conclusion: '一张结案状：衙役范无咎在酒肆伤人，但在案情查明之前，就遇暴雨溺亡于南台桥下，伤人案就此作结。'
        }
      ],
      letterCN: [
        {
          role: '宿伞之魂',
          id: 'I',
          year: '2020',
          title: '江城子·中元夜雨有感',
          letter: '西风吹梦到江皋，断魂消，落花飘。记得重逢，流水怨春潮。\n只有青灯相忆否，人去也，惜花朝。\n而今休说旧时桥，倩谁描，数声箫。一曲离情，明月暗中宵。\n此际相思千万缕，清夜永，漏声遥。'
        },
        {
          role: '宿伞之魂',
          id: 'II',
          year: '2021',
          title: '一套被妥善收存的书信',
          letter: '【第一封】\n青玉案·宿科布多寄南台贤弟\n明炳丹心焉可灭，边未靖，金瓯缺。称戈予誓从戎业。切莫等闲，君当烺烺，落拓空对月。生将拼却汗青血。死亦守持碎玉节。待得凯乐朝天阙。九州生气，洒向千峰，裂尽关山雪。\n雍正九年五月初七素公敬上\n\n【第二封】\n素公吾兄，见字如晤:\n塞上孤障，周敝寒凉。然兄只道寸心笑傲，近况片字不言，却是不知素公体无恙否?运途济否?忧恚遣否?时年痹疾再患否?\n素公苦心良言，吾焉能不知。非吾闾里高卧，不襄家国天下事，实乃烽烟苦布衣，殊不忍见哀鸿。与其长缨羡列鼎，孰若仗剑济壑陵。\n说时有趣，前日仗义陇亩，同遇玄衣客扶弱纵豪。酒过得意，行尽青山，交为知己。若素公再至福州，定为引荐。盼君早日大捷而归。\n自古封侯万里路，漫漫白骨蔽川原。我知素公非贪生怕死之徒，然沙场凶险，兄可记与吾仍有前约未续，定要\n(信未写完，笔墨止于最后一个字，且最后一笔被重重拉扯歪斜出去) '
        },
        {
          role: '宿伞之魂',
          id: 'III',
          year: '2022',
          title: '一份笔迹不同的实验记录草稿',
          letter: '【实验场地】湖景村\n【实验对象】5-0-3 （使用特殊道具）\n【实验道具编号】 5-0-3-U\n【已知道具信息】\n有关5-0-3-U的传说称，5-0-3-U蕴含神秘的东方力量。试验表明，5-0-3-U内确有微量生物能反应，但记录者认为该能量反应与“内宿亡灵”的传说毫无关联，或许与它曾长期处于特殊生态环境有关。\n目前暂无法解释的异常之处在于，将5-0-3-U置于湿润环境中，控制湿度变量后静置，会检测到不同程度的磁场变化。变量与结果数据间暂未建立相关模型。\n\n【实验准备】\n①将道具5-0-3-U置于湖景村A号大船的X标记位，控制范围环境内的湿润度，使其达到磁场变化度最大的数据点。\n②若相关目标对象5-0-3成功进入游戏，则诱导他前往标记地点；若5-0-3未能进入游戏，则本则实验记录暂时终止。\n\n【观测记录】\n（后半页为额外粘贴的纸张，字迹与上半页明显不同，且十分凌乱，似为实时速记）\n对象5-0-3已成功进入游戏；\n5-0-3已位于标记点，并已发现船舱中表现异常的水纹信息；另，该地环境异常湿润，越接近5-0-3-U所处位置湿感越重；\n5-0-3尝试破解水纹符号；\n5-0-3似乎看见了某种无法被观测到的东西；\n5-0-3似被影响，陷入混乱；\n……（内容被涂抹）\n5-0-3情绪已逐渐趋于稳定，精神状态呈正向转变；\n5-0-3离开标记点，前往5-0-2所在方位；\n……'
        },
        {
          role: '宿伞之魂',
          id: 'IV',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '宿伞之魂',
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

