<template>
  <div>
    <h3>教授</h3>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '教授',
          type: '传闻',
          text: '卢基诺教授曾以无尽的求知欲探寻着人类的起源，却在这条路上，触摸到了人类进化的未来。'
        },
        {
          role: '教授',
          type: '故事背景',
          text: '“人类是从猴子进化来的，那在猴子之前呢？”\n——卢基诺教授曾以无尽的求知欲探寻着人类的起源，却在这条路上，触摸到了人类进化的未来。'
        }
      ],
      deductionCN: [
        {
          role: '教授',
          id: 1,
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '教授',
          id: 2,
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '教授',
          id: 3,
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '教授',
          id: '4',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '教授',
          id: '5',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '教授',
          id: '6',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '教授',
          id: '7',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '教授',
          id: '8',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '教授',
          id: '9',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '教授',
          id: '10',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        }
      ],
      letterCN: [
        {
          role: '教授',
          id: 1,
          year: '2020',
          title: '湖景村调查报告',
          letter: '尊敬的吉尔曼小姐:\n正如您上次回信中所谈到的那样，我们对沃尔克在湖景村的寄宿家庭进行了深入调查，并持续关注着沃尔克家人的动向。\n在这个过程中我们发现，沃尔克的兄弟，达伦，一位大学实验室的清洁人员，他所任职的实验室内有位教授神秘失踪。警察在这位教授的书房中发现了奇怪的巨大鳞片，通过一些内部消息，我们了解到这些鳞片与我们的调查员在湖景村当地林场内找到的鳞片非常相似。\n而更让我们感到不安的是，达伦在上个月也突然销声匿迹，甚至扔下了自己病重的母亲。\n这一系列失踪事件均与湖景村相关，我们的调查员认为其中可能牵涉到一些有组织犯罪。出于对员工人身安全的考虑，我不得不非常遗憾地通知您，调查将无法继续进行。您此前支付的相应款项将在本周内退还。\n\n祝安\n您忠诚的\n亚瑟·罗素'
        },
        {
          role: '教授',
          id: 2,
          year: '2021',
          title: '一篇日记',
          letter: '当我真实地与他们相见后，他们的身影终于变得明晰。那位先生名为卢基诺·迪鲁西——他比我预见的更和善、友好。初到时我在餐厅里遇见了他，他穿着一件洗得快褪色的白衬衣，头上贴着绷带，正阅读桌上写着房间和姓名的名片。他是那么彬彬有礼，甚至并未像常人那样大呼小叫地对我肩上的鸮产生好奇，只是礼貌地问好，为我指引房间。\n另一位名叫黛米·波本的女士在下午到达了庄园。晚餐时，餐桌上气氛很好，波本小姐很健谈。迪鲁西先生话不多，但也会在沉默的间隙回答、应和我们。他介绍说自己是一名研究者，为了收集资料来到这里。\n我隐约看到迪鲁西先生的衣领下有些鳞片似的碎屑和怪异的伤痕，他察觉了我目光，笑着解释那是研究留下的“礼物”。他稳重而严谨，的确具有研究者的气质，我难以想象是什么样的经历让他受到如此怪异的影响。我又想起曾经看到的结局，奇怪，我在那悲剧的结尾并不能看清迪鲁西先生的影子……\n关于未来的景象里还有第四人，也许，明天我们可以在愉悦的气氛中等待她的到来。'
        },
        {
          role: '教授',
          id: 3,
          year: '2022',
          title: '卢基诺·迪鲁西的实验报告',
          letter: '编号：6-1-4\n姓名：卢基诺·迪鲁西\n\n【测试标记】\n1、警觉性\n2、适度的求知欲\n\n【测试倾向】\n怀揣戒心的探寻者，本组唯一存在的实验对象\n\n【测试结果】\n1、整体评价：\n对于未知，6-1-4可以自我把握探寻的尺度。也许正因其可控的好奇心，他是本组中唯一一位“存在”的参与者。\n\n2、流程说明：\n第6组实验过程中，6-1-4全程拥有十足的警觉性。即使在6-0-5献祭、局面已经完全混乱后，也能清醒地与危险保持距离。\n在实验的善后处理过程中，发生了预料之外的状况：实验结束的第一晚起，6-1-1于处理室中消失，在地面留下一片水渍；次日6-1-3消失，同样仅留下深色的积水。同组除6-1-4外的其余五人，皆在其后三日内接连消失，其中包括已确认丧生的参与者的遗体。\n目前仍未知五名参与者消失的原因，但经过检验，留下的水渍与本组实验场地中的湖水成分高度相似。\n\n3、实验总结\n第六组消失的五人，无论从生命体征的意义，还是从现实肉体的意义上，都已经不复存在。而比起“消失”，我更愿意称他们为“被抹除了存在的证明”。在层层监管下，化为了一滩潮湿阴冷的水渍。\n6-1-4是唯一被留下的观察对象，这也许正因他对未知的适度好奇，未知也适度地“关照”了他。与他曾经被爬虫咬伤的经历对比，我认为他在过去的经历中至少学到了保持适当敬畏和警惕。\n在先前收集的资料中，那些愚昧的渔民对湖中“未知的存在”言之凿凿。如今我也见识到相似的怪象，但也许我有机会进行观察和实验，用更严谨的原理进行解释。\n五人的消失使本组实验不再具有太多意义，因此本组档案已经封存（或考虑废除）。可以重新开启“第六组”，再次向湖景村实验场地投入卢基诺·迪鲁西，以及其他与本组相似的“独特而危险”的实验对象。\n新的第六组能否得出与本组相似的结果？是否能重现此次的有趣情境？人们向来对未知恐惧，但在那些神秘的现象中寻求规律，也正是实验中令人激动的部分。'
        },
        {
          role: '教授',
          id: 4,
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '教授',
          id: 5,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

