<template>
  <div style="padding:8px;">
    <h5>入殓师</h5>
    <Letter :letter="letterCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      letterCN: [
        {
          id: 'I',
          year: '2020',
          title: '一封来自过去的信',
          letter: '亲爱的伊索：\n当你收到这封信时，想必会感到迷惑，\n由衷的感激我最忠诚的朋友艾莉莎将它送达。\n现在的你会是怎样的呢?\n在我的记忆里，你是个善良又温柔的孩子。\n看着你成为一位像你父亲一样受人欢迎的优雅绅士，曾是我灰暗生活中最美好的愿景。\n美好到让我以为，只要有这个愿景存在，我就可以忍受一切苦痛。\n可是……\n好在有卡尔先生在，将你交由他抚养，或许多少能减轻一些我的罪孽吧。\n虽然他不善言辞，看似有一些脾气古怪，但请相信我，他是一个好人。\n毕竟在我最痛苦的时光里，是他的陪伴和帮助，让我近乎崩塌的灵魂得到了安抚和解脱。\n我知道这辩解苍白无力。\n但请不要怀疑我对你的爱\n请相信我已经尽了最大的努力，希望自己有机会亲口对你说出\n“我亲爱的孩子，生日快乐”\n以及……请原谅我\n\n祝安\n你怯懦的母亲\nY.R'
        },
        {
          id: 'II',
          year: '2021',
          title: '伊索·卡尔的日记',
          letter: '……\n人终于到齐，信上说游戏将在三天后开始。明天，我差不多该去跟那个男人谈谈了。\n昨天晚上我梦见了杰伊先生，他站在昏黄的灯光下，为棺木里的人整理遗容。我帮他把白色的鲜花摆进棺木里，他拍着我的肩，说我做得不错。\n我认为这梦是一种暗示，恭喜我找到了目标，也提醒我要做该做的事情。\n这些年我谨记杰伊先生的教诲，谨记自己送行人的身份。进入庄园后，我一直在寻找一个合适的人作为新的开端。那个躲躲闪闪的女孩不行，那个口音奇怪的暴躁男人也不行，足够沉默的家伙才最适合躺在柔软舒适的棺木里……而现在，我终于找到了！\n那是一张多么适合永久沉睡的脸！他总是一副藏着秘密似的、害怕见人的神情，一语不发地坐在角落里。我想，只有我能理解他，他也能够理解我。明天我会去跟他谈谈……最好是写个字条或写封信，只有他能明白，我多需要他成为我“无声的朋友”。\n对了，如果他乐意的话，我也可以帮忙“照顾”一下他的小狗。而剩下的两个人，尽管他们不是最合适的人选，但我总会等到一个为他们送行的机会。\n我已经迫不及待地想要打开化妆箱，完成一名引渡者的使命。'
        },
        {
          id: 'III',
          year: '2022',
          title: '伊索·卡尔的一页实验档案',
          letter: '编号:3-?-1\n姓名:伊索·卡尔\n\n【测试标记】\n1、行动力\n2、情感淡漠\n3、认知偏差\n\n【测试倾向】\n表面稳定的危险角色\n\n【测试结果】\n1、整体评价:\n3-?-1遵守规则，情绪稳定，除过度内向性外没有明显的可标记特质。但过往经历导致了他没有常规的生死观，唯一驱动他行动的，是引导挣扎之人体面地走向终结的愿望。由于目的明确、行动力极强，3-1-2和3-1-4都因他出局。\n2、流程说明:\n除3-1-4外，该组选取的实验对象都具备相同特质:安静低调，习惯独处，不会主动引发矛盾。\n实验初期，3-?-1与3-?-3相互吸引。这种吸引既来自于3-?-3对书信的着迷，也来自于3-?-1对理想目标的珍惜。在目的明确、一切按计划进行的情况下，3-?-1遵守规则，情绪稳定。\n对3-1-2和3-1-4使用药物后，稳定的局面被打破。3-1-2的不安感被激发，逐渐牵连到同样受过去阴影影响的3-1-4。但此时3-?-1并未受到环境的影响。直到丧失猎物后，3-1-4失去冷静、表现出了极强的攻击性。计划受到干涉促使3-? -1内在个性暴露。\n3、实验总结:\n受成长经历和教育背景的影响，3-?-1对生命有异于常人的认知:认为生与死没有差异，引导挣扎之人体面地走向终结是自己的使命。\n与同组其他参与者感性上受过去经历的影响不同，这种认知根深蒂固，影响了3-?-1理性上的判断。因此，3-?-1外表和行为模式上十分正常，但内里的认知偏差驱动他做出了种种极端行为。\n实验前期，3-?-1与3-?-3之间的惺惺相惜并非来自同盟或同伴间的依赖，而是出于一种猎人对稀有猎物的凝视。在失去猎物后，被刺激的3-?-1不仅除去了干扰自己计划的3-1-4，最终还以3-1-2的出局达成了自己的目的。可见3-?-1对外来情感刺激的反应是淡漠的，达成自身目标的内在驱动力才是影响3-?-1行为的唯一因素。而在此前提下，当他的计划受阻、行动受到干扰时，所表现出来的，也许才是3-?-1的本性。'
        },
        {
          id: 'IV',
          year: '2023',
          title: 'Coming Soon',
          letter: 'Coming Soon'
        },
        {
          id: 'V',
          year: '2024',
          title: 'Coming Soon',
          letter: 'Coming Soon'
        }
      ]
    }
  }
}
</script>

<style>
.demo-table-expand {
    font-size: 0;
}

.demo-table-expand .el-form-item {
    margin-right: 0;
    margin-bottom: 0;
    width: 100%;
    white-space: pre-wrap;
}
</style>
