<template>
  <div>
    <h5>入殓师</h5>
    <Character :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      deductionCN: [
        {
          role: '入殓师',
          id: '1',
          title: '学徒',
          content: '母亲拥抱死神那一天，我决定成为他的学徒。',
          conclusion: '一张照片：年长的入殓师牵着卡尔的手走出墓园，卡尔回头看着身后的墓碑。'
        },
        {
          role: '入殓师',
          id: '2',
          title: '也许，我……',
          content: '我想他更需要的是医生……',
          conclusion: '一封退学信：伊索或许有一些自闭症，或许其他问题，总之，非常抱歉，先生，我们遗憾的通知您，他无法在我们这就读。'
        },
        {
          role: '入殓师',
          id: '3',
          title: '步骤',
          content: '庄重、准确、果决。',
          conclusion: '一张步骤说明：努力说服他们，如果不行，则进行下一步，为他们注射一些水合溴化物……'
        },
        {
          role: '入殓师',
          id: '4',
          title: '死神的花束',
          content: '铅灰的墓园偶尔也有鲜艳的色彩，有时是花，有时是血。',
          conclusion: '一封信件：亲爱的伊索，好久不见，下午我会在墓园东角的黄玫瑰园等你，期待与你的见面。'
        },
        {
          role: '入殓师',
          id: '5',
          title: '勇敢一点',
          content: '那些彷徨者……太过怯懦。',
          conclusion: '一份死亡报告：死因不明，死亡时间不明，唯一明确的只有行政管的签名，所以，勇敢一点，跟这个世界说再见。'
        },
        {
          role: '入殓师',
          id: '6',
          title: '盛开之后',
          content: '死神的阶梯旁，不适合植物生长。',
          conclusion: '“孩子，她本就该走向死亡世界，而我，只是提供了一些帮助，你看，黄玫瑰花丛。很适合她长眠。”'
        },
        {
          role: '入殓师',
          id: '7',
          title: '休学期',
          content: '他准备离开了……',
          conclusion: '一篇日记：他收到了一份邀请函，我没看到内容，但那蕨类植物一般的火漆让我觉得，他不会再回来了。'
        },
        {
          role: '入殓师',
          id: '8',
          title: '最后一课',
          content: '课题比我想象的复杂一些。',
          conclusion: '一份报告：伤者杰伊·卡尔，曾遭受多重伤害，包括高空坠落引起的粉碎性骨折、利器造成的大量出血和大面积组织挫伤。'
        },
        {
          role: '入殓师',
          id: '9',
          title: '信使',
          content: '我想这是给我的，而她，只是传递者。',
          conclusion: '一份遗物清单：一些杂物和一份邀请函，蕨类火漆，来自欧利蒂丝庄园。'
        },
        {
          role: '入殓师',
          id: '10',
          title: '毕业',
          content: '棺木之中他面容庄重安详，我想，他应该会满意我的答卷。',
          conclusion: '一篇日记：我感受到溴化物流过他血管的波动，我知道我将要成为他，而他将变成自己厌恶的样子。'
        },
        {
          role: '入殓师',
          id: '11',
          title: '赴约',
          content: '我无法拒绝这次邀约，那里有太多人彷徨不前。',
          conclusion: '一篇日记：我终于能感受每次他引渡彷徨者时的喜悦，也明白了当初他赴约的迫切。'
        }
      ],
      letterCN: [
        {
          role: '入殓师',
          id: 'I',
          year: '2020',
          title: '一封来自过去的信',
          letter: '亲爱的伊索：\n当你收到这封信时，想必会感到迷惑，\n由衷的感激我最忠诚的朋友艾莉莎将它送达。\n现在的你会是怎样的呢?\n在我的记忆里，你是个善良又温柔的孩子。\n看着你成为一位像你父亲一样受人欢迎的优雅绅士，曾是我灰暗生活中最美好的愿景。\n美好到让我以为，只要有这个愿景存在，我就可以忍受一切苦痛。\n可是……\n好在有卡尔先生在，将你交由他抚养，或许多少能减轻一些我的罪孽吧。\n虽然他不善言辞，看似有一些脾气古怪，但请相信我，他是一个好人。\n毕竟在我最痛苦的时光里，是他的陪伴和帮助，让我近乎崩塌的灵魂得到了安抚和解脱。\n我知道这辩解苍白无力。\n但请不要怀疑我对你的爱\n请相信我已经尽了最大的努力，希望自己有机会亲口对你说出\n“我亲爱的孩子，生日快乐”\n以及……请原谅我\n\n祝安\n你怯懦的母亲\nY.R'
        },
        {
          role: '入殓师',
          id: 'II',
          year: '2021',
          title: '伊索·卡尔的日记',
          letter: '……\n人终于到齐，信上说游戏将在三天后开始。明天，我差不多该去跟那个男人谈谈了。\n昨天晚上我梦见了杰伊先生，他站在昏黄的灯光下，为棺木里的人整理遗容。我帮他把白色的鲜花摆进棺木里，他拍着我的肩，说我做得不错。\n我认为这梦是一种暗示，恭喜我找到了目标，也提醒我要做该做的事情。\n这些年我谨记杰伊先生的教诲，谨记自己送行人的身份。进入庄园后，我一直在寻找一个合适的人作为新的开端。那个躲躲闪闪的女孩不行，那个口音奇怪的暴躁男人也不行，足够沉默的家伙才最适合躺在柔软舒适的棺木里……而现在，我终于找到了！\n那是一张多么适合永久沉睡的脸！他总是一副藏着秘密似的、害怕见人的神情，一语不发地坐在角落里。我想，只有我能理解他，他也能够理解我。明天我会去跟他谈谈……最好是写个字条或写封信，只有他能明白，我多需要他成为我“无声的朋友”。\n对了，如果他乐意的话，我也可以帮忙“照顾”一下他的小狗。而剩下的两个人，尽管他们不是最合适的人选，但我总会等到一个为他们送行的机会。\n我已经迫不及待地想要打开化妆箱，完成一名引渡者的使命。'
        },
        {
          role: '入殓师',
          id: 'III',
          year: '2022',
          title: '伊索·卡尔的一页实验档案',
          letter: '编号：3-?-1\n姓名:伊索·卡尔\n\n【测试标记】\n1、行动力\n2、情感淡漠\n3、认知偏差\n\n【测试倾向】\n表面稳定的危险角色\n\n【测试结果】\n1、整体评价:\n3-?-1遵守规则，情绪稳定，除过度内向性外没有明显的可标记特质。但过往经历导致了他没有常规的生死观，唯一驱动他行动的，是引导挣扎之人体面地走向终结的愿望。由于目的明确、行动力极强，3-1-2和3-1-4都因他出局。\n2、流程说明:\n除3-1-4外，该组选取的实验对象都具备相同特质:安静低调，习惯独处，不会主动引发矛盾。\n实验初期，3-?-1与3-?-3相互吸引。这种吸引既来自于3-?-3对书信的着迷，也来自于3-?-1对理想目标的珍惜。在目的明确、一切按计划进行的情况下，3-?-1遵守规则，情绪稳定。\n对3-1-2和3-1-4使用药物后，稳定的局面被打破。3-1-2的不安感被激发，逐渐牵连到同样受过去阴影影响的3-1-4。但此时3-?-1并未受到环境的影响。直到丧失猎物后，3-1-4失去冷静、表现出了极强的攻击性。计划受到干涉促使3-? -1内在个性暴露。\n3、实验总结:\n受成长经历和教育背景的影响，3-?-1对生命有异于常人的认知:认为生与死没有差异，引导挣扎之人体面地走向终结是自己的使命。\n与同组其他参与者感性上受过去经历的影响不同，这种认知根深蒂固，影响了3-?-1理性上的判断。因此，3-?-1外表和行为模式上十分正常，但内里的认知偏差驱动他做出了种种极端行为。\n实验前期，3-?-1与3-?-3之间的惺惺相惜并非来自同盟或同伴间的依赖，而是出于一种猎人对稀有猎物的凝视。在失去猎物后，被刺激的3-?-1不仅除去了干扰自己计划的3-1-4，最终还以3-1-2的出局达成了自己的目的。可见3-?-1对外来情感刺激的反应是淡漠的，达成自身目标的内在驱动力才是影响3-?-1行为的唯一因素。而在此前提下，当他的计划受阻、行动受到干扰时，所表现出来的，也许才是3-?-1的本性。'
        },
        {
          role: '入殓师',
          id: 'IV',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '入殓师',
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

