<template>
  <div>
    <h5>舞女</h5>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '舞女',
          type: '传闻',
          text: '与感情不和的丈夫离婚后，没有稳定经济来源的玛格丽莎，对“自由”的另一面有了新的认识。一个成为百万富翁的机会？她当然不会错过。'
        },
        {
          role: '舞女',
          type: '故事背景',
          text: '与感情不和的丈夫离婚后，没有稳定经济来源的玛格丽莎，对＂自由＂的另一面有了新的认识。一个成为百万富翁的机会？他当然不会错过。'
        }
      ],
      deductionCN: [
        {
          role: '舞女',
          id: '1',
          title: '渔村',
          content: '它是个美丽平静的地方。',
          conclusion: '也许我会喜欢它，前提是不需要每天早起捕鱼。'
        },
        {
          role: '舞女',
          id: '2',
          title: '马戏团',
          content: '他们行色匆匆，带着一车又一车的道具和动物。',
          conclusion: '那个尖顶帐篷里似乎有我向往的一切。鲜花、华服、掌声…还有英俊微笑的小丑。'
        },
        {
          role: '舞女',
          id: '3',
          title: '玛乔丽婶婶',
          content: '她总是用那标志性的大嗓门叫我起床。',
          conclusion: '照片：一位年长女子与黑色头发的少女并排站着。尽管穿着最廉价的棉布连衣裙，也无法使少女的娇艳容貌褪色半分。'
        },
        {
          role: '舞女',
          id: '4',
          title: '馈赠',
          content: '小心对待你收到的礼物，你永远不知道代价是什么。',
          conclusion: '照片：微笑小丑向黑发女孩递出一个八音盒。'
        },
        {
          role: '舞女',
          id: '5',
          title: '尤金叔叔',
          content: '他总是皱着眉头，仿佛这世上没什么事能令他开心。',
          conclusion: '娜塔莎，离那些轻浮的家伙远点！做个安分守己的好姑娘。'
        },
        {
          role: '舞女',
          id: '6',
          title: '快步华尔兹',
          content: '这是种轻快活泼的舞蹈，但同时也颇具浪漫情调。',
          conclusion: '照片：红发年轻人与黑发少女在乡村舞会上跳舞。'
        },
        {
          role: '舞女',
          id: '7',
          title: '戛然而止',
          content: '人们并不总是有面对现实的能力和勇气',
          conclusion: '“娜塔莎，你愿意跟我一起走吗？”他这样问道。'
        },
        {
          role: '舞女',
          id: '8',
          title: '禁足',
          content: '简单的禁止必将是禁而不止。',
          conclusion: '尤金叔叔锁上了房门，只留下靠近屋顶的一扇窗。这难不倒瑟吉。'
        },
        {
          role: '舞女',
          id: '9',
          title: '宁神盐',
          content: '它有一点点苦，但你可以把它撒到汤里去。',
          conclusion: '我想尝尝看，瑟吉阻止了我，这让我有一些不安。“嘿，宝贝儿，你不会想睡过我们的旅途吧？”他这样说道。'
        },
        {
          role: '舞女',
          id: '10',
          title: '启程',
          content: '充满希望的旅途胜过终点的到达。',
          conclusion: '可那时我并未料到，未来的代价会如此沉重。'
        }
      ],
      letterCN: [
        {
          role: '舞女',
          id: 'I',
          year: '2020',
          title: '无人查收的信',
          letter: '亲爱的叔叔、婶婶：\n近来可好？我非常想念你们。\n过去的我太过愚蠢，只一心想着离开湖景村，去瑟吉口中的“大城市” 。那天晚上的罗宋汤是不是有一点苦？都是因为我，我在里面放了宁神盐，你们第二天可能会因此错过清晨的市场。\n我的心中并不是没有忐忑和犹豫，但瑟吉口中那些天花乱坠的承诺和无止境的甜言蜜语掩盖了我的不安。也许正是清楚我做了多么糟糕的事，才会放任自己那么信任瑟吉。不是因为瑟吉是个值得信赖的人，而是不相信他，就仿佛承认了自己的有眼无珠，那之后发生的所有事情，全都是我咎由自取。\n时至今日，我并不后悔离开湖景村，但我后悔用那样的方式离开，没有正式地与你们道别，而是趁着夜色偷偷逃跑。\n如果你们仍然愿意原谅愚蠢的我，请给我回信。\n我会一直等待，毕竟，瑟吉再也没法撕掉我的信了。\n\n爱你们\n娜塔莎'
        },
        {
          role: '舞女',
          id: 'II',
          year: '2021',
          title: '一张皱皱巴巴的纸条',
          letter: '相信我，再看见你的时候，真的很开心!\n我又想到了以前的日子，想起你为我包扎伤口的时候，那么的温柔！后面，噢，我不想再回忆后面发生的一切了，真的太可怕了！\n那一切不是你的意愿，也不是我的。我们都不想伤害别人。我们不是那种人。\n原谅我在这种时候再次需要你，但是除了你，我不知道应该再相信谁，我所能信任的，一直都只有你一个！我在来之前就听说那个家伙在找我，他这两天看我们的眼神，你应该也察觉到了，厌恶、恨意，我不想再经历那些可怕的事情了。请再相信我一次吧！\n求求你了，今晚大家都入睡后，来见我一面吧。\n\n会一直等你的，\n娜塔莉'
        },
        {
          role: '舞女',
          id: 'III',
          year: '2022',
          title: '玛格丽莎·泽莱的一页实验档案',
          letter: '编号：8-1-4\n姓名:玛格丽莎·泽莱\n\n【测试标记】\n1、药物实验体\n2、博取同情的示弱者\n3、多重身份的回归\n\n【测试倾向】\n在幻觉边缘摇摇欲坠的女主角\n\n【测试结果】\n1、整体评价：\n娜塔莎、娜塔莉、玛格丽特，无论哪个身份都不曾给8-1-4带来真正的自由。\n湖景村的娜塔莎身为外来者，并没有融入当地的群体（其抚养者甚至沦为了祭品）；马戏团的娜塔莉在丈夫的欺凌下伤痕累累，只能向8-0-3倾诉；惨案幸存后的玛格丽特看似摆脱了束缚，但对生活光鲜亮丽的追求成了她的隐形囚具——这是一切不幸的根源，也是她来到庄园的目的。\n\n2、流程说明：\n8-1-4在药物的影响下，将8-0-3错认为了微笑小丑瑟吉——她曾经的爱和噩梦。有那么一刻，她真正怀念过“喧嚣”马戏团温馨的家人氛围。但在认出8-0-3后，8-1-4又回到了既有的行为模式：以美貌和示弱博取同情，寻求他人的保护。\n\n3、实验总结：\n8-1-4易受药物影响，这与其过往的曲折经历有关。\n8-1-4曾积极寻求改变命运的机会。对瑟吉和8-0-3的依赖是她的弱点，也是武器。她通过瑟吉离开了渔村，（从某个角度看）通过8-0-3摆脱了瑟吉。然而，在这个过程中不断积累的负面情绪，最终成为了她挥之不去的噩梦。在药物的影响下，两个混合着希望、温暖、畏惧、愧疚种种复杂感情的形象在8-1-4眼中重叠。\n游戏开始后，随着月亮河公园惨案真相的揭晓，8-0-3对8-1-4的庇护变成了胁迫。此时，在药物影响下情绪崩溃的8-1-4走向了极端，但幸运没有在她身上重现——以后对此类药物实验体在高压下的情绪控制，需要非常谨慎。'
        },
        {
          role: '舞女',
          id: 'IV',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '舞女',
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

