<template>
  <div>
    <h5>厂长</h5>
    <Character :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      descriptionCN: [
        {
          role: '厂长',
          type: '传闻',
          text: '灰烬中复生的他到底在追寻什么？'
        },
        {
          role: '厂长',
          type: '故事背景',
          text: '里奥·贝克原本是经营纺织厂的小型工厂主，在接受朋友弗雷迪·莱利的建议后，购入了负债累累的小型枪械工厂。在里奥·贝克发现工厂资产状况不良之前，其妻与弗雷·迪莱利卷走他所有的财产，就此消失。无力承担负债的里奥·贝克在厂房内燃起了一场大火。'
        }
      ],
      deductionCN: [
        {
          role: '厂长',
          id: '1',
          title: '怒火',
          content: '把对公义的爱护歪曲为复仇和憎恨，这就是愤怒的原罪。',
          conclusion: '秘闻1：一张陈旧的处方签，上面写着简单的烧伤处理步骤。“烧伤表面必须与空气隔绝，先用油（灯油、色拉油或者黄油）涂抹伤口表面，再把面粉、石膏或磨碎的木炭均匀地洒上去，每日叠加，两周内不要洗澡或擦拭伤口。”'
        },
        {
          role: '厂长',
          id: '2',
          title: '执着',
          content: '监管者的职责就是将这些人送到他们该去的地方。',
          conclusion: '里奥·贝克总是咬紧自己的目标不放。'
        },
        {
          role: '厂长',
          id: '3',
          title: '寻踪',
          content: '等待猎物暴露弱点固然是一种方式，而优秀的猎手，有时候也会选择主动出击。',
          conclusion: '秘闻2：一场大火后，人们在残存的建筑里发现了燃烧的痕迹和一些衣服碎片。还有墙上的一行字：我会找到你们。'
        },
        {
          role: '厂长',
          id: '4',
          title: '泄愤',
          content: '当胸中的怒火无法抑制，你需要有宣泄的途径。',
          conclusion: '里奥·贝克，他的胸中充满怒火，最好祈祷自己别遇见他。'
        },
        {
          role: '厂长',
          id: '5',
          title: '猫鼠游戏',
          content: '有时候追捕与逃亡，是个漫长的过程。',
          conclusion: '在这个枯燥无味的监管者职位上，里奥·贝克找到了乐趣。'
        },
        {
          role: '厂长',
          id: '6',
          title: '惩戒',
          content: '在律法所赋予的权利以外，行使惩罚他人的意欲亦被归作愤怒。',
          conclusion: '“这看起来像在放烟花，让我想起了过去的某些时光。”'
        },
        {
          role: '厂长',
          id: '7',
          title: '出其不意',
          content: '有时候生活中需要一些惊喜，游戏也一样。',
          conclusion: '看起来里奥·贝克的行为升级了。他变得更迅捷，也更可怕。'
        },
        {
          role: '厂长',
          id: '8',
          title: '攻其不备',
          content: '专注是极好的特质，至少对监管者来说是这样。',
          conclusion: '秘闻3：一把样式奇特的镰刀，不知道属于谁。'
        },
        {
          role: '厂长',
          id: '9',
          title: '无人可挡',
          content: '当愤怒到达顶点时，还有什么能阻拦你吗？',
          conclusion: '虽然这些木板很容易被破坏，但它仍然有效地拖延了监管者的脚步。'
        },
        {
          role: '厂长',
          id: '10',
          title: '徘徊者',
          content: '我会找到你们。',
          conclusion: '秘闻4：一份陈旧的报纸上写着停产的工厂中有个身缠绷带的怪异男子不断徘徊。看起来和里奥·贝克很像。'
        }
      ],
      letterCN: [
        {
          role: '厂长',
          id: 'I',
          year: '2019',
          title: '一封未收到的信',
          letter: '亲爱的里奥：\n当你看到这封信时，我知道你不会高兴，事实上，我相信你会非常生气。弗雷迪向我求婚了。\n我接受了。\n留下这封信并不是想寻求你的谅解，我知道自己将要做一件非常糟糕的事情。\n但看在丽莎的份上，请一定要谨慎考虑之前我们争论过的投资。\n纺织厂的竞争很激烈，我知道。\n可是，请相信我，人们总是要穿新衣服的，而来复枪可不是什么“日常用品”。\n更何况，人们为什么要购买你的来复枪呢？\n毕竟，贝克家向上数五代也没一个人擅长打猎！\n抱歉，我又开始了。\n我不应该对你的生意指手画脚。\n但亲爱的，这就像一种本能，我总是希望你能做出最明智的选择。\n照顾好丽莎，找一个更适合你的女人。\n再次，我真的很抱歉。\n玛莎·雷明顿'
        },
        {
          role: '厂长',
          id: 'II',
          year: '2020',
          title: '军工厂失火案024号证物',
          letter: '（一叠纸张，最上面的看起来是一封没寄出的信，有反复涂改的痕迹）\n亲爱的丽莎：\n……你在孤儿院过得怎么样？我交代过神父每天给你加一瓶牛奶，你要记得喝。这天越来越冷了，你晩上睡觉总喜欢踢被子，虽然可能是随的我，但这毛病不好，一定要改掉。\n还有你母亲，她选择离开这件事和你一点关系都没有，你不是没人要的孩子，她（字迹被涂掉，看不清內容）。\n孩子，我要离开这了，想看看有没有新的赚钱的法子，不用找我。\n你要好好长大成人，好好活下去。\n以后你一定要记住，不要轻信任何人，要为自己活下去，太多的善意并不能绐你带来好运，爸爸花了太长时间来学会这些，但我知道，我的丽莎一向聪明，知道该怎么做。\n最后，还记得我们经常玩的烧草人游戏吗？不久，那被诅咒的工厂都会是你的玩具。\n这大概是你无能的父亲唯一能为你做的。\n……………………\n（后面的內容因为烟熏已经无法辨认，信纸下还有一堆单据，其中露出的一角写着\n赔偿金受益人：丽莎·贝克）'
        },
        {
          role: '厂长',
          id: 'III',
          year: '2021',
          title: '一本留存于圣心医院的病例',
          letter: '（规格统一的文档，页眉的编号依稀可见）\n【项目编号】？？？-031\n【对象编号】1-12-22-13\n（手术过程记录已被摧毁，只剩附录页有部分完好的内容）\n日期：1897年12月21日\n\n随笔记录：\n一如既往，“余烬” 会在12月21日表现出异常的亢奋。这种亢奋的机体层面原因至今不明，只能归咎于实验对象残存的记忆信息刺激。以个人情感化视角而非实验结果或病理经验评估并不专业，但考虑到只是日常随笔记录，我姑且对此行为作出断言：对该日期过分敏感，并不仅仅因为这是“余烬” 自焚的日期，还有更深层的原因，诸如：家庭经历重大变故的日期或某个重要人物的相关日期。\n若能准确定义，大概率可以找出阻止这种不受控制的兴奋行为，更便于日常实验。\n毕竟，不可否认，“余烬”作为实验对象的表现十分优异。相比之下，大多数实验对象在实验过程中的表现十分单一， 约有85%的几率在中途死亡，而“余烬”往往能反馈出更多令人兴奋的可能性。\n十年实验以来，一直如此。\n不过，即便“余烬”是值得学界探索的存在，但将其向外公布或允许外人探视这类事，目前来说并不在我的考虑范围之内。且外界看来，“余烬”在十年前就于社会关系中死亡。那么，那名言行神秘的先生到底是从何得知“余烬”的存活信息及所在地？此人近日来信愈发频繁，我应该更加防备于他的试探，警惕信息外露。\n除此之外，有一件事可以确定，带入过多的个人情绪会影响理智判断。\n也许我不应该给实验对象取名，12月21日之后，“余烬”只是实验对象1-12-22-13号。\n（后面的资料被人刻意销毁，无法辨认）'
        },
        {
          role: '厂长',
          id: 'IV',
          year: '2022',
          title: '秘密运往圣心医院的巨大木箱内的留言',
          letter: 'B. A.\n如您所见，箱内最后一份行为记录与失活的机体皆指向不幸的事实：交易对象1-12-22-13机能修正和精神控制实验失败。\n虽然第五组测试过程顺利，然实验结束后，1-12-22-13的自我意识冲破了记忆外壳的封锁，并在4-1-1号测试对象的刺激下复苏了部分情感，而后，其行为举止由屡次违背命令发展为激烈反抗甚至出现袭击主人的倾向——关于这一点，您所提供的前六种精神疗法或药物控制手段无一生效，现已采用第七种处理方式将其焚毁。\n按照约定，送还实验体。\n另，相关交易记录、往来文件及圣心医院失踪病患调查资料已销毁。\n期待与您的二次合作。\n\n来自您忠实的合作者'
        },
        {
          role: '厂长',
          id: 'V',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

