<template>
  <div>
    <h5>记者</h5>
    <Character :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      descriptionCN: [
        {
          role: '记者',
          type: '传闻',
          text: 'TBD'
        },
        {
          role: '记者',
          type: '故事背景',
          text: 'TBD'
        }
      ],
      deductionCN: [
        {
          role: '记者',
          id: '1',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '记者',
          id: '2',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '记者',
          id: '3',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '记者',
          id: '4',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '记者',
          id: '5',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '记者',
          id: '6',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '记者',
          id: '7',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '记者',
          id: '8',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '记者',
          id: '9',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          role: '记者',
          id: '10',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        }
      ],
      letterCN: [
        {
          role: '记者',
          id: 'I',
          year: '2020',
          title: '一封分手信',
          letter: '亲爱的弗雷迪：\n当你看到这封信时，我应该已经离开了。\n我知道你也许会感到困惑，但看看那份报纸吧。\n不，实际上，可能你对新闻中发生的事了如指掌。\n那该死的收购，毁了一切。\n还记得离开白沙街的前一晚吗？\n我问你，密涅瓦是一个好的投资计划吗？\n那是唯一一次， 我要求你百分百的诚实。\n你回答我，如果投资人拥有充足的经验与资本，这将为他带来巨额的财富。\n可看看新闻里说了什么吧！\n“这位可怜的投资者购入了一间负债超过四位数的工厂”。\n是的，里奥并不聪明，没什么投资经验，更别说资本了。\n可就算是没脑子的人都知道，不要花钱去承担额外的债务。\n我知道你会有什么反应。\n所以我不会留下来听你讲那些漂亮话。\n丽莎，我的女儿，我不会让她一个人呆在孤儿院里。\n至于未出世的安纳西，我会给她起一个新名字。\n别替我们担心将来的生活会怎样。\n安纳西会和丽莎一块长大，成为一个诚实的人。\n弗雷迪，没人能完全逃避责任。\n我们都需要为做过的事付出代价。\n\n玛莎·雷明顿'
        },
        {
          role: '记者',
          id: 'II',
          year: '2021',
          title: '一封诊断回函',
          letter: '尊敬的莱利先生：\n上周我与尊夫人进行了3小时左右的谈话，从心理学角度判断，她只是轻度焦虑，这种现象，在怀孕之初很常见，您无需过度担心，充足的休息和适当的辅助药物可以极大缓解这种症状。\n辅助药物我已随信奉上，请按照药品说明服用。\n另外，尊夫人下次复诊时，若您能一同前来与我商讨一下关于上次提及的投资“那所医院”的事宜，我将不甚感激。\n梅斯默医生'
        },
        {
          role: '记者',
          id: 'III',
          year: '2022',
          title: '弗雷迪·莱利一页实验档案',
          letter: '编号：4-0-3\n姓名：弗雷迪·莱利\n\n【测试标记】\n1、谎言\n2、爱人\n3、不择手段\n\n【测试倾向】\n攫取利益的“场面人”\n\n【测试结果】\n1、整体评价：\n从各个方面而言，4-0-3都是一个非常标准的实验对象，虚伪、残忍、高傲、好高骛远，野心打造的培养皿让这些劣根性在他身上以最典型的方式呈现，而报复心则变成了比药物更好的催化剂。\n\n2、流程说明:\n 实验准备阶段，4-0-3对4-0-2表现出强烈敌意，也对4-1-1和4-0-4表现出不同程度的警戒心。对其他实验对象都主观保持一定距离。\n直到4-0-2与他的爆发冲突，暴露了他过于强烈的报复心。触发了风险性较高的惩罚执行人，不过因为暂时没有更合适的实验对象可递补，在这轮实验中，并没有对4-0-3进行根除性惩罚。\n实验第二阶段，参考第一阶段新收集的信息，对4-0-3进行了诱导，让他提前接收到了本次实验为他设置的关键信息。4-0-3的敌视对象从4-0-2变为4-0-4。在这一阶段，他针对4-0-4的行为较第一阶段更谨慎且具目的性，但这种行为特征仅限于行动对象是4-0-4时，这使他忽略了更致命的潜在威胁。\n\n3、实验总结：\n4-0-2的实际到达时间与预期稍有不符，这一定程度上影响到了4-0-3和4-0-4的药物使用序列，在实验流程中造成了一定麻烦，但至少目前看来对实验结果本身并没有造成太大影响。\n但考虑到之后实验的多样性，这种风险还需要进一步避免， 在实验环境足够稳定前，不要盲目使用药物。\n而且本次实验也证明，某些实验结论的验证，并不一定需要药物介入。\n单就4-0-3而言，早期，他所有的行为目的，都源自阶级优越感和追逐最大化攫取利益的人性本质，这些更具社会性的行为动机即便是负面的，但实际上却为他在实验预设的环境中创造了一个区别于其他实验对象的安全区。\n直到更个体性的动机来源——爱占据主导，基于这种正面本质滋生的负面行为动机——复仇，在对标的物造成更大伤害的同时，也破坏了他自身的防御外壳，使4-0-3屏蔽了自身针对标的物以外的警戒视角，彻底暴露在了真正的危险之中。'
        },
        {
          role: '记者',
          id: 'IV',
          year: '2023',
          title: '一封遗嘱',
          letter: '遗嘱人：\n姓名：弗莱迪.莱利\n年龄：38岁\n我立此遗嘱，对我名下所有财产，作如下处理：\n名下所有现金存款，全数遗留交予凯恩.莱利先生由其自行处理。\n其余所持债券、动产及不动产，除位于密涅瓦附近的公寓外，都委托基奥-巴利尔律师事务所进行拍卖。拍卖所得，用以偿还我个人名下债务。\n位于密涅瓦附近的公寓继续作为抵偿悬赏，寻找失踪女性——（被涂掉，依稀看清首字母是L）\n本遗嘱一式两份，一份由我收执，一份交由委托执行人基奥-巴利尔律师事务所保存。\n此遗嘱若6个月内未由我本人撤回，既视为即时生效。\n自书立遗嘱人签名：弗莱迪.莱利\n见证人签名：（被涂掉）'
        },
        {
          role: '记者',
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

