<template>
  <div id="app">
    <h4>调酒师</h4>
    <Character :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      deductionCN: [
        {
          id: '1',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '2',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '3',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '4',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '5',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '6',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '7',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '8',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '9',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        },
        {
          id: '10',
          title: 'TBD',
          content: 'TBD',
          conclusion: 'TBD'
        }
      ],
      letterCN: [
        {
          id: 'I',
          year: '2021',
          title: '写在实验报告背面的留言',
          letter: 'D,\n我们把他们从地中海带回来的东西做成了九份提取样本,并用老鼠进行了比对实验。\n其中有一份基本符合你的预期。还有一份样本遗失。\n那个叛徒偷走了它。\n(没有落款,纸张右下角有一个晕染开的淡红色水渍)'
        },
        {
          id: 'II',
          year: '2022',
          title: '一张旧船票背面的赠言',
          letter: 'D，\n我们尝试了很多次，新的老鼠都只能在恐慌中走向死亡，无一例外。\n这显然不是他期望的结果。\n现在，我们有两种选择：\n直接开始“游戏”，或者，找到那个叛徒。\n也许我们应该分头行动。\n（船票从南安普顿前往纽约，并未被兑现）'
        },
        {
          id: 'III',
          year: '2023',
          title: '黛米·波本的一页实验档案',
          letter: '编号：6-？-3（编号第二位数字经过反复涂改，最终标注为？）\n姓名：黛米·波本\n\n【测试标记】\n1、耐药性？\n2、无畏的“棋子”\n\n【测试倾向】\n错误的“正确的答案”\n\n【测试结果】\n1. 整体评价\n从学识角度来说，6-？- 3远不及她的兄长，但显然，挑战规则的无畏或者说疯狂，并不需要通过血缘维系。\n2. 流程说明\n6 -？-3的到来，比我预想的早了许多。\n起初，我尝试使用药物对其个体进行控制，但在进行到第二组试剂时，本已在多次实验过程中效果稳定的药效出现了一些小的波动，对于这种情况，我不得不做出一些冒险的选择：一方面，我无法舍弃这个独特的实验对象。\n另一方面，将这位稀有的“知情者”长时间留滞于庄园内，极易引来不必要的麻烦，让整个实验都毁于一旦。\n而从以往的重复实验中可以看出，重复实验次数越多，药物作用于实验对象的稳定性就会越差。\n因此，即便上一组善后事故并未完全解决，我仍开启了新一组测试，并为了尽快补齐实验对象，将上一组实验中留存的样本第二次投入，同时启用了备用实验对象新的6 - 1 - 4。\n在这场被真相包裹着的谎言实验中，6 -？-3全程都表现出了无畏到冲动、直接到残忍的行为模式。\n最直接的表现是实验过程中，出于对稳定性的考虑，我曾向6 - 1 - 2、6 - 1 - 4和6 -？-3都做出引导干预，但与其他其他实验对象不同，6 -？-3并未对指引内容做出任何修正。\n在如何赢得这场游戏的策略选择上，6 -？-3从一开始实际上就放弃了对真相与谎言的识别，而是选择了摧毁谎言与真相本身。\n3. 实验总结：\n在针对6 -？-3的实验规划初期，我预期将她作为两类研发试剂的比对组，投入到游戏中。\n但显然，我对我前同僚的“杰作”做出了错误的预估。\n虽然最终药效截然不同（甚至可以说相反），但这两类研发试剂的核心元素都萃取自相同的原料。这应该就是它们彼此作用产生了强大的耐药性的原因，因为我对这种耐药性影响的错误预估，这场实验从头到尾都充满了我未能及时察觉的变数。\n而这些变数最终让我意识到，6 -？-3确实是一颗出色的实验棋子，但我并不是唯一的棋手。\n但或许，我是更优秀的那个，毕竟我最终找到了属于我的答案，而他甚至永远不会知道，\n我们需要解决的从来都不是同样的问题了。'
        },
        {
          id: 'IV',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          id: 'V',
          year: '2025',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

