<template>
  <div>
    <h5>爱哭鬼</h5>
    <Character :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      descriptionCN: [
        {
          role: '爱哭鬼',
          type: '传闻',
          text: '罗比弄丢了自己的脑袋，这个爱哭的倒霉蛋只好拿起斧头，重复起他最擅长的事情。'
        },
        {
          role: '爱哭鬼',
          type: '故事背景',
          text: '一夜之间，罗比·怀特失去了宽敞的房子、舒适的床铺、美味的食物…还有温柔的父母，取而代之的是白沙街孤儿院里无止境的劳作与冷漠的管理员。但在姐姐多洛雷斯的帮助下，他渐渐习惯了整理庭院的工作，为院子里的杜松修剪成了他的新爱好。不久，教会接管了孤儿院，孩子们不再需要辛苦地劳动，这让罗比有些丧气。多洛雷斯不需要再上街乞讨，修女们还为所有人提供暖和的药汤，罗比的小爱好又算什么呢？毕竟那时候他与姐姐的生活正在走上正轨。这就是“爱哭鬼”罗比·怀特最后的回忆了，他在杜松树下醒来，姐姐与孤儿院都不复存在，只留下手里的枯枝。'
        }
      ],
      deductionCN: [
        {
          role: '爱哭鬼',
          id: '1',
          title: '宝物',
          content: '你的幸福是我最希望的辛苦。',
          conclusion: '日记1：罗比不知道发生了什么，他一直在问爸爸和妈妈去了哪里。我没有办法回答他，尽管想了很多答案，却都说不出口。你真是一个失败的姐姐，多洛雷斯。'
        },
        {
          role: '爱哭鬼',
          id: '2',
          title: '伪善',
          content: '别听他们说了什么，去看他们做了什么。',
          conclusion: '照片：失去一只手的女孩站在人群中，墙上挂着一条横幅：“家，甜蜜的家”'
        },
        {
          role: '爱哭鬼',
          id: '3',
          title: '曙光',
          content: '希望使人拥有力量，即使这希望永远只是希望。',
          conclusion: '日记2：麦格伦先生接管了这所孤儿院，医生和护士总是匆忙地穿梭在走廊里，而修女和神父们看起来和蔼可亲。我们开始每天祈祷，并帮助麦格伦先生打扫屋子，也许我们的日子会好起来。另，罗比拖着斧头的样子太有趣了。'
        },
        {
          role: '爱哭鬼',
          id: '4',
          title: '药方',
          content: '惊吓和恐惧是治疗的一部分。',
          conclusion: '《水疗法》：水可以清理生命中过于暴力和极端的成分，用冷水持续冲洗病人头部，可让他们疯狂的大脑冷静下来。注意，操作需要至少一名或以上的医护人员在场，疗程结束后建议配置驱寒汤药。'
        },
        {
          role: '爱哭鬼',
          id: '5',
          title: '圣人',
          content: '真正的天使未必是天使。',
          conclusion: '日记3：医生们总是在讨论伤寒热，争论着究竟哪一种配方是最有效的，以及要如何预防它。现在我们拥有源源不断的面包和牛奶，崭新的书本和整洁的衣服，洛琳修女说这都是病人们应有的东西。我有些不安，这一切看起来太好了。'
        },
        {
          role: '爱哭鬼',
          id: '6',
          title: '秘密',
          content: '每个人都有良知。',
          conclusion: '可要是每个人的良知都不尽相同呢？'
        },
        {
          role: '爱哭鬼',
          id: '7',
          title: '宵禁',
          content: '好孩子都会按时入睡。',
          conclusion: '日记4：罗比又一次在宵禁后翻窗进来，那扇窗户的螺栓有些松脱，他差点被落下的窗框砸断手指。杜松树的故事我已经讲过无数次了，可他好像还是听不腻。洛琳修女说，也许他需要的只是陪伴。我问她为什么我们必须分开，她叹了口气，没有回答。'
        },
        {
          role: '爱哭鬼',
          id: '8',
          title: '杜松树',
          content: '我应该修好那扇窗户的，都是我的错。',
          conclusion: '日记5：罗比最喜欢杜松树了，如果那故事成真就好了。'
        },
        {
          role: '爱哭鬼',
          id: '9',
          title: '良知',
          content: '洛琳修女说她也无能为力，她很抱歉。',
          conclusion: '剪报：一名病患失去控制，造成白沙街疯人院内多人伤亡，所幸该病患并未尝试逃离。这使当地居民开始反思，是否应当允许此类机构在城内运营。'
        }
      ],
      letterCN: [
        {
          role: '爱哭鬼',
          id: 'I',
          year: '2020',
          title: '给德罗斯男爵的信',
          letter: '尊敬的德罗斯男爵:\n作为精神病学领域的专家，您一直乐于分享并不断地给予我医疗上的建议。这次写信打扰，是想请您帮助我进行一项鉴定，如您愿意拨冗前往白沙街疯人院，我将不胜感激。\n在收到一位义工的举报信后，我察觉到白沙街疯人院内可能存在着一些恐怖的谬误。我不能也不应当在这封信中透露，但今天院内发生的一桩“事故”使我彻夜难眠，我坐在书桌前，反复地诘问自己，是否遵循了神的旨意?\n我曾对您说过，这所疯人院将是我的家庭。在一个井然有序凡事基于友爱和睦的家庭中，孩子们对父母拥有绝对的信赖与服从，父母又如何可无视孩子们所遭受的折磨?正如雅各书2:17所言“信心若无行为便是死的” ，又有 第九诫“不可做假证，害你的近人”，我若将自己视作孩子们的父母，则不可无视他们的真实处境和那些不应降临到他们身上的痛苦。\n为了您的安全和确保复诊计划的顺利实施，我将以捐助人的身份将您介绍给杜克神父。\n期待您的回信。\n\n祝安\n洛琳修女'
        },
        {
          role: '爱哭鬼',
          id: 'II',
          year: '2021',
          title: '扉页被撕毁的日记本',
          letter: '2月11日\n吵死了!新来的家伙真是个爱哭鬼!\n\n2月12日\n我就猜到会发生这种事!只是小哭包居然没事，反而他姐姐……不过容貌并不能当饭吃，缺了一只手更容易得到施舍。\n说起来幸好今天有个讨得最少的倒霉蛋垫底，不然我又得被“臭老鼠”打了。\n\n2月22日\n最近进进出出的陌生人变多了，还会在夜里搬运奇怪的器具。\n我昨晚看到一堆可以折叠的小刀，样子跟普通刀子不太一样，多洛雷斯说那是医疗放血工具，但我觉得那刀看起来更合适撬锁，所以悄悄拿了一把。\n其他还有什么内外都能拆分的玩偶娃娃、装饰着很多金属的腰带和头带、看起来像金属但能流动的液体……我长这么大从来没见过这些，反倒是多洛雷斯脸色不太好，自言自语放血疗法，电击腰带、人体模型……\n我问她怎么知道那么多，多洛雷斯只说以前在家庭医生那见过，我不知道她是不是在说谎，但也许他俩真的不是普通穷苦人家的孤儿。\n\n3月29日\n虽然讨厌的老鼠变成了修女和神父，但严苛的规矩同样让人喘不过气。还有那些苦涩的药剂，他们说我病了，但我知道我没病。\n\n4月6日\n最近脑子好晕，好累，所幸勉强还能握住炭笔。\n\n4月9日\n我看到了!多洛雷斯把小哭包的汤药倒在了窗外的杜松树下!我这愚蠢的脑子真是被老鼠啃了，我也早该这么做!\n\n4月23日\n糟了，多洛雷斯也开始大叫了，她认不出小哭包了?可她不是把汤药倒了吗?\n\n4月24日\n我就猜到我就猜到，他们会拖走多洛雷斯我就猜到!\n今晚要不要偷偷去看看?\n我记得那有个提拉式的窗户，虽然一直锁着而且很重，但我的小刀应该能撬开。\n\n4月25日\n我这个房间都能听到多洛雷斯的惨叫，更别提小哭包的位置了，我要不要过去安慰他?说起来已经好久没听到他哭了。\n等等，我好像听到了斧子落地的声音……他想干什么?\n不会的，应该没事吧，他那么矮进不去的，窗户也那么重……\n窗户?窗户好像……\n我的老天!糟透了!昨晚离开时我忘了关窗!'
        },
        {
          role: '爱哭鬼',
          id: 'III',
          year: '2022',
          title: '半块白面包压住的纸片',
          letter: '亲爱的罗比:\n姐姐终于等到这一天了，你看今晚多安静啊，没有聒噪的打骂声，也没有人会来打扰我。\n我终于可以像个正常人一样提着篮子去见你了。还给你拿了一块白面包喔——姐姐终于拿到了。\n我想我该趁还拿得动笔，趁脑子还清醒的间隙，和你好好说说话。\n小罗比还记得我们一家四口在一起的日子吗？\n那种充溢满胸腔的软糯糯的暖意，是我如今逐渐麻痹的五感中最清晰的感知。\n那时每次睡前父亲母亲都会给我们一人一个晚安吻，而你会在每天清晨轻吻我的脸，等我睁眼，你就拉着我说姐姐早安。逆着晨光，你的眼睛笑盈盈的，像天使一样，我一辈子都不会忘。\n那时我常常想，这微不足道的一生最值得自豪的，就是有这么温柔的父亲母亲，有这么可爱的罗比。\n然而，然而……\n都说没人能预料到爱何时来临，一旦发生就不能回头。在这一点上，死亡与它多么相似啊。\n但对我来说整个世界被掩埋的绝望，对他们来说，不过就只是杜松树下多了一抔土那么不值一提。\n即便有人不再存在，白沙街疯人院依旧如常，冰冷得让人窒息，无所感受，无从思考、机械的重复，宛如死亡。\n我不怕自己就这样死去，只怕在去见你前不能为你做任何事。\n\n不过现在，这样的机会降临了，过去的屈辱都是值得的。你知道吗罗比，他们最初对我特别戒备。\n可高高在上的“神明”们，谁能拒绝一个逗乐又听话的傻子呢？\n既然他们早已丧失了人性，既然疯人院就是个地狱，那就让一切都埋在这抔土下好了！\n放心，姐姐也会去见你的。能让罗比不孤单的话，姐姐也会开心。\n\n对了，还有最重要的一句：\n我的天使，生日快乐。\n\n永远爱你并且永远想你的\n姐姐'
        },
        {
          role: '爱哭鬼',
          id: 'IV',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '爱哭鬼',
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

