<template>
  <div>
    <h3>盲女</h3>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '盲女',
          type: '传闻',
          text: '尽管海伦娜被疾病夺去了视力,但她还能通过听觉感知外界。在这场游戏中,她会紧紧抓住自己的手杖,想办法赢得胜利。'
        },
        {
          role: '盲女',
          type: '故事背景',
          text: '海伦娜在一岁时被高烧夺去了视力，但在父母和一位家庭教师的细心教导下，她仍然学会了读书认字。然而海伦娜还有更大的野心，进入大学成为一位文学学士。也许欧利蒂丝庄园的主人能为她的学费买单？至少那封以盲文写的邀请函上是这样表达的。'
        }
      ],
      deductionCN: [
        {
          role: '盲女',
          id: 1,
          title: '家人',
          content: '我……最珍贵的宝物。',
          conclusion: '一张照片：戴着眼镜的中年男子站在病床前，低头看向床上的小女孩。'
        },
        {
          role: '盲女',
          id: 2,
          title: '父亲的礼物',
          content: '如果可能，我希望把眼睛给她。',
          conclusion: '“带上这根手杖，仔细聆听它敲击地面的声音。”'
        },
        {
          role: '盲女',
          id: 3,
          title: '改变',
          content: '她只是太小了，无法理解这种变化。',
          conclusion: '父亲的日记1：海伦娜变得很暴躁，她开始破坏自己的玩具，医生说这完全正常，我应该想办法让她重新安静下来，也许准备更多的玩具会有效果。'
        },
        {
          role: '盲女',
          id: '4',
          title: '家庭教师',
          content: '特殊的孩子需要特殊的照顾。',
          conclusion: '每个老师都能把孩子领进教室，但并不是每个老师都能使孩子学到真正的东西。'
        },
        {
          role: '盲女',
          id: '5',
          title: '天赋',
          content: '上帝为你关了一扇门，那么他也会同时为你打开另一扇门。',
          conclusion: '海伦娜，你的领悟和学习能力让我感到惊讶和骄傲。s'
        },
        {
          role: '盲女',
          id: '6',
          title: '听话的孩子',
          content: '海伦娜，控制你的行为。',
          conclusion: '一张照片：年轻的女教师站在海伦娜的背后，双手搭在女孩的肩膀上。'
        },
        {
          role: '盲女',
          id: '7',
          title: '希望',
          content: '有人在受伤后一蹶不振，有人却变得更加坚韧。',
          conclusion: '父亲的日记2：聘请家庭教师是一个正确的决定，我从来没想过像她这样特殊的孩子，能够走到这一步。现在我的海伦娜是个小诗人了。'
        },
        {
          role: '盲女',
          id: '8',
          title: '失控',
          content: '要成长为史无前例的英雄，就得经历所有你不会再扮演的角色。',
          conclusion: '父亲的日记3：海伦娜的听力非常好。我不懂为什么她要这么说。'
        },
        {
          role: '盲女',
          id: '9',
          title: '抓住机会',
          content: '弱小也能够成为武器。',
          conclusion: '我会把你变成一个奇迹，海伦娜。超脱普罗大众，今后也难以复制的，奇迹。'
        },
        {
          role: '盲女',
          id: '10',
          title: '诚实的生活',
          content: '每个人都需要这样的机会，哪怕只有一次也好。',
          conclusion: '我想凭借自己的意愿做一次选择，尽管我还未曾明确这意愿是什么。但是人总要踏出这一步，不是吗？'
        }
      ],
      letterCN: [
        {
          role: '盲女',
          id: 1,
          year: '2020',
          title: '给父亲的信',
          letter: '亲爱的爸爸：\n每当我想起您，都会意识到自已是如此幸运。\n是您将莎莉文老师请来，为我开蒙。\n语言和文字的魅力之门向我敞开。\n可是，爸爸。\n有时我会感到困惑。\n我们说出口的言语，写在纸上的段落，究竟是源于我们曾听过的内容，还是自己的思想与经历呢？\n我对自己写的东西始终心存疑虑，常被那些可能不完全属于自己的思想所折磨。\n莎莉文老师说，只要我坚持写下去，就能重新建立信心，发挥自己的才能。\n尽管我尚未确认自己是否具备创作的才能，可我仍希望有朝一日，自己能在文学上有所进步。\n用文字去表达自己的思想与经历，将是多么美妙的一件事啊！\n在重新拾起盲文笔前，我将前往欧利蒂丝庄园参加一场研讨会。\n请不用担心，莎莉文老师的朋友将与我在庄园中会面。\n\n爱您的\n海伦娜'
        },
        {
          role: '盲女',
          id: 2,
          year: '2021',
          title: '海伦娜的庄园日记',
          letter: '或许，这会是最后一份记录了。\n虽然在这里我未曾寻获关于创作的答察，但我所经历的，却足以成为日后我取之不尽的灵感源泉。\n像所有冒险故事的开端一样，最开始一切并不顺利，那时这场“研讨”甚至算不上公平，这也让我充满不安。\n直到那个孩子的出现。\n我们如此相似——都曾陷入缪斯的樊笼，\n又如此不同——即便我无比渴望，但却并未如她那般坦率的面对自我。\n她重塑了我，就像当年的莎莉文老师一样，她们让这迷雾般的旅程，显露出了光明的终点。\n而作为那个越过终点的胜利者\n明天，我会带着我的“奖励”，离开这里，继续我的追求。\n这次，我将不再迷茫。'
        },
        {
          role: '盲女',
          id: 3,
          year: '2022',
          title: '海伦娜·亚当斯的一页实验档案',
          letter: '编号：0-0-3号（后被人涂改为0-1-3）\n姓名：海伦娜·亚当斯\n\n【测试标记】\n1、善意\n2、驯服\n3、自我保护\n\n【测试倾向】\n完美的“对照组”\n\n【测试结果】\n1、整体评价：内心的狂躁，被自身的良知和教育驯化，有健全的人格认知和成熟的理智，本应是理想的对照组，却表现出了易于被驯服，难以被控制的特质。\n\n2、流程说明:\n   经过前期对0-1-0号的反复测试，在实验中，取数据反馈较为合理的剂量对0-0-3号进行分阶段的药物干预。\n实验开始初期，同为“羔羊”的处境，让0-0-3号对0-0-4号展现出了近乎圣母的同情与关怀。而作为“同盟”的认知，也让她对0-1-0号释出了善意的信号。\n对于更为神秘强势的0-0-1号，0-0-3号则一直保持戒心。随着实验的推进，过度的同情心，让0-0-3号本应清醒理智的头脑在极端情况下做出了错误的判断，一步步踏入了0-0-4号的陷阱，成为了这场游戏实际上的唯一的惩罚执行人。\n“真相”揭露后，认知偏差的冲击和强烈的愧疚感击碎了0-0-3号自身人格的保护壳，似乎为药效的发挥创造了良好的环境。但最终实验结果，却未达预期。\n\n3、分析总结：\n作为莎莉文的猎物，从早期与莎莉文交流中，我判断0-0-3本应是完美的对照组。\n实验早期，她的表现也似乎证明了这一点——过度善良，易于驯服。\n以常规案例而言，这种对照组，在被“打破”后，会被迅速同化至实验组一侧。\n但也许是因为对于近况信息存在一定缺失，在实验设置的“失控”阶段，0-0-3号展现出了意料之中的反抗性，并最终否定了预期中的实验结果。\n目前暂无法判断造成这种结果的，是药物的不稳定性或者剂量不足，还是0-0-3号的本身特质。'
        },
        {
          role: '盲女',
          id: 4,
          year: '2023',
          title: '草稿本里，一张被精心黏贴的盲文信残片',
          letter: '……当他拿起猎枪时，我揭开了恐惧的真相。\n当你找到哨子时，我触及了善意的假面。\n当我进入那间书房时，我知晓了人性的真实。\n那么现在……\n伽拉……\n游戏就要结束了。\n……\n当我们推开那扇结束一切噩梦的大门后，\n我们会看到什么呢？\n会是真正的你或者我自己么？\n\n（残片边缘有一些散溅的血迹，下面用浮夸的花写体标注着意大利文的：3号缪斯）'
        },
        {
          role: '盲女',
          id: 5,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

