<template>
  <div>
    <h5>邮差</h5>
    <Letter :letter="letterCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      letterCN: [
        {
          id: 'I',
          year: '2020',
          title: '维克多和威克的来往信件',
          letter: '致威克:\n嘿，伙计,大家都夸我们是好搭档!\n不过我觉得你实在太贪吃了。要不是你上次只顾着把盘里的香肠油汁舔个精光,我们也不会错过递送时间了。\n邮差可不能迟到!\n身为邮差,就要自觉、自省、自律,专注于本职工作——我们的目标就是信,哪怕再次身临那场火灾也一样不能退缩!\n我不太会说话,只能用行动来回应大家的信任。所以,拿出我们的决心好么,伙计!\n\n另:\n…顺便给我写一封信吧。当然,你只管“说”,内容就由我来代笔记录怎么样?那就——开始吧!\n\n你的搭档\n维克多\n\n致维克多:\n汪汪汪呜,呜,汪汪,呜呜,汪,汪汪呜汪,呜呜呜,汪呜汪,呜汪汪，汪汪，呜汪,呜汪,汪，汪呜汪——?\n\n你的搭档\n威克'
        },
        {
          id: 'II',
          year: '2021',
          title: '笔记的一页',
          letter: '每天敲门声响起，他们就会把纸条给我，让我代为传递彼此的秘密。\n然而，我的门从未被敲响过。\n那天，第一声“咚…咚…咚……”在早上十点响起。那个女孩敲响她房门的时候，威克和我已等候多时。\n我没有立刻开门前往她的房间，而是和威克交待道：“嘘，轻一点儿，伙计。”\n威克现在已经能明白敲门声是新的“铜铃”，它每次会在我打开房门的瞬间，摇着尾巴“汪汪汪” 地冲出去。这种的热情总是吓得那个女孩立刻关上房门。直到听见我的脚步声停在门口，她才会将门开一个小缝，从防盗链的上方递出一张纸条。我接过纸条递给被我挪到一旁的威克，它心满意足地叼着纸条离开。\n每次在我拧动我的房门把手时，后方会传来关上房门的声音。\n第二声“咔嚓……嘶…砰……”于午餐前响起，十分准时。\n这时的我正将头贴在我的房门上，静静等待。一旁的威克已经迫不及待地围着我转圈了。在我听到了他关房门的声音后，会对威克做一个准备的手势，在“咚，咚”响起后我会等待片刻。确保在我开门的时候，走廊上只剩下被孤零零地放在他房间门前地毯下的纸条。\n虽然我们只见过两次面，但三人之中他最受我的青睐。他给我写的纸条总是很长很长，我更愿意称那为一封信。信里所有的叙述，用的全都是过去时态，我想他一定受到过很特殊的教育。\n今天下午的“咚！咚！咚！”出乎预料。远处传来的敲门声显得很暴躁，我还是第一次听到。\n不是之前的那两个人，那就只能是他了。\n就在我迟疑的时候，敲门声突然变成了“咚咚咚咚咚咚咚咚咚！”，威克和我面面相觑。\n一阵急促的脚步声后，我的房门第一次被敲响了。巨大的“咚！咚！咚！”一下一下敲在我的心口上。直到现在细细回想，我仍分辨不出那时的我，激动与惊慌，哪种情绪更多。\n我并不想开门，我之前接触过像他这样性格暴躁的人，那种经历使我不知道应该和他如何交流。但当我想起我们彼此之间不能说话的规则后，我鼓足勇气打开了房门。\n我打开一条小缝，立刻感受到了一股巨力。门被推开，在墙上反弹发出愤怒的一声“嘣！”。我赶紧低下头，避免和他视线接触，目光落在那件灰白的衣服上。这时威克已经竖起了耳朵，剧烈地拍打尾巴。\n然后，地面上多了一张纸条。我不敢去捡，因为我看见那只巨大的右脚抬起，脑子里闪过“可怕的铁锤子要将木包裹盒给砸碎了！”的画面。幸好它最终只是重重地砸在了地面上。\n那双脚彻底从我眼前消失后，我才敢长舒一口气，蹲下来去捡那张纸条，然后关上房门。\n纸条被不规整地折叠起来，朝上的一面写着几个歪歪扭扭的字母，似乎是给那个女孩的。纸面粗糙的凸起感像是被涂改多次——这或许是他不愿意写纸条的原因。\n我犹豫过后没打开。\n放下纸条，我在桌面上敲了敲。听着“咚咚咚”的声音，我低头问放松地摇着尾巴的威克：“你说，这是不是世界上最美妙的声音呀?”'
        },
        {
          id: 'III',
          year: '2022',
          title: '维克多·葛兰兹的一页实验档案',
          letter: '编号：3-?-3\n\n【测试标记】\n1、沉默孤僻\n2、缺乏安全感\n3、情感隔离\n\n【测试倾向】\n3-？-3对秘密的守护，是潜意识里负面情绪的一种投射。\n\n【测试结果】\n1、整体评价\n3-？-3的过往经历使得他养成极为孤僻的性格，对人类表现出一定程度的冷漠，于是将情感转化为对客体物件和非人生命体的同情与怜悯。\n尽管3-？-3并不在乎人，但是却对“秘密”本身具有极强的情感反应，即使只是微不足道的秘密，他也能做到守口如瓶。\n\n2、流程说明\n除3-1-4之外，第三组人员在一开始进入庄园后便保持着彼此之间陌生与疏离的态度，对社交的高度恐惧使得第三组的游戏以书信与纸条的形式展开。在一定的时间长度内，这样的方式使他们的关系保持着一种微妙的平衡，相互连结却又互不打扰。看似寡言少语的3-？-3对这种交流乐在其中，口头语言被三人简化成某种符号，他借用宠物，谨慎地通过那些符号式语言进行着交流，在某种程度上，这种响应与回馈也反映出3-？-3潜意识里与他人产生关联的期待。\n三人当中，3-？-3和3-？-1保持着某种特殊的关系，不过3-？-3并不知晓3-？-1对他表现得如此积极的根本目的，反而对3-？-1制造的虚假形象产生某种好感，因为在对待交流这件事上，3-？-1给他的字条更长，用词更为得体。\n而落于纸面的字条也容易成为挑拨与告密的证据，这也是中后期实验发展的有效催化剂。用药后，3-1-2对3-1-4的忌惮越发强烈，她将这种不安诉诸3-？-3与3-？-1，不过3-？-3并没有对3-1-4展现出特别明显的情绪波动，因为他所在意的并不在于人际关系。\n这场实验因为预判失误而在后期中断，不过那场纵火事故并没有影响实验结果，相反事故本身也成为了实验的重要影响因子。当3-？-3想起遗落在大火之中的字条，他奋不顾身地冲进火焰，确保字条在这场充满阴谋的事故后不会落入他人手中，然而他没能从大火中走出来。\n\n3、实验总结\n尽管字条使得3-？-3与其他参与者产生了短暂的关系，不过这依然没有打破3-？-3本身的情感隔离所。他在事故中展现出来的行为代表着他对秘密本身的态度，即至始至终地保持着守口如瓶，而这种不惜代价的行为，也映射出他对曾经过错的内疚、弥补与修正。'
        },
        {
          id: 'IV',
          year: '2023',
          title: 'Coming Soon',
          letter: 'Coming Soon'
        },
        {
          id: 'V',
          year: '2024',
          title: 'Coming Soon',
          letter: 'Coming Soon'
        }
      ]
    }
  }
}
</script>

<style>
.demo-table-expand {
    font-size: 0;
}

.demo-table-expand .el-form-item {
    margin-right: 0;
    margin-bottom: 0;
    width: 100%;
    white-space: pre-wrap;
}
</style>
