<template>
  <div>
    <h3>破轮</h3>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '破轮',
          type: '传闻',
          text: '身形古怪的艺人出现在街头，套着床罩，带着面具，用各种诡异畸形的体态演出着不入流的戏剧。'
        },
        {
          role: '破轮',
          type: '故事背景',
          text: '威尔三兄弟是三胞胎侏儒，他们年少时被父母抛弃，只能相依为命。\n所幸一位剧院老板看中了他们的畸形体态，将他们收养进了戏剧剧团，还为他们提供了伪装畸形的身份和演出挣钱的舞台。\n但好景不长，剧院老板在一场演出后神秘失踪。此后，三兄弟也不知所踪。\n数日后，一个身形古怪的艺人出现在接头，他用布套和床罩罩住自己，戴着面具，用各种奇怪的体态演出着不入流的古怪戏剧。\n他最多的演出，就是带上三个面具，蹲在一个破碎的轮子旁，同时扮演的父亲，母亲和孩子：\n“看呐，破碎的家庭就像破碎的轮子”\n“少了任何一个人”\n“生活就无法前进”\n每当夜幕降临，只剩最后一个人驻足时，他就会掀开身上的布套，在对方的惊恐中问到：“你见过我们的父母亲吗？”\n第二日，城市的角落就会多出一堆被碾碎的残渣。'
        }
      ],
      deductionCN: [
        {
          role: '破轮',
          id: 1,
          title: '三胞胎',
          content: '戏谑：三粒干瘪的豌豆壳，真是父母期待的礼物。',
          conclusion: '十多年前的一页日记：他们不会有出息了，我还要养着这三张嘴巴到什么时候？'
        },
        {
          role: '破轮',
          id: 2,
          title: '舞台',
          content: '悲观：虽然有了舞台，但我们只剩彼此了。',
          conclusion: '一张通告：圣凯瑟琳剧团将重新开演——阔别已久的灵感佳作！'
        },
        {
          role: '破轮',
          id: 3,
          title: '面具之下',
          content: '寡言：……………………',
          conclusion: '一张字条：记住，不要让他们看见你们的真面目，舞台需要的是角色。'
        },
        {
          role: '破轮',
          id: '4',
          title: '默契',
          content: '戏谑：高雅的戏剧，能承受什么样的玩笑？',
          conclusion: '剧评：新加入的配角很有灵气——灵活修长的大高个，蹒跚的弓背老妪，金字塔般敦实可靠的老者，还有三个极有天赋的幼童！'
        },
        {
          role: '破轮',
          id: '5',
          title: '丑角',
          content: '悲观：狭隘，偏见！出路？',
          conclusion: '一张剧本稿：圣凯瑟琳击碎了行刑的车轮。上面写满了批注：我们能做的更好。'
        },
        {
          role: '破轮',
          id: '6',
          title: '虚名',
          content: '寡言：……………………！',
          conclusion: '擅自篡改的台词：父母只会承认有出息的孩子。而舞台不会承认畸形的怪胎！'
        },
        {
          role: '破轮',
          id: '7',
          title: '闹剧',
          content: '戏谑：所有演出，最后能留在人心中的只有角色，不是吗？',
          conclusion: '剧评：演出混乱、尴尬、聒噪。只要观众能捏着鼻子看下去，就能发现有些配角在无理地抢占更多的表演机会。'
        },
        {
          role: '破轮',
          id: '8',
          title: '占有欲',
          content: '悲观：出名的结果可不一定都是好的。',
          conclusion: '一张扯碎的邀约，上有潦草的文字：他们的畸形、弱小、默契都是我的灵感源泉！是我交会了他们一切！谁也不能夺走他们！'
        },
        {
          role: '破轮',
          id: '9',
          title: '惩戒',
          content: '寡言：！！……',
          conclusion: '谣传：舞台幕后，常常有怪叫传出——据说是剧院老板在和演员彻夜寻找灵感，排演新的剧目。'
        },
        {
          role: '破轮',
          id: '10',
          title: '轮动',
          content: '戏谑、悲观、寡言：破碎的轮子只要重新组装，就能继续滚动。',
          conclusion: '一则报道：圣凯瑟琳剧团老板身亡，一众演员纷纷出逃失踪。'
        }
      ],
      letterCN: [
        {
          role: '破轮',
          id: 1,
          year: '2022',
          title: '一叠潦草的剧本',
          letter: '威尔家族的快乐生活\n\n主要演员表：\n威尔三兄弟 饰 寡言的伯爵、悲观的夫人、戏谑的小少爷\n“凯瑟琳” 饰 凯瑟琳\n……\n\n内景——威尔家族的庄园——餐厅——清晨\n威尔家族伯爵和夫人阴沉地坐于餐厅。\n小少爷来迟，蹦跳着进场。\n小少爷：早餐是果酱配面包？看起来真不错！\n伯爵沉默不语，摆弄着刀叉。\n夫人：不……鲜红的果酱，又是不吉利的一天……\n小少爷：“还有洗净的番茄——上面没有那些恶心的泥巴，哥哥们一定也会很喜欢。”\n伯爵皱眉。\n伯爵：那个人贩子——\n小少爷：哦，那个人贩子……我可怜的哥哥们被他骗入剧团这么久，还差点被卖到马戏团——\n小少爷笑着比了比自己矮小的身形，又指了指同样矮小的伯爵和夫人。\n小少爷：就因为我们家族这与众不同的身形？\n伯爵瞪了小少爷一眼，愤懑地敲了敲桌子。\n夫人：可恨的凶手！圣凯瑟琳剧院的老板！就是他伤害了我的孩子们！\n夫人捂脸发抖。\n夫人：就算这个卑劣的家伙已束手就擒，但想到他还在地下室里琢磨那些不堪的念头，我就不得安宁。\n伯爵：轮刑！轮刑！伤我家族之人！轮刑！\n夫人：一起抓到的，那个叫凯瑟琳的演员呢？她嘴上讨饶，但一定也有瓜葛！\n小少爷：不如交给我处理——她值得一场生动的演出。\n\n外景——庄园外——角斗场——中午\n伯爵、夫人位于角斗场观赛台上，小少爷和被镣铐绑住的凯瑟琳在角斗场内。\n夫人：我的孩子，你真的要和这个女帮凶同台吗？这太危险了！\n小少爷：哥哥们在剧院里的精彩经历，她可一样都不能错过！\n小少爷笑着钻进了一个巨大的、装满钉刺的特制轮子。\n凯瑟琳面对逼近的钉刺轮子，惊恐地扭着手脚和镣铐。\n凯瑟琳：饶了我吧！剧场老板的所作所为，我全然不知！我只是一直、一直在舞台上演出而已！\n轮子绕着凯瑟琳旋转着、发出刺耳的声音。\n小少爷：跟我说说你的演出。\n凯瑟琳：扮演“圣凯瑟琳”，击碎“处刑的车轮”，日复一日。\n夫人捂脸悲鸣。\n夫人：击碎车轮？日复一日？你习以为常，从未为此愧疚？\n伯爵闷声。\n伯爵：车轮？击碎？日复一日？！\n凯瑟琳：那……那只是一幕演出啊……\n小少爷：对你，那只是演出。嘿嘿嘿……可我，无法欣赏那种卑劣的舞台。\n凯瑟琳：那您，您喜欢什么样的故事？\n小少爷：……嘻嘻，这种。\n钉刺轮子旋转、飞起、砸落。'
        },
        {
          role: '破轮',
          id: 2,
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '破轮',
          id: 3,
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '破轮',
          id: 4,
          year: '2025',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '破轮',
          id: 5,
          year: '2026',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

