<template>
  <div>
    <h5>魔术师</h5>
    <Character :note="note" :description="descriptionCN" :letter="letterCN" :deduction="deductionCN" />
    <router-view />
  </div>
</template>

<script>
export default {
  data() {
    return {
      note: '',
      descriptionCN: [
        {
          role: '魔术师',
          type: '传闻',
          text: '这位擅长人体消失魔术的魔术师并没有获得大众认同，也许在曾经出现过无数知名艺术家的欧利蒂丝庄园里，他能找到新的表演灵感？'
        },
        {
          role: '魔术师',
          type: '故事背景',
          text: '瑟维·勒·罗伊在比利时开启了他的魔术生涯，并搬到伦敦开设属于自己的魔术用品专营店。但这位喜爱人体消失魔术的魔术师并没有获得大众认同，也许在曾经出现过无数知名艺术家的欧利蒂丝庄园里，他能找到新的表演灵感？'
        }
      ],
      deductionCN: [
        {
          role: '魔术师',
          id: '1',
          title: '萌芽',
          content: '你永远不知道自己会看到什么。',
          conclusion: '一张照片：年幼的男孩与父母站在剧院门口，剧院门口贴着一张魔术表演的海报。'
        },
        {
          role: '魔术师',
          id: '2',
          title: '学习',
          content: '真正的教育者会解放你，但也许不是每个人都能理解这一点。',
          conclusion: '一张照片：白胡子魔术师正在为一个戴礼帽的年轻人展示手中的扑克牌。'
        },
        {
          role: '魔术师',
          id: '3',
          title: '助手',
          content: '魔术师不是真正的魔术师，他只是一个假装魔术师的演员。',
          conclusion: '一张照片：戴着礼帽的年轻人站在白胡子魔术师的身边，一脸阴沉。'
        },
        {
          role: '魔术师',
          id: '4',
          title: '增长',
          content: '这世上从未有一蹴而就的事情。',
          conclusion: '同样也没人甘愿一辈子只做陪衬。人人都想要成为舞台的中心。'
        },
        {
          role: '魔术师',
          id: '5',
          title: '圆满',
          content: '你会站在舞台上的，瑟维，你就是为此而生。那个老头子这样说过。',
          conclusion: '一张照片：戴礼帽的年轻人站在舞台上表演扑克牌魔术。他看起来有些意兴阑珊。'
        },
        {
          role: '魔术师',
          id: '6',
          title: '成功的法门',
          content: '努力和天分哪个更重要？对没天分的人来说，努力就是全部。',
          conclusion: '一张照片：戴礼帽的年轻人正在整理魔术道具，地上摆着一些锁链和铁丝。'
        },
        {
          role: '魔术师',
          id: '7',
          title: '法外之徒',
          content: '伟大的骗子同时也是伟大的魔术师。',
          conclusion: '一篇报道：大魔术师约翰表演时发生意外。'
        },
        {
          role: '魔术师',
          id: '8',
          title: '逃脱魔术',
          content: '在观众眼前不动声色地解除搭档的禁锢，这可是家常便饭。',
          conclusion: '只要那把锁没出什么问题。'
        },
        {
          role: '魔术师',
          id: '9',
          title: '萨斯顿三原则',
          content: '有时候过分热情的观众会带来困扰，作为表演者，你应该懂得如何处理。',
          conclusion: '魔术表演之前绝对不透露接下来的表演内容。不在同一时间、地点对相同的观众变同样的魔术两次。魔术表演过后，绝不向观众透露魔术的秘密。'
        },
        {
          role: '魔术师',
          id: '10',
          title: '近景魔术',
          content: '近距离欺骗观众的眼睛可不是什么容易的事，你得费点力气。',
          conclusion: '比如，当着别人的面凭空消失。'
        },
        {
          role: '魔术师',
          id: '11',
          title: '阿斯拉的假象',
          content: '从有到无，从此处到彼处，瑟维·勒·罗伊是本世纪最出色的逃脱魔术专家！',
          conclusion: '一张报纸：大魔术师约翰的继承人瑟维即将展开巡演。'
        }
      ],
      letterCN: [
        {
          role: '魔术师',
          id: 'I',
          year: '2020',
          title: '给德罗斯男爵的回信',
          letter: '尊敬的德罗斯男爵：\n\n正加您在来信中所提到的那样，每一次魔术表演都像在生与死的十字路口徘徊。而这种命运的不可捉摸之处常常由一些异常的迹象展示。\n在老师殒命的那个表演之夜，一个男孩闯进了后台，我犯下了人生中最严重的错误。\n这个男孩就是那个迹象。他的出现如同一个契机，点燃了我心中那若有似无的愤懑。\n我赶走那个男孩，就停止了道具检查。\n无论是有意或无意，那一晚我并没有完成自己该做的工作。\n我并不想在信中推卸我自己的责任，只是借此向您展示一个契机能够带来怎样的变动。\n您的提议我会考虑，但我并非什么侦探，对失踪的那位先生亦无了解。\n\n祝好\n您真诚的\n瑟维·勒·罗伊'
        },
        {
          role: '魔术师',
          id: 'II',
          year: '2021',
          title: '魔术师日记',
          letter: '十二月八日\n算上到达的那晚，这已经是我来这的第五天了。\n我快要受够了，那些半夜在屋里乱窜的老鼠，破破烂烂的房间……见鬼，这真是我受到过的最大侮辱！这就是给伟大魔术师的待遇？甚至连个像样的厨房和洗衣房都没有!\n答案就在眼前，可是该死的奈布·萨贝达一直阻碍调查。我敢肯定那头猪的肚子里有东西，只需要等待一个我来揭开他幕后手法的机会。\n等着吧，奈布·萨贝达，不管你在隐瞒什么，没有我识破不了的把戏!\n也许这座庄园的一切都是圈套，而我大概是这四人里唯一能看破一切的参与者。今天早上我在洗衣房里找到了几个奇怪的彩球，它们让我联想起那些报道，比加马戏团的惨案，失踪的驯兽师，野猪和惊人的“野孩子”表演……\n我敢肯定他们一定像传闻里的那些人一样，也来到了这个古怪的庄园。但后来呢？他们去哪了？\n一想到我可能住着那种三流马戏团住过的房间，我就忍不住浑身发痒。我要抓紧时间了，施展逃脱魔术，然后离开这里——带着那些该死的“证据”！'
        },
        {
          role: '魔术师',
          id: 'III',
          year: '2022',
          title: '瑟维·勒·罗伊的一页实验档案',
          letter: '编号：9-？-4\n姓名：瑟维·勒·罗伊\n\n【测试标记】\n1、多疑\n2、精于算计\n3、自视甚高\n\n【测试倾向】\n偷食糖果的“老鼠”，难敌饥肠辘辘的“猫”\n\n【测试结果】\n1、整体评价\n在过去经历中，9-？-4善于通过暗中计算他人来达成目的。但在面对真正的亡命之徒时，他过分依赖自己的判断，过多疑虑反而耽误了对抗的时机，使他受到绝对压制。\n\n2、流程说明\n在本组中，出身于中产的9-？-4拒绝与其他“地位低微” 的成员为伍。查找线索时，9-？ -4几次三番进行试探，最终触怒了9-？ -3，导致两人间矛盾激化。由于失去同盟，加之9-？ -3的刻意引导。在9-？ -4过去的杀师恶行被曝光后，所有参与者都站在了9-？ -4的对立面。\n9-？ -3是9-？ -4的主要对抗目标。他干脆利落地除去了9-？ -1，又利用9-？ -4的杀师污点转移嫌疑。连环圈套和直截了当的攻击让仍沉浸在自已疑虑中的9-？ -4措手不及，毫无反击之力。\n\n3、实验总结\n9-？ -4拥有光鲜体面的工作、业内佼佼者的地位。在同组参与者中，他一直抱有优越心理。但同时他也害怕失去来之不易的财富和地位，总是在作出判断时瞻前顾后、畏首畏尾。\n9-？ -4多疑、狡猾，两封邀请函打破了他小心维护的平静生活，逐步击溃他的心理防线。为了自保，他不得不铤而走险参加游戏。他如小心翼翼偷取食物的老鼠，总是忧虑多疑，忙着计算最保险的方案。而在这场实验中，在9-？ -4为红酒投毒事件辩解时，9-？ -3早已计划好如何铲除9-？ -4，铺下了计划的每一步。\n9-？ -4最大的错误在于低估了真正的亡命之徒。底层人为了生存早已习惯更直接残忍的手段，他们如饥肠辘辘的野猫，不屑于计算和伪装的过程。9-？ -4的出身环境限制了他恶行的尺度，性格限制了对抗强敌的反应速度一因此， 即使出身优越、心思缜密也难以填补他的劣势，当顾虑重重的作恶者和手段直接的亡命之徒被投入同一个斗兽场，其胜败结果显而易见。'
        },
        {
          role: '魔术师',
          id: 'IV',
          year: '2023',
          title: 'TBD',
          letter: 'TBD'
        },
        {
          role: '魔术师',
          id: 'V',
          year: '2024',
          title: 'TBD',
          letter: 'TBD'
        }
      ]
    }
  }
}
</script>

